#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройки(УзелИнформационнойБазы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Настройки.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
		|	Настройки.КоличествоФайлов КАК КоличествоФайлов,
		|	Настройки.ХранитьНаДиске КАК ХранитьНаДиске,
		|	Настройки.ПолныйПуть КАК ПолныйПуть,
		|	Настройки.СжиматьФайлы КАК СжиматьФайлы
		|ИЗ
		|	РегистрСведений.НастройкиАрхиваСообщенийОбменов КАК Настройки
		|ГДЕ
		|	Настройки.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("КоличествоФайлов,ХранитьНаДиске,ПолныйПуть,СжиматьФайлы");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли