
#Область СлужебныйПрограммныйИнтерфейс

#Область МаркируемаяПродукция

// Возвращаемое значение:
// см. СкладыЛокализация.ИспользуетсяМаркируемаяПродукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт

	Возврат СкладыЛокализация.ИспользуетсяМаркируемаяПродукция();

КонецФункции

// Параметры:
// РазмерПакета - Число - Количество запросов в озвращаемом пакете (возвращаемое значение)
// Возвращаемое значение:
// Строка - текст пакетного запроса, добавляемый фрагмент
Функция ТекстЗапросаМаркировки(РазмерПакета = 0) Экспорт
	
	ТекстЗапроса = "";
	
	// ++ Локализация
	ТекстЗапроса = 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоОстаткамСОрдерами.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДанныеПоОстаткамСОрдерами.Номенклатура КАК Номенклатура,
	|	ДанныеПоОстаткамСОрдерами.Характеристика КАК Характеристика,
	|	ДанныеПоОстаткамСОрдерами.Серия КАК Серия,
	|	ДанныеПоОстаткамСОрдерами.Назначение КАК Назначение,
	|	ДанныеПоОстаткамСОрдерами.Склад КАК Склад,
	|	ДанныеПоОстаткамСОрдерами.КоличествоОтгрузить КАК КоличествоОтгрузить,
	|	ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер
	|ПОМЕСТИТЬ ДанныеПоОстаткамСОрдерами
	|ИЗ
	|	ВТТоварыКОтгрузке КАК ДанныеПоОстаткамСОрдерами
	|ГДЕ
	|	НЕ ДанныеПоОстаткамСОрдерами.Ордер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка КАК Ордер,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Серия КАК Серия,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ МаркиВОрдерах
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ШтрихкодыУпаковок КАК РасходныйОрдерНаТоварыШтрихкодыУпаковок
	|ГДЕ
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер
	|			ИЗ
	|				ДанныеПоОстаткамСОрдерами КАК ДанныеПоОстаткамСОрдерами)
	|	И РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоОстаткамСОрдерами.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДанныеПоОстаткамСОрдерами.Номенклатура КАК Номенклатура,
	|	ДанныеПоОстаткамСОрдерами.Характеристика КАК Характеристика,
	|	ДанныеПоОстаткамСОрдерами.Серия КАК Серия,
	|	ДанныеПоОстаткамСОрдерами.Назначение КАК Назначение,
	|	ДанныеПоОстаткамСОрдерами.Склад КАК Склад,
	|	ДанныеПоОстаткамСОрдерами.КоличествоОтгрузить КАК КоличествоОтгрузить,
	|	ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер,
	|	МаркиВОрдерах.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	ДанныеПоОстаткамСОрдерами КАК ДанныеПоОстаткамСОрдерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаркиВОрдерах КАК МаркиВОрдерах
	|		ПО ДанныеПоОстаткамСОрдерами.Ордер = МаркиВОрдерах.Ордер
	|			И ДанныеПоОстаткамСОрдерами.Номенклатура = МаркиВОрдерах.Номенклатура
	|			И ДанныеПоОстаткамСОрдерами.Характеристика = МаркиВОрдерах.Характеристика
	|			И ДанныеПоОстаткамСОрдерами.Серия = МаркиВОрдерах.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОтгрузки,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Склад,
	|	Ордер,
	|	ШтрихкодУпаковки
	|";
	
	РазмерПакета = 3;
	// -- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти
			   
											

