
#Область ПрограммныйИнтерфейс

// Заполняет параметры отправки электронного письма.
//
// Параметры:
//  ПараметрыОтправки    - Структура - см. РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма().
//  ПараметрыДокумента   - Структура - набор данных электронного документа
//                                     см. ИнтеграцияShareКлиентСервер.НовыеПараметрыЭлектронногоДокумента().
//  ЗаполнитьПоУмолчанию - Булево - признак использования переопределения параметров отправки. По молчанию Истина.
//
Процедура ЗаполнитьПараметрыОтправкиЭлектронногоПисьма(ПараметрыОтправки, Знач ПараметрыДокумента, ЗаполнитьПоУмолчанию = Истина) Экспорт
	
КонецПроцедуры

#КонецОбласти

