

#Область ПрограммныйИнтерфейс

// Получает мобильные номера телефонов контактных лиц и контрагента.
// Рекомендуется передавать номера мобильных телефонов контактного лица и контрагента, где они заполнены.
//
// Параметры:
//  Контрагент           - ОпределяемыйТип.КонтрагентБЭД - ссылка на элемент справочника контрагенты.
//  КонтактнаяИнформация - Массив из Структура - контактная информация владельца, должна возвращаться структура из метода
//                                               см. ИнтеграцияShare.НовыйКонтактнаяИнформация()
//
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
КонецПроцедуры

// Определяет состав команд для использования сервиса 1С:Share.
//
// Параметры:
//  СоставКоманд - Массив из Структура - содержит состав команд, см. ИнтеграцияShare.НовыйСоставКомандShare
//
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт
	
КонецПроцедуры

#КонецОбласти

