
// Вызываются процедуры и функции общих модулей:
//	- РасчетСебестоимостиПрикладныеАлгоритмы.
//	- РасчетСебестоимостиПроизводство

#Область ПрограммныйИнтерфейс

#Область ЭтапыРасчета

// Этап 10.1 Распределение отклонений в стоимости и разниц в корректировке приобретений прошлого периода.
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьОтклоненияВСтоимости(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеОтклоненийВСтоимости");
	
	// Запомним существующие временные таблицы.
	СуществующиеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета);
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
	// 2. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру СебестоимостьТоваров.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 4. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
	// 5. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета);
	
	// 6. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ВыручкаИСебестоимостьПродаж.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 7. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
	
	// 8. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета);
	
	// 9. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ПрочиеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// 10. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		Неопределено,
		Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя);
	
	// 11. Получение исходных данных для трансляции
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета);
	
	// 12. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует движения по регистру ДвиженияНоменклатураДоходыРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
	// Уничтожим вспомогательные временные таблицы, созданные в данном этапе расчета.
	НовыеВТ = РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьПереченьСуществующихВременныхТаблиц(ПараметрыРасчета, СуществующиеВТ);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
КонецПроцедуры

// Этап 10.2 Распределение постатейных расходов на себестоимость товаров.
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеДопРасходовМеждуПартиямиИТоварами(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие
	 И НЕ ПараметрыРасчета.РаспределениеДопРасходовМеждуПартиямиИТоварами Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеДопРасходовМеждуПартиямиИТоварами");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета),
		,
		"ДолиДополнительныхРасходов");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляДополнительныхРасходов(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ДолиДополнительныхРасходов.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);
	
КонецПроцедуры



// Этап 18.1 (Контекст: "РаспределениеПостатейныхРасходовНаПродажу")
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределениеПостатейныхРасходовНаПродажу(ПараметрыРасчета) Экспорт
	
	Если ПараметрыРасчета.РежимЗакрытияМесяца = Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределениеПостатейныхРасходовНаПродажу");
	
	// 1. Инициализация структуры данных для расчета
	//	- формирует структуру ПараметрыРасчета.РаспределениеПартий.
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьТрансляциюПартий(
		ПараметрыРасчета,
		ТаблицаДляРаспределенияРасходовНаПродажу(ПараметрыРасчета),
		,
		"ВтРаспределениеРасходовНаПродажи",
		,
		"ВтОтборПродажПоРеализациямПрошлыхПериодов");
	
	// 2. Получение исходных данных для расчета
	// 	- формирует временную таблицу Данные.
	ПолучитьДанныеДляРаспределенияРасходовНаПродажу(ПараметрыРасчета);
	
	// 3. Помещение данных в таблицу-приемник и очистка вспомогательных временных таблиц.
	// 	- формирует временную таблицу ВтРаспределениеРасходовНаПродажи_ПрочиеРасходы.
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗавершитьРаспределениеПартий(ПараметрыРасчета);

КонецПроцедуры
		
// Этап распределения расходов будущих периодов.
//
// Параметры:
//	ПараметрыРасчета - Структура - параметры расчета себестоимости
//
Процедура РаспределитьРасходыБудущихПериодов(ПараметрыРасчета) Экспорт
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "РаспределитьРасходыБудущихПериодов");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК РаспределитьНУ,
	|	
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И Статья.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|		 И ДД.УправленческийУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|		 И Статья.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|		 И Статья.ВариантРаспределенияРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ
	|
	|ПОМЕСТИТЬ ВтРаспределенияРБП
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО Статья.Ссылка = ДД.СтатьяРасходов
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	АналитикаРасходов
	|;
	|
	|ВЫБРАТЬ
	|	Расходы.Организация КАК Организация,
	|	Расходы.Подразделение КАК Подразделение,
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СУММА(Расходы.Сумма) КАК Сумма,
	|	СУММА(Расходы.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(Расходы.СуммаУпр) КАК СуммаУпр,
	|	СУММА(Расходы.СуммаРегл) КАК СуммаРегл,
	|	СУММА(Расходы.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(Расходы.ВременнаяРазница) КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВтРасходыРБПКРаспределению
	|ИЗ
	|	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРаспределенияРБП КАК Распределение
	|		ПО Распределение.Организация = Расходы.Организация
	|		И Распределение.Подразделение = Расходы.Подразделение
	|		И Распределение.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И Распределение.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И Распределение.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|ГДЕ
	|	Расходы.СлужебноеВидДвиженияПриход
	|СГРУППИРОВАТЬ ПО
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	АналитикаРасходов
	|;
	|
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	Расходы.Организация КАК Организация,
	|	Расходы.Подразделение КАК Подразделение,
	|	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	|	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	|	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Расходы.Сумма КАК Сумма,
	|	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	|	Расходы.СуммаУпр КАК СуммаУпр,
	|	Расходы.СуммаРегл КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	|
	|	НЕОПРЕДЕЛЕНО КАК ДокументДвижения,
	|	Распределение.ДоляСтоимостиУпр КАК ДоляСтоимостиУпр,
	|	Распределение.ДоляСтоимостиРегл КАК ДоляСтоимостиРегл,
	|	Распределение.ДоляСтоимостиНУ КАК ДоляСтоимостиНУ,
	|	ДАТАВРЕМЯ(1,1,1) КАК Период,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовПолучатель,
	|	ЛОЖЬ КАК ПринятиеКНалоговомуУчету,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовУпр,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаспределенияРасходовРегл,
	|	НЕОПРЕДЕЛЕНО КАК ВариантРаздельногоУчетаНДС,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
	|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВтРасходыРБПКРаспределению КАК Расходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРаспределенияРБП КАК Распределение
	|		ПО Распределение.Организация = Расходы.Организация
	|		И Распределение.Подразделение = Расходы.Подразделение
	|		И Распределение.АналитикаРасходов = Расходы.АналитикаРасходов
	|		И Распределение.СтатьяРасходов = Расходы.СтатьяРасходов
	|		И Распределение.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2 КАК Порядок,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|
	|	ДД.Ссылка КАК ДокументДвижения,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.УправленческийУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиУпр,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.РегламентированныйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиРегл,
	|	(ВЫБОР
	|		КОГДА ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		 И ДД.НалоговыйУчет
	|			ТОГДА Строки.ДоляСтоимости
	|		ИНАЧЕ 0 КОНЕЦ) КАК ДоляСтоимостиНУ,
	|	Строки.Дата КАК Период,
	|	Строки.Подразделение КАК ПодразделениеПолучатель,
	|	Строки.СтатьяРасходов КАК СтатьяРасходовПолучатель,
	|	Строки.СтатьяРасходов.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету,
	|	Строки.АналитикаРасходов КАК АналитикаРасходовПолучатель,
	|	Строки.СтатьяРасходов.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	Строки.СтатьяРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	Строки.СтатьяРасходов.ВариантРаздельногоУчетаНДС КАК ВариантРаздельногоУчетаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП) КАК ХозяйственнаяОперация,
	|	Строки.ИдентификаторСтроки КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РаспределениеРБП) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.РаспределениеРасходовБудущихПериодов КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ДД.ВариантУказанияСуммыУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически)
	|		ИЛИ ДД.ВариантУказанияСуммыРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияСуммыРБП.ОпределяетсяАвтоматически))
	|	И НЕ ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	СтатьяРасходов,
	|	АналитикаРасходов,
	|	НаправлениеДеятельности,
	|	Порядок ВОЗР,
	|	ДокументДвижения,
	|	Период ВОЗР
	|";
	
	Выборка = РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина);
	
	СтрокаОстатка = Новый Структура;
	СуммовыеРесурсы = Новый Структура;
	
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		СтрокаОстатка.Вставить(Колонка.Имя);
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			СуммовыеРесурсы.Вставить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	СтрокаОстатка.Вставить("СуммаНУ");
	СуммовыеРесурсы.Вставить("СуммаНУ");
	
	// Формируются движения по регистрам:
	// - ВыручкаИСебестоимостьПродаж
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатка, Выборка);
			СтрокаОстатка.СуммаНУ = СтрокаОстатка.СуммаРегл - СтрокаОстатка.ПостояннаяРазница - СтрокаОстатка.ВременнаяРазница;
			Если Выборка.ДоляСтоимостиУпр = 0 Тогда
				СтрокаОстатка.Сумма = 0; 
				СтрокаОстатка.СуммаБезНДС = 0; 
				СтрокаОстатка.СуммаУпр = 0; 
			КонецЕсли;
			Если Выборка.ДоляСтоимостиРегл = 0 Тогда
				СтрокаОстатка.СуммаРегл = 0; 
			КонецЕсли;
			Если Выборка.ДоляСтоимостиНУ = 0 Тогда
				СтрокаОстатка.СуммаНУ = 0; 
				СтрокаОстатка.ПостояннаяРазница = 0; 
			КонецЕсли;
			
		ИначеЕсли СтрокаОстатка.Организация = Выборка.Организация
		 И СтрокаОстатка.Подразделение = Выборка.Подразделение
		 И СтрокаОстатка.СтатьяРасходов = Выборка.СтатьяРасходов
		 И СтрокаОстатка.АналитикаРасходов = Выборка.АналитикаРасходов
		 И СтрокаОстатка.НаправлениеДеятельности = Выборка.НаправлениеДеятельности Тогда
		
		 	Если СтрокаОстатка.ДоляСтоимостиУпр <= Выборка.ДоляСтоимостиУпр Тогда
			    ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "Сумма, СуммаБезНДС, СуммаУпр");
				СтрокаОстатка.ДоляСтоимостиУпр = 0;
			Иначе
				Если СтрокаОстатка.ДоляСтоимостиУпр <> 0 Тогда
					СуммовыеРесурсы.Сумма = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.Сумма / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
					СуммовыеРесурсы.СуммаБезНДС = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.СуммаБезНДС / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
					СуммовыеРесурсы.СуммаУпр = 
						Окр(Выборка.ДоляСтоимостиУпр * СтрокаОстатка.СуммаУпр / СтрокаОстатка.ДоляСтоимостиУпр, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиУпр = СтрокаОстатка.ДоляСтоимостиУпр - Выборка.ДоляСтоимостиУпр;
			КонецЕсли;
				
			Если СтрокаОстатка.ДоляСтоимостиРегл <= Выборка.ДоляСтоимостиРегл Тогда
				ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "СуммаРегл");
				СтрокаОстатка.ДоляСтоимостиРегл = 0;
			Иначе	
				Если СтрокаОстатка.ДоляСтоимостиРегл <> 0 Тогда
					СуммовыеРесурсы.СуммаРегл = 
						Окр(Выборка.ДоляСтоимостиРегл * СтрокаОстатка.СуммаРегл / СтрокаОстатка.ДоляСтоимостиРегл, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиРегл = СтрокаОстатка.ДоляСтоимостиРегл - Выборка.ДоляСтоимостиРегл;
			КонецЕсли;
			
			Если СтрокаОстатка.ДоляСтоимостиНУ <= Выборка.ДоляСтоимостиНУ Тогда
				ЗаполнитьЗначенияСвойств(СуммовыеРесурсы, СтрокаОстатка, "СуммаНУ, ПостояннаяРазница");
				СтрокаОстатка.ДоляСтоимостиНУ = 0;
			Иначе	
				Если СтрокаОстатка.ДоляСтоимостиНУ <> 0 Тогда
					СуммовыеРесурсы.ПостояннаяРазница = 
						Окр(Выборка.ДоляСтоимостиНУ * СтрокаОстатка.ПостояннаяРазница / СтрокаОстатка.ДоляСтоимостиНУ, 2, 1);
					СуммовыеРесурсы.СуммаНУ = 
						Окр(Выборка.ДоляСтоимостиНУ * СтрокаОстатка.СуммаНУ / СтрокаОстатка.ДоляСтоимостиНУ, 2, 1);
				КонецЕсли;
				СтрокаОстатка.ДоляСтоимостиНУ = СтрокаОстатка.ДоляСтоимостиНУ - Выборка.ДоляСтоимостиНУ;
			КонецЕсли;
			
			СуммовыеРесурсы.ВременнаяРазница = СуммовыеРесурсы.СуммаРегл - СуммовыеРесурсы.СуммаНУ - СуммовыеРесурсы.ПостояннаяРазница;
			
			СтрокаОстатка.Сумма = СтрокаОстатка.Сумма - СуммовыеРесурсы.Сумма;
			СтрокаОстатка.СуммаБезНДС = СтрокаОстатка.СуммаБезНДС - СуммовыеРесурсы.СуммаБезНДС;
			СтрокаОстатка.СуммаУпр = СтрокаОстатка.СуммаУпр - СуммовыеРесурсы.СуммаУпр;
			СтрокаОстатка.СуммаРегл = СтрокаОстатка.СуммаРегл - СуммовыеРесурсы.СуммаРегл;
			СтрокаОстатка.СуммаНУ = СтрокаОстатка.СуммаНУ - СуммовыеРесурсы.СуммаНУ;
			СтрокаОстатка.ПостояннаяРазница = СтрокаОстатка.ПостояннаяРазница - СуммовыеРесурсы.ПостояннаяРазница;
			
			// Формируются движения по регистрам:
			// - ПрочиеРасходы
			// - ПартииПрочихРасходов
			СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, Выборка, СуммовыеРесурсы);
		КонецЕсли;
		
	КонецЦикла;
	
	КУдалению = Новый Массив;
	КУдалению.Добавить("ВтРаспределенияРБП");
	КУдалению.Добавить("ВтРасходыРБПКРаспределению");
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(ПараметрыРасчета, СтрСоединить(КУдалению, ","));
	
	РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвижения(ПараметрыРасчета);
	
КонецПроцедуры

// Служебная, этап 4.5
Процедура СформироватьДвиженияРаспределениеРБП(ПараметрыРасчета, ДанныеДвижения, Суммы)
	
	// Прочие расходы
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя;
	
	КопируемыеПоля = "Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности,
		|ХозяйственнаяОперация, ИдентификаторФинЗаписи, НастройкаХозяйственнойОперации";

	// Добавим движение расход и заполним его основные свойства
	ЗаписьРасход = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения расход
	ЗаписьРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
	ЗаполнитьЗначенияСвойств(ЗаписьРасход, Суммы, "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница");
	ЗаписьРасход.КорПодразделение 	  = ДанныеДвижения.ПодразделениеПолучатель;
	ЗаписьРасход.КорСтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
	ЗаписьРасход.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	
	// Добавим движение приход и заполним его основные свойства
	ЗаписьПриход = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
	
	// Заполним дополнительные свойства движения приход
	ЗаписьПриход.ВидДвижения 	   = ВидДвиженияНакопления.Приход;
	ЗаписьПриход.Подразделение 	   = ДанныеДвижения.ПодразделениеПолучатель;
	ЗаписьПриход.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
	ЗаписьПриход.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
	ЗаписьПриход.КорПодразделение 	  = ДанныеДвижения.Подразделение;
	ЗаписьПриход.КорСтатьяРасходов    = ДанныеДвижения.СтатьяРасходов;
	ЗаписьПриход.КорАналитикаРасходов = ДанныеДвижения.АналитикаРасходов;
	
	ЗаполнитьЗначенияСвойств(ЗаписьПриход, Суммы, "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл");
	ЗаписьПриход.ПостояннаяРазница = ?(ДанныеДвижения.ПринятиеКНалоговомуУчету, Суммы.ПостояннаяРазница, Суммы.ПостояннаяРазница + Суммы.ВременнаяРазница);
	ЗаписьПриход.ВременнаяРазница = ?(ДанныеДвижения.ПринятиеКНалоговомуУчету, Суммы.ВременнаяРазница, 0);
		
	// Партии прочих расходов
	Если (ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров
	 ИЛИ ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	 И (ПараметрыРасчета.ОрганизацииСДетализациейМатериальныхИПостатейныхЗатрат.Найти(ДанныеДвижения.Организация) <> Неопределено
		//++ Локализация
		ИЛИ ПараметрыРасчета.УчетныеПолитики.УчетПартийНДСВерсии24.ИспользуютВТекущемПериоде.Найти(ДанныеДвижения.Организация) <> Неопределено
		ИЛИ ПараметрыРасчета.УчетныеПолитики.УчетПартийНДСВерсии22.ИспользуютВТекущемПериоде.Найти(ДанныеДвижения.Организация) <> Неопределено
		ИЛИ (ПараметрыРасчета.УчетныеПолитики.РаздельныйУчетПостатейныхЗатрат.ИспользуютВТекущемПериоде.Найти(ДанныеДвижения.Организация) <> Неопределено
	 		И ДанныеДвижения.ВариантРаздельногоУчетаНДС <> Перечисления.ВариантыРаздельногоУчетаНДС.Распределение)
		//-- Локализация
		) Тогда
		
		ИмяРегистра = Метаданные.РегистрыНакопления.ПартииПрочихРасходов.Имя;
		
		КопируемыеПоля = "Период, Организация, Подразделение, СтатьяРасходов, АналитикаРасходов, НаправлениеДеятельности,
			|ХозяйственнаяОперация, ИдентификаторФинЗаписи, НастройкаХозяйственнойОперации";
		
		// Добавим движение приход и заполним его основные свойства
		ЗаписьПриход = РасчетСебестоимостиКорректировкаСтоимости.ДобавитьЗаписьВТаблицуДвижений(ПараметрыРасчета, ИмяРегистра, ДанныеДвижения, КопируемыеПоля);
		
		// Заполним дополнительные свойства движения приход
		ЗаписьПриход.ВидДвижения 	   = ВидДвиженияНакопления.Приход;
		ЗаписьПриход.Подразделение 	   = ДанныеДвижения.ПодразделениеПолучатель;
		ЗаписьПриход.СтатьяРасходов    = ДанныеДвижения.СтатьяРасходовПолучатель;
		ЗаписьПриход.АналитикаРасходов = ДанныеДвижения.АналитикаРасходовПолучатель;
		ЗаписьПриход.ДокументПоступленияРасходов = ДанныеДвижения.ДокументДвижения;
		
		Если ДанныеДвижения.ВариантРаспределенияРасходовУпр = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров Тогда
			ЗаписьПриход.Стоимость = Суммы.Сумма;
			ЗаписьПриход.СтоимостьБезНДС = Суммы.СуммаБезНДС;
		КонецЕсли;
		
		Если ДанныеДвижения.ВариантРаспределенияРасходовРегл = Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров Тогда
			ЗаписьПриход.СтоимостьРегл = Суммы.СуммаРегл;
			ЗаписьПриход.ПостояннаяРазница = Суммы.ПостояннаяРазница;
			ЗаписьПриход.ВременнаяРазница = Суммы.ВременнаяРазница;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыЭтапа_РаспределитьОтклоненияВСтоимости

#Область Описание_РаспределитьОтклоненияВСтоимости

// Этап распределения отклонений в стоимости выполняет распределение фиксированных сумм на выбытия товаров в прошлых периодах,
// или на остатки партии товаров на других складах.
// Полный текст запрос формируется в функцииТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров().
// Исходные данные для распределения формируются в функции ТекстПриемникиПоТоварамПрошлыхПериодовОтклоненийВСтоимости() и 
// сохраняются во временную таблицу ПриемникиПоТоварамПрошлыхПериодов.
// Распределение на выбытия товаров в прошлых периодах определяется полем ПериодПоступления.
// 
// Если для отклонений по партии прошлого периода нет базы распределения, то такие отклонения должны 
// быть списаны на статью расходов "Выбытия товаров в прошлых периодах" для исключения зависания суммовых остатков.
//
// Формирование движений по регистру "Себестоимость товаров" описано в функциях:
//	- ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров() - формирование движений "Расход"
//	- ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров() - формирование движений "Приход" при распределении
//		отклонений на остатки товаров на других складах
//
// При списании отклонений на прочие расходы должны формироваться движения по регистрам "Прочие расходы" и "Движения Номенклатура - Доходы/расходы".
// Формирование движений по регистру "Прочие расходы" описано в функции ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы()
// Формирование движений по регистру "Движения Номенклатура - Доходы/расходы" описано в функции ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()

#КонецОбласти

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиПрочиеРасходы(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ПрочиеРасходы.Имя);
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета)
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(),
		,
		Ложь,
		Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.Имя);
	
КонецПроцедуры

// Тексты запросов

// ... общий

Функция ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстыПодготовкиДанных = Новый Массив;
	ТекстыПодготовкиДанных.Добавить(ТекстКорректировкиТоваровВПутиПрошлыеПериоды());
	ТекстыПодготовкиДанных.Добавить(ТекстПриемникиПоТоварамПрошлыхПериодовОтклоненийВСтоимости());
	ТекстыПодготовкиДанных.Добавить(ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов());
	
	ТекстЗапроса = ""
		+ СтрСоединить(ТекстыПодготовкиДанных, ОбщегоНазначения.РазделительПакетаЗапросов())
		+ ОбщегоНазначения.РазделительПакетаЗапросов()
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров()
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиПрочиеРасходы(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиПрочиеРасходы()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы(ПараметрыРасчета = Неопределено) Экспорт
	
	ТекстЗапроса = ""
		// выборка данных
		+ ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы() // результаты распределения в ВТ РаспределениеРасходов
		+ "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// ... описания данных

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ДД.КорОрганизация,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.ТипЗапасов,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК НДСРегл,
		|	0 КАК НДСУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиПрочиеРасходы()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		
		|	ДД.ХозяйственнаяОперация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	0 КАК Сумма,
		|	0 КАК СуммаБезНДС,
		|	0 КАК СуммаРегл,
		|	0 КАК СуммаУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ПрочиеРасходы КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхРаспределенияОтклоненийВСтоимостиНоменклатураДоходыРасходы()
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ДокументДвижения,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры,
		|
		|	0 КАК ДопРасходы,
		|	0 КАК ДопРасходыБезНДС,
		|	0 КАК ДопРасходыРегл,
		|	0 КАК ДопРасходыУпр,
		|	0 КАК ПостояннаяРазница,
		|	0 КАК ВременнаяРазница
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДД
		|";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

// ... выборки данных

Функция ТекстКорректировкиТоваровВПутиПрошлыеПериоды()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС
	|ПОМЕСТИТЬ ВТОстаткиТоваровВПути
	|ИЗ
	|	ВТКэшРасчетныеОстаткиСебестоимостьТоваров КАК ДД
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.Количество <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.Период КАК Период,
	|	ДД.Организация КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.ДокументИсточник КАК ДокументИсточник,
	|	ДД.ТипЗаписи КАК ТипЗаписи,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.АналитикаРасходов,
	|	ДД.СтатьяРасходовСписания,
	|
	|	ДД.ДопРасходы КАК ДопРасходы,
	|	ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	ДД.ДопРасходыРегл КАК ДопРасходыРегл,
	|	ДД.ДопРасходыУпр КАК ДопРасходыУпр,
	|	ДД.НДСРегл КАК НДСРегл,
	|	ДД.НДСУпр КАК НДСУпр,
	|	ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	ДД.ВременнаяРазница КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТКорректировкиТоваровВПутиПрошлыеПериоды
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиТоваровВПути КАК Остатки
	|		ПО ДД.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
	|			И ДД.Организация = Остатки.Организация
	|			И ДД.Партия = Остатки.Партия
	|			И ДД.РазделУчета = Остатки.РазделУчета
	|			И ДД.ВидЗапасов = Остатки.ВидЗапасов
	|			И ДД.АналитикаУчетаПартий = Остатки.АналитикаУчетаПартий
	|			И ДД.АналитикаФинансовогоУчета = Остатки.АналитикаФинансовогоУчета
	|			И ДД.ВидДеятельностиНДС = Остатки.ВидДеятельностиНДС
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.СлужебноеВидДвиженияПриход
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.ТипЗаписи В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
	|	И ДД.Количество = 0
	|	И Остатки.Организация ЕСТЬ NULL
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Корректировки.Регистратор КАК Регистратор,
	|	ДД.Регистратор КАК ДокументПоступления,
	|	Корректировки.Период КАК Период,
	|	Корректировки.Организация КАК Организация,
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов КАК ВидЗапасов,
	|	ДД.КорРазделУчета КАК РазделУчета,
	|	ДД.КорПартия КАК Партия,
	|	ДД.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	Корректировки.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Корректировки.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	Корректировки.Подразделение КАК Подразделение,
	|	Корректировки.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	Корректировки.ДокументИсточник КАК ДокументИсточник,
	|	Корректировки.ТипЗаписи КАК ТипЗаписи,
	|	Корректировки.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Корректировки.ВидЗапасов КАК КорВидЗапасов,
	|	Корректировки.Партия КАК КорПартия,
	|	Корректировки.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Корректировки.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
	|	Корректировки.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
	|	Корректировки.РазделУчета КАК КорРазделУчета,
	|	Корректировки.АналитикаУчетаПоПартнерам,
	|	Корректировки.АналитикаРасходов,
	|	Корректировки.СтатьяРасходовСписания,
	|
	|	Корректировки.ДопРасходы КАК ДопРасходы,
	|	Корректировки.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|	Корректировки.ДопРасходыРегл КАК ДопРасходыРегл,
	|	Корректировки.ДопРасходыУпр КАК ДопРасходыУпр,
	|	Корректировки.НДСРегл КАК НДСРегл,
	|	Корректировки.НДСУпр КАК НДСУпр,
	|	Корректировки.ПостояннаяРазница КАК ПостояннаяРазница,
	|	Корректировки.ВременнаяРазница КАК ВременнаяРазница
	|ПОМЕСТИТЬ ВТПоступленияТоваровВПутиПрошлыеПериоды
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК Поступления
	|		ПО ДД.Регистратор = Поступления.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКорректировкиТоваровВПутиПрошлыеПериоды КАК Корректировки
	|		ПО ДД.АналитикаУчетаНоменклатуры = Корректировки.АналитикаУчетаНоменклатуры
	|			И ДД.РазделУчета = Корректировки.РазделУчета
	|			И ДД.ВидЗапасов = Корректировки.ВидЗапасов
	|			И ДД.Организация = Корректировки.Организация
	|			И ДД.Партия = Корректировки.Партия
	|			И ДД.АналитикаУчетаПартий = Корректировки.АналитикаУчетаПартий
	|			И ДД.АналитикаФинансовогоУчета = Корректировки.АналитикаФинансовогоУчета
	|			И ДД.ВидДеятельностиНДС = Корректировки.ВидДеятельностиНДС
	|ГДЕ
	|	&РаспределениеДопРасходовПоВыбывшимТоварам
	|	И ДД.Период < &НачалоПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|	И ДД.Количество <> 0
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Организация,
	|	Партия,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор
	|ПОМЕСТИТЬ ДокументыКорректировкиТоваровВПути
	|ИЗ
	|	ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ДД
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПриемникиПоТоварамПрошлыхПериодовОтклоненийВСтоимости()
	
	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	0 КАК КоличествоКРаспределению,
		|	0 КАК СтоимостьКРаспределению,
		|	0 КАК СтоимостьБезНДСКРаспределению,
		|	0 КАК СтоимостьРеглКРаспределению,
		|	0 КАК СтоимостьУпрКРаспределению,
		|
		|	0 КАК ДопРасходыСНДСКРаспределению,
		|	0 КАК ДопРасходыБезНДСКРаспределению,
		|	0 КАК ДопРасходыРеглНДСКРаспределению,
		|	0 КАК ДопРасходыУпрНДСКРаспределению,
		|	0 КАК НДСРеглКРаспределению,
		|	0 КАК НДСУпрКРаспределению,
		|	0 КАК ПостояннаяРазницаКРаспределению,
		|	0 КАК ВременнаяРазницаКРаспределению,
		|
		|	ДД.Период КАК ПериодПоступления
		|
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодов
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	МАКСИМУМ(Источник.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	Источник.НастройкаХозяйственнойОперации,
		|	0 КАК КоличествоКРаспределению,
		|	0 КАК СтоимостьКРаспределению,
		|	0 КАК СтоимостьБезНДСКРаспределению,
		|	0 КАК СтоимостьРеглКРаспределению,
		|	0 КАК СтоимостьУпрКРаспределению,
		|
		|	СУММА(Источник.ДопРасходы) КАК ДопРасходыСНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыБезНДС) КАК ДопРасходыБезНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыРегл) КАК ДопРасходыРеглНДСКРаспределению,
		|	СУММА(Источник.ДопРасходыУпр) КАК ДопРасходыУпрНДСКРаспределению,
		|	СУММА(Источник.НДСРегл) КАК НДСРеглКРаспределению,
		|	СУММА(Источник.НДСУпр) КАК НДСУпрКРаспределению,
		|	СУММА(Источник.ПостояннаяРазница) КАК ПостояннаяРазницаКРаспределению,
		|	СУММА(Источник.ВременнаяРазница) КАК ВременнаяРазницаКРаспределению,
		|
		// Условие соединения с реестром документов должно соответствовать условию в функции ШаблонТекстаПервичныеПриемникиПоДокументам_3
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(
		|		ВЫБОР
		|			КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL
		|				ТОГДА Источник.Период
		|			КОГДА Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|				ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ)) КАК ПериодПоступления
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ВЫБОР
		// Доп расходы, отраженные таможенной декларацией на импорт, всегда относятся к текущему периоду,
		// т.к. партии товаров доступны для подбора только после ввода таможенной декларации.
		// Исключение раздела "Собственные товары в пути (от поставщиков)", т.к. документ поступления товаров на склад
		// может быть введен до оформления таможенной декларации. 
		|			КОГДА ТИПЗНАЧЕНИЯ(Источник.Регистратор) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
		|			 И Источник.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|				ТОГДА NULL
		|			КОГДА Источник.Партия <> НЕОПРЕДЕЛЕНО ТОГДА Источник.Партия
		|			КОГДА Источник.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА Источник.ДокументИсточник
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ Реестр.ДополнительнаяЗапись
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И Источник.СлужебноеВидДвиженияПриход
		|	И Источник.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
		|	И Источник.ТипЗаписи В
		|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ОтклонениеВСтоимости),
		|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
		|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
		|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|	И (Источник.ДопРасходы <> 0
		|		ИЛИ Источник.ДопРасходыБезНДС <> 0
		|		ИЛИ Источник.ДопРасходыРегл <> 0
		|		ИЛИ Источник.ДопРасходыУпр <> 0
		// Сумма постоянной и временной разницы распределяются только если они образованы суммой доп расходов,
		// либо распределяется только сумму постоянной и временной разницы с нулевой суммой доп. расходов.
		// Если постоянная и временная разница образованы стоимостью регл их не нужно распределять, 
		// т.к. стоимость регл не распределяется этим этапом.
		|		ИЛИ Источник.ПостояннаяРазница <> 0
		|			И Источник.СтоимостьРегл = 0
		|		ИЛИ Источник.ВременнаяРазница <> 0
		|			И Источник.СтоимостьРегл = 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	Источник.НастройкаХозяйственнойОперации
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(
		|		ВЫБОР
		|			КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL
		|				ТОГДА Источник.Период
		|			КОГДА Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|				ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ)) < &НачалоПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры
		|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров()
	Возврат 
		"ВЫБРАТЬ
		|	""ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР КОГДА ДД.Организация = ДД.КорОрганизация
		|		ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорОрганизация
		|	КОНЕЦ КАК КорОрганизация,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|
		|	СУММА(ДД.ДопРасходы)        КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета) КАК РазделУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов) КАК ВидЗапасов,
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия) КАК Партия,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета) КАК АналитикаФинансовогоУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаРасходов,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходовСписания,
		|		ДД.КорНаправлениеДеятельности,
		|		ДД.ХозяйственнаяОперация,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаНоменклатуры, ДД.КорАналитикаУчетаНоменклатуры)
		|		КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидЗапасов, ДД.КорВидЗапасов)
		|		КОНЕЦ КАК КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаФинансовогоУчета, ДД.КорАналитикаФинансовогоУчета)
		|		КОНЕЦ КАК КорАналитикаФинансовогоУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА ДД.ВидДеятельностиНДСВыбытия
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидДеятельностиНДС, ДД.КорВидДеятельностиНДС)
		|		КОНЕЦ КАК КорВидДеятельностиНДС,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.РазделУчета, ДД.КорРазделУчета)
		|		КОНЕЦ КАК КорРазделУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.Партия, ДД.КорПартия)
		|		КОНЕЦ КАК КорПартия,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаПартий, ДД.КорАналитикаУчетаПартий)
		|		КОНЕЦ КАК КорАналитикаУчетаПартий,
		|
		|		ДД.ДопРасходыСНДС   КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|		0                   КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпр    КАК ДопРасходыУпр,
		|		0                   КАК НДСРегл,
		|		ДД.НДСУпр           КАК НДСУпр,
		|		0                   КАК ПостояннаяРазница,
		|		0                   КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ТоварыВПути
		|		ПО ДД.АналитикаУчетаНоменклатуры = ТоварыВПути.АналитикаУчетаНоменклатуры
		|			И ДД.Организация = ТоварыВПути.Организация
		|			И ДД.Партия = ТоварыВПути.Партия
		|			И ДД.Регистратор = ТоварыВПути.Регистратор
		|			И ДД.РазделУчета = ТоварыВПути.РазделУчета
		|			И ДД.ВидЗапасов = ТоварыВПути.ВидЗапасов
		|			И ДД.АналитикаУчетаПартий = ТоварыВПути.АналитикаУчетаПартий
		|			И ДД.АналитикаФинансовогоУчета = ТоварыВПути.АналитикаФинансовогоУчета
		|			И ДД.ВидДеятельностиНДС = ТоварыВПути.ВидДеятельностиНДС
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета) КАК РазделУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов) КАК ВидЗапасов,
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия) КАК Партия,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета) КАК АналитикаФинансовогоУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаРасходов,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходовСписания,
		|		ДД.КорНаправлениеДеятельности,
		|		ДД.ХозяйственнаяОперация,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаНоменклатуры, ДД.КорАналитикаУчетаНоменклатуры)
		|		КОНЕЦ КАК КорАналитикаУчетаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидЗапасов, ДД.КорВидЗапасов)
		|		КОНЕЦ КАК КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаФинансовогоУчета, ДД.КорАналитикаФинансовогоУчета)
		|		КОНЕЦ КАК КорАналитикаФинансовогоУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА ДД.ВидДеятельностиНДСВыбытия
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.ВидДеятельностиНДС, ДД.КорВидДеятельностиНДС)
		|		КОНЕЦ КАК КорВидДеятельностиНДС,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.РазделУчета, ДД.КорРазделУчета)
		|		КОНЕЦ КАК КорРазделУчета,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.Партия, ДД.КорПартия)
		|		КОНЕЦ КАК КорПартия,
		|		ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА НЕОПРЕДЕЛЕНО
		|			 ИНАЧЕ ЕСТЬNULL(ТоварыВПути.АналитикаУчетаПартий, ДД.КорАналитикаУчетаПартий)
		|		КОНЕЦ КАК КорАналитикаУчетаПартий,
		|
		|		0 КАК ДопРасходы,
		|		0 КАК ДопРасходыБезНДС,
		|		ДД.ДопРасходыРегл,
		|		0 КАК ДопРасходыУпр,
		|		ДД.НДСРегл,
		|		0 КАК НДСУпр,
		|		(ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА 0
		|			ИНАЧЕ ДД.ПостояннаяРазница КОНЕЦ) КАК ПостояннаяРазница,
		|		(ВЫБОР
		|			КОГДА ДД.ЭтоВыбытие ТОГДА 0
		|			ИНАЧЕ ДД.ВременнаяРазница КОНЕЦ) КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ТоварыВПути
		|		ПО ДД.АналитикаУчетаНоменклатуры = ТоварыВПути.АналитикаУчетаНоменклатуры
		|			И ДД.Организация = ТоварыВПути.Организация
		|			И ДД.Партия = ТоварыВПути.Партия
		|			И ДД.Регистратор = ТоварыВПути.Регистратор
		|			И ДД.РазделУчета = ТоварыВПути.РазделУчета
		|			И ДД.ВидЗапасов = ТоварыВПути.ВидЗапасов
		|			И ДД.АналитикаУчетаПартий = ТоварыВПути.АналитикаУчетаПартий
		|			И ДД.АналитикаФинансовогоУчета = ТоварыВПути.АналитикаФинансовогоУчета
		|			И ДД.ВидДеятельностиНДС = ТоварыВПути.ВидДеятельностиНДС
		|
		// Если для отклонений по партии прошлого периода нет базы распределения, то такие отклонения должны 
		// быть списаны на статью расходов "Выбытия товаров в прошлых периодах".
		// У таких отклонений поле "ПериодПоступления" должен быть раньше начала период.
		// Условия выборки данных должны быть одинаковые в текстах функциях ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров(),
		// ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы() и ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.РазделУчета,
		|		ДД.ВидЗапасов,
		|		ДД.Организация,
		|		ДД.Организация КАК КорОрганизация,
		|		ДД.Партия,
		|		ДД.АналитикаУчетаПартий,
		|		ДД.АналитикаФинансовогоУчета,
		|		ДД.ВидДеятельностиНДС,
		|
		|		НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|		(ВЫБОР
		|			КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
		|				ТОГДА Аналитика.Подразделение
		|			ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение КОНЕЦ) КАК Подразделение,
		|		Аналитика.Номенклатура КАК АналитикаРасходов,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах) КАК СтатьяРасходовСписания,
		|		ЕСТЬNULL(Аналитика.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК КорНаправлениеДеятельности,
		|		ДД.НастройкаХозяйственнойОперации.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|		НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|		НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|		НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|		НЕОПРЕДЕЛЕНО КАК КорПартия,
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|
		|		ДД.ДопРасходыСНДСКРаспределению КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДСКРаспределению КАК ДопРасходыБезНДС,
		|		ДД.ДопРасходыРеглНДСКРаспределению КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпрНДСКРаспределению КАК ДопРасходыУпр,
		|		ДД.НДСРеглКРаспределению КАК НДСРегл,
		|		ДД.НДСУпрКРаспределению КАК НДСУпр,
		|		ДД.ПостояннаяРазницаКРаспределению КАК ПостояннаяРазница,
		|		ДД.ВременнаяРазницаКРаспределению КАК ВременнаяРазница
		|	ИЗ
		|		ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|			ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|			ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПериода
		|			И Движения.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Движения.РазделУчета = ДД.РазделУчета
		|			И Движения.ВидЗапасов = ДД.ВидЗапасов
		|			И Движения.Организация = ДД.Организация
		|			И Движения.Партия = ДД.Партия
		|			И Движения.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Движения.Количество <> 0
		|			И Движения.Активность
		|	ГДЕ
		|		Движения.Организация ЕСТЬ NULL
		|		И ДД.ПериодПоступления < &НачалоПериода
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета) КАК РазделУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов) КАК ВидЗапасов,
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия) КАК Партия,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий) КАК АналитикаУчетаПартий,
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета) КАК АналитикаФинансовогоУчета,
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС) КАК ВидДеятельностиНДС,
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаРасходов,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ОтклонениеВСтоимостиТоваров) КАК СтатьяРасходовСписания,
		|		ДД.КорНаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтклонениеВСтоимостиТоваровРасходы) КАК ХозяйственнаяОперация,
		|		МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ОтклонениеВСтоимостиТоваровРасходы) КАК НастройкаХозяйственнойОперации,
		|
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|		НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|		НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|		НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|		НЕОПРЕДЕЛЕНО КАК КорПартия,
		|		НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|
		|		0 КАК ДопРасходы,
		|		0 КАК ДопРасходыБезНДС,
		|		0 КАК ДопРасходыРегл,
		|		0 КАК ДопРасходыУпр,
		|		0 КАК НДСРегл,
		|		0 КАК НДСУпр,
		|		СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|		СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступленияТоваровВПутиПрошлыеПериоды КАК ТоварыВПути
		|		ПО ДД.АналитикаУчетаНоменклатуры = ТоварыВПути.АналитикаУчетаНоменклатуры
		|			И ДД.Организация = ТоварыВПути.Организация
		|			И ДД.Партия = ТоварыВПути.Партия
		|			И ДД.Регистратор = ТоварыВПути.Регистратор
		|			И ДД.РазделУчета = ТоварыВПути.РазделУчета
		|			И ДД.ВидЗапасов = ТоварыВПути.ВидЗапасов
		|			И ДД.АналитикаУчетаПартий = ТоварыВПути.АналитикаУчетаПартий
		|			И ДД.АналитикаФинансовогоУчета = ТоварыВПути.АналитикаФинансовогоУчета
		|			И ДД.ВидДеятельностиНДС = ТоварыВПути.ВидДеятельностиНДС
		|	ГДЕ
		|		ДД.ЭтоВыбытие
		|
		|	СГРУППИРОВАТЬ ПО
		|		ДД.Регистратор,
		|		ДД.Период,
		|		ДД.ТипЗаписи,
		|
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаНоменклатуры, ДД.АналитикаУчетаНоменклатуры),
		|		ЕСТЬNULL(ТоварыВПути.КорРазделУчета, ДД.РазделУчета),
		|		ЕСТЬNULL(ТоварыВПути.КорВидЗапасов, ДД.ВидЗапасов),
		|		ДД.Организация,
		|		ДД.КорОрганизация,
		|		ЕСТЬNULL(ТоварыВПути.КорПартия, ДД.Партия),
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаУчетаПартий, ДД.АналитикаУчетаПартий),
		|		ЕСТЬNULL(ТоварыВПути.КорАналитикаФинансовогоУчета, ДД.АналитикаФинансовогоУчета),
		|		ЕСТЬNULL(ТоварыВПути.КорВидДеятельностиНДС, ДД.ВидДеятельностиНДС),
		|
		|		ДД.АналитикаУчетаПоПартнерам,
		|		ДД.Подразделение,
		|		ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|		ДД.КорНаправлениеДеятельности
		|
		|	) КАК ДД
		|ГДЕ
		|	НЕ (ДД.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = ДД.КорРазделУчета
		|		И ДД.ВидЗапасов = ДД.КорВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|		И ДД.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ВЫБОР КОГДА ДД.Организация = ДД.КорОрганизация
		|		ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ИНАЧЕ ДД.КорОрганизация
		|	КОНЕЦ,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.Подразделение,
		|	ДД.АналитикаРасходов,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорВидЗапасов,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорПартия,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.КорРазделУчета";
		
КонецФункции

Функция ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеПриходОтклоненийВСтоимостиСебестоимостьТоваров"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.КорРазделУчета КАК РазделУчета,
		|	ДД.КорВидЗапасов КАК ВидЗапасов,
		|	ДД.КорОрганизация КАК Организация,
		|	ДД.КорПартия КАК Партия,
		|	ДД.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.КорАналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписания,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|
		|	СУММА(ДД.ДопРасходыСНДС)    КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|ГДЕ
		|	НЕ ДД.ЭтоВыбытие
		|	И НЕ (ДД.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = ДД.КорРазделУчета
		|		И ДД.ВидЗапасов = ДД.КорВидЗапасов
		|		И ДД.АналитикаФинансовогоУчета = ДД.КорАналитикаФинансовогоУчета
		|		И ДД.ВидДеятельностиНДС = ДД.КорВидДеятельностиНДС)
		|	ИЛИ
		|		(НЕ ДД.ЭтоВыбытие
		|		И ДД.Регистратор В (ВЫБРАТЬ Отбор.Регистратор ИЗ ДокументыКорректировкиТоваровВПути КАК Отбор))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ТипЗаписи,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.КорРазделУчета,
		|	ДД.КорВидЗапасов,
		|	ДД.КорОрганизация,
		|	ДД.КорПартия,
		|	ДД.КорАналитикаУчетаПартий,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.КорАналитикаУчетаНоменклатуры,
		|	ДД.КорАналитикаФинансовогоУчета,
		|	ДД.КорВидДеятельностиНДС";
		
КонецФункции

Функция ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеОтклоненийВСтоимостиВыручкаИСебестоимостьПродаж"" КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.ТипЗапасов,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов,
		|
		|	СУММА(ДД.ДопРасходыСНДС)    КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС)  КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл)    КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр)     КАК ДопРасходыУпр,
		|	СУММА(ДД.НДСРегл)           КАК НДСРегл,
		|	СУММА(ДД.НДСУпр)            КАК НДСУпр,
		|	0                           КАК ПостояннаяРазница,
		|	0                           КАК ВременнаяРазница
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|ГДЕ
		|	НЕ ДД.АналитикаУчетаПоПартнерам = НЕОПРЕДЕЛЕНО
		|	И ДД.ЭтоВыбытие
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.АналитикаУчетаПоПартнерам,
		|	ДД.ЗаказКлиента,
		|	ДД.Подразделение,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Менеджер,
		|	ДД.Склад,
		|	ДД.Соглашение,
		|	ДД.Договор,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.ТипЗапасов,
		|	ДД.ИсточникГФУНоменклатуры,
		|	ДД.ИсточникГФУРасчетов
		|";
КонецФункции

Функция ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы()
	// Условия для заполнения ресурсов регистра аналогичны условиям в функции ТекстЗапросаТаблицаВтПрочиеРасходы() модуля менеджера регистра ПрочиеРасходы
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы"" КАК ЗапросИсточник,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	СУММА(ДД.Сумма)             КАК Сумма,
		|	СУММА(ДД.СуммаБезНДС)       КАК СуммаБезНДС,
		|	СУММА(ДД.СуммаРегл)         КАК СуммаРегл,
		|	СУММА(ДД.СуммаУпр)          КАК СуммаУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ДД.ДопРасходыСНДС КАК Сумма,
		|		(ВЫБОР
		|			КОГДА НЕ СтатьиРасходов.ВариантРаспределенияРасходовУпр В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
		|				ТОГДА ДД.ДопРасходыБезНДС
		|			ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
		|		0 КАК СуммаРегл,
		|		ДД.ДопРасходыУпр КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		ВЫБОР 
		|			КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|				И НЕ &ИспользуетсяУправлениеВНА_2_4
		|				ТОГДА 0
		|			ИНАЧЕ ДД.ДопРасходыРегл КОНЕЦ КАК СуммаРегл,
		|		0 КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ  
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеИсключениеНДСВСтоимости),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости),
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		0 КАК СуммаРегл,
		|		ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА ДД.НДСУпр
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА ДД.НДСУпр
		//-- Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|				ТОГДА -ДД.НДСУпр
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА -ДД.НДСУпр
		//-- Локализация
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|			ПО ДанныеПервичныхДокументов.Организация = ДД.Организация
		|			И ДанныеПервичныхДокументов.Документ = ДД.Регистратор
		|	ГДЕ
		|		ДД.ВидДеятельностиНДС <> ДД.ВидДеятельностиНДСВыбытия
		|		И ДД.НДСУпр <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеИсключениеНДСВСтоимости),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости),
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА ДД.НДСРегл
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА ДД.НДСРегл
		//-- Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|				ТОГДА -ДД.НДСРегл
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА -ДД.НДСРегл
		//-- Локализация
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаРегл,
		|		0 КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|			ПО ДанныеПервичныхДокументов.Организация = ДД.Организация
		|			И ДанныеПервичныхДокументов.Документ = ДД.Регистратор
		|	ГДЕ
		|		ДД.ВидДеятельностиНДС <> ДД.ВидДеятельностиНДСВыбытия
		|		И ДД.НДСРегл <> 0
		|
		// Если для отклонений по партии прошлого периода нет базы распределения, то такие отклонения должны 
		// быть списаны на статью расходов "Выбытия товаров в прошлых периодах".
		// У таких отклонений поле "ПериодПоступления" должен быть раньше начала период.
		// Условия выборки данных должны быть одинаковые в текстах функциях ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров(),
		// ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы() и ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		(ВЫБОР
		|			КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
		|				ТОГДА Аналитика.Подразделение
		|			ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение КОНЕЦ) КАК Подразделение,
		|		ЕСТЬNULL(Аналитика.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах) КАК СтатьяРасходов,
		|		Аналитика.Номенклатура КАК АналитикаРасходов,
		|
		|		ДД.НастройкаХозяйственнойОперации.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ДД.НастройкаХозяйственнойОперации,
		|
		|		ДД.ДопРасходыСНДСКРаспределению КАК Сумма,
		|		(ВЫБОР
		|			КОГДА НЕ СтатьиРасходов.ВариантРаспределенияРасходовУпр В (
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
		|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
		|				ТОГДА ДД.ДопРасходыБезНДСКРаспределению
		|			ИНАЧЕ 0 КОНЕЦ) КАК СуммаБезНДС,
		|		(ВЫБОР 
		|			КОГДА НЕ &ИспользоватьУчетПрочихДоходовРасходовРегл
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
		|				ТОГДА 0
		|			КОГДА СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
		|				И НЕ &ИспользуетсяУправлениеВНА_2_4
		|				ТОГДА 0
		|			ИНАЧЕ ДД.ДопРасходыРеглНДСКРаспределению КОНЕЦ) КАК СуммаРегл,
		|		ДД.ДопРасходыУпрНДСКРаспределению КАК СуммаУпр,
		|		ДД.ПостояннаяРазницаКРаспределению КАК ПостояннаяРазница,
		|		ДД.ВременнаяРазницаКРаспределению КАК ВременнаяРазница
		|	ИЗ
		|		ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО СтатьиРасходов.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|			ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|			ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПериода
		|			И Движения.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Движения.РазделУчета = ДД.РазделУчета
		|			И Движения.ВидЗапасов = ДД.ВидЗапасов
		|			И Движения.Организация = ДД.Организация
		|			И Движения.Партия = ДД.Партия
		|			И Движения.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Движения.Количество <> 0
		|			И Движения.Активность
		|	ГДЕ
		|		Движения.Организация ЕСТЬ NULL
		|		И ДД.ПериодПоступления < &НачалоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ  
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеИсключениеНДСВСтоимости),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости),
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		0 КАК СуммаРегл,
		|		ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА ДД.НДСУпр
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА ДД.НДСУпр
		//-- Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|				ТОГДА -ДД.НДСУпр
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА -ДД.НДСУпр
		//-- Локализация
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|			ПО ДанныеПервичныхДокументов.Организация = ДД.Организация
		|			И ДанныеПервичныхДокументов.Документ = ДД.Регистратор
		|	ГДЕ
		|		ДД.ВидДеятельностиНДС <> ДД.ВидДеятельностиНДСВыбытия
		|		И ДД.НДСУпр <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ДД.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|		ДД.АналитикаРасходов,
		|
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВключениеИсключениеНДСВСтоимости),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		ДД.ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости),
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		ВЫБОР
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|				ТОГДА ДД.НДСРегл
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) < &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА ДД.НДСРегл
		//-- Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
		|				ТОГДА -ДД.НДСРегл
		//++ Локализация
		|			КОГДА ДД.ВидДеятельностиНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
		|		 	 И ДД.ВидДеятельностиНДСВыбытия = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт)
		|		 	 И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаВозможностиВычетаПриОказанииУслугНеВРФ
		|				ТОГДА -ДД.НДСРегл
		//-- Локализация
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК СуммаРегл,
		|		0 КАК СуммаУпр,
		|		0 КАК ПостояннаяРазница,
		|		0 КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|			ПО ДанныеПервичныхДокументов.Организация = ДД.Организация
		|			И ДанныеПервичныхДокументов.Документ = ДД.Регистратор
		|	ГДЕ
		|		ДД.ВидДеятельностиНДС <> ДД.ВидДеятельностиНДСВыбытия
		|		И ДД.НДСРегл <> 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Период,
		|		ДД.Регистратор,
		|
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ОтклонениеВСтоимостиТоваров) КАК СтатьяРасходов,
		|		ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаРасходов,
		|
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтклонениеВСтоимостиТоваровРасходы) КАК ХозяйственнаяОперация,
		|		НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
		|		МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|		ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ОтклонениеВСтоимостиТоваровРасходы) КАК НастройкаХозяйственнойОперации,
		|
		|		0 КАК Сумма,
		|		0 КАК СуммаБезНДС,
		|		0 КАК СуммаРегл,
		|		0 КАК СуммаУпр,
		|		СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|		СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|	ГДЕ
		|		ДД.ПостояннаяРазница <> 0 ИЛИ ДД.ВременнаяРазница <> 0
		|
		|	СГРУППИРОВАТЬ ПО
		|		ДД.Период,
		|		ДД.Регистратор,
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ДД.КорНаправлениеДеятельности,
		|		ДД.АналитикаУчетаНоменклатуры.Номенклатура) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ДД.АналитикаУчетаНоменклатуры";
		
КонецФункции

Функция ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()
	Возврат "
		|ВЫБРАТЬ
		|	""ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы"" КАК ЗапросИсточник,
		|
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.Регистратор КАК ДокументДвижения,
		|
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры,
		|
		|	СУММА(ДД.ДопРасходы) КАК ДопРасходы,
		|	СУММА(ДД.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
		|	СУММА(ДД.ДопРасходыРегл) КАК ДопРасходыРегл,
		|	СУММА(ДД.ДопРасходыУпр) КАК ДопРасходыУпр,
		|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
		|	СУММА(ДД.ВременнаяРазница)  КАК ВременнаяРазница
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
		|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиНоменклатуры,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		СпрАналитикаНоменклатуры.МестоХранения КАК Склад,
		|		ДД.ТипЗапасов,
		|		ДД.ВидЗапасов,
		|		ДД.СтатьяРасходовСписанияУпр КАК СтатьяДоходовРасходов,
		|		ДД.АналитикаРасходов,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи, 
		|		ДД.ИсточникГФУНоменклатуры,
		|
		|		ДД.ДопРасходыСНДС   КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
		|		0                   КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпр    КАК ДопРасходыУпр,
		|		0                   КАК ПостояннаяРазница,
		|		0                   КАК ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияУпр = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|
		|		ДД.ХозяйственнаяОперация,
		|		ДД.Организация,
		|		ДД.Подразделение,
		|		ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности,
		|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)),
		|		ДД.АналитикаУчетаНоменклатуры,
		|		СпрАналитикаНоменклатуры.МестоХранения,
		|		ДД.ТипЗапасов,
		|		ДД.ВидЗапасов,
		|		ДД.СтатьяРасходовСписанияУпр,
		|		ДД.АналитикаРасходов,
		|		ДД.КорНаправлениеДеятельности КАК НаправлениеДеятельностиСтатьи,
		|		ДД.ИсточникГФУНоменклатуры,
		|
		|		0,
		|		0,
		|		ДД.ДопРасходыРегл,
		|		0,
		|		ДД.ПостояннаяРазница,
		|		ДД.ВременнаяРазница
		|	ИЗ
		|		ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО ДД.СтатьяРасходовСписанияРегл = СтатьиРасходов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрАналитикаНоменклатуры
		|			ПО ДД.АналитикаУчетаНоменклатуры = СпрАналитикаНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
		|			ПО СпрАналитикаНоменклатуры.Назначение = СпрНазначения.Ссылка
		|
		// Если для отклонений по партии прошлого периода нет базы распределения, то такие отклонения должны 
		// быть списаны на статью расходов "Выбытия товаров в прошлых периодах".
		// У таких отклонений поле "ПериодПоступления" должен быть раньше начала период.
		// Условия выборки данных должны быть одинаковые в текстах функциях ТекстДвижениеРасходОтклоненийВСтоимостиСебестоимостьТоваров(),
		// ТекстДвижениеПриходОтклоненийВСтоимостиПрочиеРасходы() и ТекстДвижениеОтклоненийВСтоимостиНоменклатураДоходыРасходы()
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		ДД.Период,
		|
		|		ДД.НастройкаХозяйственнойОперации.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ДД.Организация,
		|		(ВЫБОР
		|			КОГДА Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
		|				ТОГДА Аналитика.Подразделение
		|			ИНАЧЕ Аналитика.СкладскаяТерритория.Подразделение КОНЕЦ) КАК Подразделение,
		|		ЕСТЬNULL(Аналитика.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельностиНоменклатуры,
		|		ДД.АналитикаУчетаНоменклатуры,
		|		Аналитика.МестоХранения КАК Склад,
		|		ДД.ВидЗапасов.ТипЗапасов КАК ТипЗапасов,
		|		ДД.ВидЗапасов,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах) КАК СтатьяДоходовРасходов,
		|		Аналитика.Номенклатура КАК АналитикаРасходов,
		|		ЕСТЬNULL(Аналитика.Назначение.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельностиСтатьи,
		|		НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|
		|		ДД.ДопРасходыСНДСКРаспределению КАК ДопРасходы,
		|		ДД.ДопРасходыБезНДСКРаспределению КАК ДопРасходыБезНДС,
		|		ДД.ДопРасходыРеглНДСКРаспределению КАК ДопРасходыРегл,
		|		ДД.ДопРасходыУпрНДСКРаспределению КАК ДопРасходыУпр,
		|		ДД.ПостояннаяРазницаКРаспределению КАК ПостояннаяРазница,
		|		ДД.ВременнаяРазницаКРаспределению КАК ВременнаяРазница
		|	ИЗ
		|		ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|			ПО СтатьиРасходов.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|			ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|			ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПериода
		|			И Движения.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Движения.РазделУчета = ДД.РазделУчета
		|			И Движения.ВидЗапасов = ДД.ВидЗапасов
		|			И Движения.Организация = ДД.Организация
		|			И Движения.Партия = ДД.Партия
		|			И Движения.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			И Движения.Количество <> 0
		|			И Движения.Активность
		|	ГДЕ
		|		Движения.Организация ЕСТЬ NULL
		|		И ДД.ПериодПоступления < &НачалоПериода
		|
		|	) КАК ДД
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.Период,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельностиНоменклатуры,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.Склад,
		|	ДД.ТипЗапасов,
		|	ДД.ВидЗапасов,
		|	ДД.СтатьяДоходовРасходов,
		|	ДД.АналитикаРасходов,
		|	ДД.НаправлениеДеятельностиСтатьи,
		|	ДД.ИсточникГФУНоменклатуры";
		
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапа10_РаспределениеДопРасходовМеждуПартиямиИТоварами

#Область Описание_РаспределениеДопРасходовМеждуПартиямиИТоварами

// Этап распределения дополнительных расходов между партиями товаров выполняет подготовку базы распределения и формирует
// временную таблицы ДолиДополнительныхРасходов.
// Выходные данные этапа формируются в функции ТекстДолиДополнительныхРасходов() в зависимости от признака ЭтоПартияПрошлогоПериода.
// Признак ЭтоПартияПрошлогоПериода определяется в функциях выборки исходных данных:
// 	- ШаблонТекстаПервичныеПриемники...
// Для партии текущего периода база распределения хранится во временной таблице ПриемникиПоТоварам.
// Для партии прошлого периода база распределения хранится во временной таблице ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов.
//
// Для распределения расходов формируются вспомогательные временные таблицы:
// - АналитикиЗаказов - таблица аналитик для отбора движений себестоимости товаров, т.к. в движениях себестоимости товаров
//	нет информации о заказах.
//	Таблица формируется несколькими запросами:
//	1) Приобретения товаров по заказу поставщику, кроме приобретений товаров по которым оформлены поступления на склад.
//		Используется данные движений "Расход" по регистру ЗаказыПоставщикам.
//		Наличие оформленных поступлений товаров на склад определяется по движениям "Расход" по регистру ТоварыКПоступлению
//		с заполненным количеством в ресурсе КОформлениюПоступленийПоРаспоряжению.
//		Если включена константа РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков, то проверка наличия поступлений товаров на склад
//		не выполняется. В этом случае аналитики распределения должны определяться только по приобретениям товаров в запросе 3.
//	2) Приобретения товаров по всем заказам поставщикам текущего периода, если в аналитике расходов не указан заказ поставщику.
//		Выборка двжений выполняется аналогично запросу 1.
//	3) Поступления по товарам в пути от поставщиков.
//		Используются данные движений "Расход" по регистру ТоварыКПоступлению с заполненным количеством 
//		в ресурсе КОформлениюПоступленийПоРаспоряжению и отбором по хозяйственным операциям закупки по товарам в пути.
//		Данные выбираются только если выключена константа РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков.
//		При включенной константе РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков данные выбираются в запросах 1 и 2. 
//	4) Поступления товаров по неотфактурованным поставкам.
//		Используются данные движений "Расход" по регистру ТоварыКПоступлению с заполненным количеством 
//		в ресурсе КОформлениюПоступленийПоРаспоряжению и отбором по хозяйственным операциям фактуровки поставки.
//	5) Перемещения заказов по заказу на перемещения
//		Используются данные движений "Расход" по регистру ЗаказыНаПеремещение.
//	6) Перемещения товаров текущего периода, если в аналитике расходов не указан заказ на перемещение.
//		Используются данные движений "Расход" по регистру ЗаказыНаПеремещение.
//	7) Сборки/разборки товаров по заказам на сборку
//		Используются данные движений "Расход" по регистру ЗаказыНаСборку по типу сборки "Поступление".
//	8) Сборки/разборки товаров текущего периода, если в аналитике расходов не указан заказа на сборку
//		Используются данные движений "Расход" по регистру ЗаказыНаСборку по типу сборки "Поступление"
//	
// Исходные данные для базы распределения выбираются в разных функциях в зависимости от типа значения аналитики расходов.
// 1) Аналитика расходов "Заказ поставщику", "Заказ на перемещение", "Заказ на сборку"
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПоЗаказам()
//	Отбор данных выполняется по данным временной таблицы АналитикиЗаказов
//	Партия прошлого периода определяется наличием движений по себестоимости товаров по указанному заказу в прошлом периоде. 
//
// 2) Аналитика расходов "Таможенная декларация на испорт"
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПоДекларациям()
//
// 3) Аналитика расходов "Приобретение товаров и услуг" и другие документы, кроме таможенной декларации на импорт и заказов
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПоДокументам()
//	Предварительно движения из регистра "Себестоимость товаров" выбираются во временную таблицу ВТДвиженияСебестоимостиПоДокументам
//	К партиям текущего периода относятся поступления документами, которые являются либо партиями, либо отражают перемещения
//	товаров между аналитиками. У таких движений могут быть типы записей: Партия, Перемещение или ПеремещениеОбособлено 
//
// 4) Аналитика расходов"Склад", "Номенклатура" и другие справочники, кроме справочника "Прочие расходы"
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПоСправочникам()
//
// 5) Аналитика расходов справочник "Прочие расходы". Данная аналитика включается только на конкретных внедрениях и применятся
//	для задания произвольной базы распределения через отборы СКД
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПрочиеРасходы()
//
// 6) Аналитика расходов "Договор контрагента" и товары находятся у переработчика.
//	Выборка описана в функции ШаблонТекстаПервичныеПриемникиПоПереработке()
//
// База распределения на выбытия товаров в прошлых периодах и на остатки партий формируется запросами, описанными в 
// функции ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов()
// Аналитики товаров, на которые могут быть распределены доп расаходы формируются во временной таблице 
// ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов. 
// Если в таблице ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов нет данных для партии прошлого периода, то доп расходы
// по такой партии не будут распределены.
//  

#КонецОбласти

Функция ТаблицаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов());
	
КонецФункции

Функция ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(80)) КАК ЗапросИсточник,
		|	СТ.Регистратор КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	СТ.РазделУчета КАК КорРазделУчета,
		|	СТ.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	СТ.ВидЗапасов КАК КорВидЗапасов,
		|	СТ.Организация КАК КорОрганизация,
		|	СТ.Партия КАК КорПартия,
		|	СТ.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	СТ.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	СТ.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	СТ.ВидДеятельностиНДС КАК ВидДеятельностиНДСВыбытия,
		|	СТ.ХозяйственнаяОперация,
		|	СТ.ТипЗаписи,
		// Приемник Прочие расходы/Прочие активы
		|	ПР.СтатьяРасходов КАК КорСтатьяРасходов,
		|	ПР.АналитикаРасходов КАК КорАналитикаРасходов,
		|	ПАП.Статья КАК КорСтатьяАктивовПассивов,
		|	ПАП.Аналитика КАК КорАналитикаАктивовПассивов,
		|	ПР.Подразделение КАК КорПодразделение,
		|	ПР.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	ВСП.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	ВСП.ЗаказКлиента КАК ЗаказКлиента,
		|	ВСП.Менеджер КАК Менеджер,
		|	ВСП.Склад КАК Склад,
		|	ВСП.Соглашение КАК Соглашение,
		|	ВСП.Договор КАК Договор,
		|	ВСП.ТипЗапасов КАК ТипЗапасов,
		|	ВСП.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
		|	ВСП.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	СТ.Количество КАК Количество,
		|	0 КАК ДоляСтоимости,
		|	0 КАК ДоляСтоимостиБезНДС,
		|	0 КАК ДоляСтоимостиРегл,
		|	0 КАК ДоляСтоимостиУпр
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК СТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК ПР
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ПАП
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВСП
		|		ПО ИСТИНА";
		
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;
	
КонецФункции

// Выборка данных и формирование движений

Процедура ПолучитьДанныеДляДополнительныхРасходов(ПараметрыРасчета) Экспорт
	
	ДляРасшифровки = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	
	ДопПараметры = ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа;
	ДопПараметры.Вставить("РасчетСебестоимостиВыполнен",  ПараметрыРасчета.Свойство("РасчетСебестоимостиВыполнен"));
	ДопПараметры.Вставить("РасшифровкаРаспределения", 	  ДляРасшифровки);
	
	ПодготовитьДополнительныеРасходыКРаспределению(ПараметрыРасчета);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета),
		,
		НЕ ДляРасшифровки);
	
КонецПроцедуры

Процедура ПодготовитьДополнительныеРасходыКРаспределению(ПараметрыРасчета)
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.УстановитьПараметр("ВариантыРаспределенияРасходов", 
		ОбщегоНазначенияУТКлиентСервер.Массив(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров));
	Запрос.УстановитьПараметр("Регистратор",
		?(ПараметрыРасчета.Свойство("Регистратор"), ПараметрыРасчета.Регистратор, Неопределено));
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаПоступилоПрочихРасходов(, Ложь);
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, 
		,,,НСтр("ru = 'Получение дополнительных расходов для распределения.'"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДД.Ссылка,
		|	ДД.Организация,
		|	ДД.Подразделение,
		|	ДД.НаправлениеДеятельности,
		|	ДД.СтатьяРасходов,
		|	ДД.АналитикаРасходов КАК АналитикаРасходов,
		|	ДД.НазначениеНастройкиРаспределения,
		|	ДД.НаправлениеРаспределения,
		|	ДД.БазаРаспределенияПоПартиям,
		|	ДД.НастройкиБазыРаспределенияПоПартиям,
		|	ДД.УправленческийУчет,
		|	ДД.РегламентированныйУчет,
		|	ДД.НалоговыйУчет
		|ПОМЕСТИТЬ Регистраторы
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыКРаспределению КАК Т
		|		ПО (Т.Организация = ДД.Организация)
		|			И (Т.Подразделение = ДД.Подразделение)
		|			И (Т.СтатьяРасходов = ДД.СтатьяРасходов)
		|			И (Т.АналитикаРасходов = ДД.АналитикаРасходов)
		|			И (Т.НаправлениеДеятельности = ДД.НаправлениеДеятельности)
		|ГДЕ
		|	ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаСебестоимостьТоваров)
		|	И ДД.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.Проведен
		|	И (ДД.Ссылка = &Регистратор
		|			ИЛИ &Регистратор = НЕОПРЕДЕЛЕНО)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаРасходов";
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,
		,,,НСтр("ru = 'Инициализация служебных таблиц для распределения затрат.'"));
	
КонецПроцедуры

// Тексты запросов

// ... для таблицы РасчетныеПартииПоЗаказам в ПолучитьДанныеДляДопРасходов()

Функция ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета)
	
	ТекстыПодготовкиДанных = Новый Массив;
	ТекстыПодготовкиДанных.Добавить(ТекстАналитикиЗаказов());
	ТекстыПодготовкиДанных.Добавить(ТекстПриобретенияПоТаможеннымДекларациям());
	ТекстыПодготовкиДанных.Добавить(ТекстПервичныеПриемникиДополнительныхРасходов(ПараметрыРасчета));
	ТекстыПодготовкиДанных.Добавить(КорректировкаПриемниковПоРегистраторам());
	ТекстыПодготовкиДанных.Добавить(ТекстПриемникиПоТоварамПрошлыхПериодовДополнительныхРасходов());
	ТекстыПодготовкиДанных.Добавить(ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов());
	
	ТекстыВыборкиДанных = Новый Массив;
	ТекстыВыборкиДанных.Добавить(ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов());
	ТекстыВыборкиДанных.Добавить(РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(
		ТекстДолиДополнительныхРасходов(), "СН"));
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыПодготовкиДанных, ОбщегоНазначенияУТ.РазделительЗапросовВПакете()));
	ТекстыЗапросов.Добавить(ОбъединитьТексты(ТекстыВыборкиДанных));
	
	Возврат ОбъединитьТексты(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

Функция ТекстАналитикиЗаказов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.РегистраторСебестоимости,
		|	ДД.АналитикаРасходов,
		|	ДД.Организация,
		|	ДД.Номенклатура,
		|	ДД.Характеристика,
		|	(ВЫБОР
		|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям ТОГДА ДД.Назначение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КОНЕЦ) КАК Назначение,
		|	ДД.Склад
		|ПОМЕСТИТЬ АналитикиЗаказов
		|ИЗ (
		// 1. Приобретения товаров по заказу поставщику, кроме приобретений товаров по которым оформлены поступления на склад.
		|	ВЫБРАТЬ
		|		ДД.Регистратор КАК РегистраторСебестоимости,
		|		Регистраторы.АналитикаРасходов КАК АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				ТОГДА Заказ.Договор
		|			ИНАЧЕ ДД.Склад КОНЕЦ) КАК Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказПоставщику
		|		
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказПоставщику
		|			
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
		|			ПО ТоварыДокумента.Ссылка = ДД.ЗаказПоставщику
		|				И ТоварыДокумента.КодСтроки = ДД.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности = 
		|					ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ДвиженияКПоступлению
		|			ПО ДвиженияКПоступлению.ДокументПоступления = Заказ.Ссылка
		|				И ДвиженияКПоступлению.Период <= &КонецПериода
		|				И ДвиженияКПоступлению.Активность
		|				И ДвиженияКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И ДвиженияКПоступлению.КОформлениюПоступленийПоРаспоряжению <> 0
		|				И ДвиженияКПоступлению.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДвиженияКПоступлению.Регистратор ЕСТЬ NULL
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// 2. Приобретения товаров по всем заказам поставщикам текущего периода, если в аналитике расходов не указан заказ поставщику.
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация В (
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				ТОГДА Заказ.Договор
		|			ИНАЧЕ ДД.Склад КОНЕЦ)
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказПоставщику
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказПоставщику = ТоварыДокумента.Ссылка
		|			И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|				ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ДвиженияКПоступлению
		|			ПО ДвиженияКПоступлению.ДокументПоступления = Заказ.Ссылка
		|			И ДвиженияКПоступлению.Период <= &КонецПериода
		|			И ДвиженияКПоступлению.Активность
		|			И ДвиженияКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			И ДвиженияКПоступлению.КОформлениюПоступленийПоРаспоряжению <> 0
		|			И ДвиженияКПоступлению.ХозяйственнаяОперация В (
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|				И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДвиженияКПоступлению.Регистратор ЕСТЬ NULL
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// 3. Поступления по товарам в пути от поставщиков.
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ДД.Назначение,
		|		ДД.Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ДокументПоступления
		|			И Регистраторы.НаправлениеДеятельности =
		|				ЕСТЬNULL(ДД.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ДокументПоступления
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.КОформлениюПоступленийПоРаспоряжению <> 0
		|		И Заказ.ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути))
		|		И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|
		// 4. Поступления товаров по неотфактурованным поставкам.
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ДД.Назначение,
		|		ДД.Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ДокументПоступления
		|			И Регистраторы.НаправлениеДеятельности =
		|				ЕСТЬNULL(ДД.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ДокументПоступления
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.КОформлениюПоступленийПоРаспоряжению <> 0
		|		И Заказ.ХозяйственнаяОперация В (
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
		|
		// 5. Перемещения товаров по заказам на перемещение
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		Заказ.СкладПолучатель
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказНаПеремещение
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаПеремещение
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказНаПеремещение = ТоварыДокумента.Ссылка
		|				И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности =
		|						ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|							ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// 6. Перемещения товаров текущего периода, если в аналитике расходов не указан заказ на перемещение.
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		ТоварыДокумента.Назначение,
		|		Заказ.СкладПолучатель
		|	ИЗ
		|		РегистрНакопления.ЗаказыНаПеремещение КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаПеремещение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыДокумента
		|			ПО ДД.ЗаказНаПеремещение = ТоварыДокумента.Ссылка
		|			И ДД.КодСтроки = ТоварыДокумента.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|				ЕСТЬNULL(ТоварыДокумента.Назначение.НаправлениеДеятельности,
		|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// 7. Сборки/разборки товаров по заказам на сборку
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|				ТОГДА Заказ.Назначение
		|			ИНАЧЕ ЗаказТовары.Назначение КОНЕЦ) КАК Назначение,
		|		Заказ.Склад КАК Склад
		|	ИЗ
		|		Регистраторы КАК Регистраторы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаСборку КАК ДД
		|			ПО Регистраторы.АналитикаРасходов = ДД.ЗаказНаСборку
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаСборку
		|
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку.Товары КАК ЗаказТовары
		|			ПО ЗаказТовары.Ссылка = ДД.ЗаказНаСборку
		|				И ЗаказТовары.КодСтроки = ДД.КодСтроки
		|				И Регистраторы.НаправлениеДеятельности =
		|					(ВЫБОР
		|						КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|							ТОГДА ЕСТЬNULL(Заказ.Назначение.НаправлениеДеятельности,
		|									ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|						ИНАЧЕ
		|							ЕСТЬNULL(ЗаказТовары.Назначение.НаправлениеДеятельности,
		|								ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|					КОНЕЦ)
		|	ГДЕ
		|		ДД.Период <= &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.ТипСборки = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		// 8. Сборки/разборки товаров, если в аналитике расходов не указан заказа на сборку
		|	ВЫБРАТЬ
		|		ДД.Регистратор,
		|		Регистраторы.АналитикаРасходов,
		|		Регистраторы.Организация,
		|		ДД.Номенклатура,
		|		ДД.Характеристика,
		|		(ВЫБОР
		|			КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|				ТОГДА Заказ.Назначение
		|			ИНАЧЕ ЗаказТовары.Назначение КОНЕЦ),
		|		Заказ.Склад
		|	ИЗ
		|		РегистрНакопления.ЗаказыНаСборку КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК Заказ
		|			ПО Заказ.Ссылка = ДД.ЗаказНаСборку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку.Товары КАК ЗаказТовары
		|			ПО ЗаказТовары.Ссылка = ДД.ЗаказНаСборку
		|			И ЗаказТовары.КодСтроки = ДД.КодСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|			ПО Регистраторы.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказНаСборку.ПустаяСсылка)
		|			И Регистраторы.Организация = Заказ.Организация
		|			И Регистраторы.НаправлениеДеятельности = 
		|			(ВЫБОР
		|				КОГДА Заказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
		|					ТОГДА ЕСТЬNULL(Заказ.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				ИНАЧЕ
		|					ЕСТЬNULL(ЗаказТовары.Назначение.НаправлениеДеятельности,
		|						ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|				КОНЕЦ)
		|	ГДЕ
		|		ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ДД.Активность
		|		И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И ДД.ТипСборки = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияЗапасов.Поступление)
		|) КАК ДД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаРасходов";
		
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ТекстПриобретенияПоТаможеннымДекларациям()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыОрганизаций.Организация КАК Организация,
		|	ТоварыОрганизаций.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыОрганизаций.Регистратор КАК Регистратор,
		|	СУММА(ТоварыОрганизаций.Количество) КАК Количество
		|ПОМЕСТИТЬ ТоварыОрганизацийПоДекларациям
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт КАК Отбор
		|		ПО ТоварыОрганизаций.Регистратор = Отбор.Ссылка
		|ГДЕ
		|	ТоварыОрганизаций.Период <= &КонецПериода
		|	И ТоварыОрганизаций.Активность
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры,
		|	ТоварыОрганизаций.Организация,
		|	ТоварыОрганизаций.ВидЗапасов,
		|	ТоварыОрганизаций.Регистратор
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	ВидЗапасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Регистратор
		|ПОМЕСТИТЬ ВТОтборРегистраторыДеклараций
		|ИЗ
		|	ТоварыОрганизацийПоДекларациям КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	Т.ДокументИсточник,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДопРасходы
		|ПОМЕСТИТЬ ВТДвиженияСебестоимостиПоДекларациям
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборРегистраторыДеклараций КАК Отбор
		|		ПО Т.Регистратор = Отбор.Регистратор
		|ГДЕ
		|	Т.Период < &НачалоПериода
		|	И Т.Активность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	Т.ДокументИсточник,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	Т.ДопРасходы
		|ИЗ
		|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборРегистраторыДеклараций КАК Отбор
		|		ПО Т.Регистратор = Отбор.Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	ВидЗапасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Организация КАК Организация,
		|	СУММА(Т.ДопРасходы) КАК ДопРасходы,
		|	МАКСИМУМ(ЕСТЬNULL(ТоварыОрганизацийПоДекларациям.Количество, 0)) КАК Количество
		|ПОМЕСТИТЬ ВТДвиженияСебестоимостиПоДекларациямСвернутые
		|ИЗ
		|	ВТДвиженияСебестоимостиПоДекларациям КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОрганизацийПоДекларациям КАК ТоварыОрганизацийПоДекларациям
		|	ПО Т.АналитикаУчетаНоменклатуры = ТоварыОрганизацийПоДекларациям.АналитикаУчетаНоменклатуры
		|		И Т.Организация = ТоварыОрганизацийПоДекларациям.Организация
		|		И Т.ВидЗапасов = ТоварыОрганизацийПоДекларациям.ВидЗапасов
		|		И Т.Регистратор = ТоварыОрганизацийПоДекларациям.Регистратор
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	ВидЗапасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	Т.ДокументИсточник,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Организация КАК Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА ДвиженияСвернутые.ДопРасходы = 0
		|		ТОГДА 0
		|		ИНАЧЕ ДвиженияСвернутые.Количество * Т.ДопРасходы / ДвиженияСвернутые.ДопРасходы
		|	КОНЕЦ КАК ЧИСЛО (15,3)) КАК Количество
		|ПОМЕСТИТЬ ВТДвиженияСебестоимостиПоДекларациямСКоличестом
		|ИЗ
		|	ВТДвиженияСебестоимостиПоДекларациям КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостиПоДекларациямСвернутые КАК ДвиженияСвернутые
		|	ПО Т.АналитикаУчетаНоменклатуры = ДвиженияСвернутые.АналитикаУчетаНоменклатуры
		|		И Т.Организация = ДвиженияСвернутые.Организация
		|		И Т.ВидЗапасов = ДвиженияСвернутые.ВидЗапасов
		|		И Т.Регистратор = ДвиженияСвернутые.Регистратор
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыПоДекларациям.Декларация КАК Декларация,
		|	ТоварыПоДекларациям.РегистраторСебестоимости КАК РегистраторСебестоимости,
		|	ТоварыПоДекларациям.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыПоДекларациям.РазделУчета КАК РазделУчета,
		|	ТоварыПоДекларациям.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыПоДекларациям.Организация КАК Организация,
		|	ТоварыПоДекларациям.Партия КАК Партия,
		|	ТоварыПоДекларациям.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ТоварыПоДекларациям.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ТоварыПоДекларациям.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	ТоварыПоДекларациям.Количество КАК Количество
		|ПОМЕСТИТЬ ПриобретенияПоДекларациям
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДД.АналитикаРасходов КАК Декларация,
		|		Себестоимость.ДокументИсточник КАК РегистраторСебестоимости,
		|		Себестоимость.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		Себестоимость.РазделУчета КАК РазделУчета,
		|		Себестоимость.ВидЗапасов КАК ВидЗапасов,
		|		Себестоимость.Организация КАК Организация,
		|		Себестоимость.Партия КАК Партия,
		|		Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|		Себестоимость.Количество КАК Количество
		|	ИЗ
		|		Регистраторы КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостиПоДекларациямСКоличестом КАК Себестоимость
		|			ПО ДД.АналитикаРасходов = Себестоимость.Регистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДД.АналитикаРасходов,
		|		Себестоимость.ДокументИсточник,
		|		Себестоимость.АналитикаУчетаНоменклатуры,
		|		Себестоимость.РазделУчета,
		|		Себестоимость.ВидЗапасов,
		|		Себестоимость.Организация,
		|		Себестоимость.Партия,
		|		Себестоимость.АналитикаУчетаПартий,
		|		Себестоимость.АналитикаФинансовогоУчета,
		|		Себестоимость.ВидДеятельностиНДС,
		|		Себестоимость.Количество
		|	ИЗ
		|		Регистраторы КАК ДД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостиПоДекларациямСКоличестом КАК Себестоимость
		|			ПО ДД.Организация = Себестоимость.Организация
		|	ГДЕ
		|		ДД.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ТаможеннаяДекларацияИмпорт.ПустаяСсылка)) КАК ТоварыПоДекларациям
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиДополнительныхРасходов(ТипАналитикиРасходов, ИспользуемыеШаблоны, НомерГруппы)
	
	Если ТипАналитикиРасходов = Тип("Неопределено") Тогда
		Шаблон = "";
		
	ИначеЕсли ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказПоставщику")
		Или ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказНаСборку")
		Или ТипАналитикиРасходов = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		Шаблон = ШаблонТекстаПервичныеПриемникиПоЗаказам();
		ИспользуемыеШаблоны.ПоЗаказам.Добавить(НомерГруппы);
		
	ИначеЕсли ТипАналитикиРасходов = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
		Шаблон = ШаблонТекстаПервичныеПриемникиПоДекларациям();
		ИспользуемыеШаблоны.ПоДекларациям.Добавить(НомерГруппы);

	ИначеЕсли РасчетСебестоимостиУниверсальныеАлгоритмы.ОписаниеТиповДокументов().СодержитТип(ТипАналитикиРасходов) Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоДокументам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", 
			"ЗНАЧЕНИЕ(Документ." + Метаданные.НайтиПоТипу(ТипАналитикиРасходов).Имя + ".ПустаяСсылка)");
		ИспользуемыеШаблоны.ПоДокументам.Добавить(НомерГруппы);
		
	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоСправочникам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура");
		ИспользуемыеШаблоны.ПоСправочникам.Добавить(НомерГруппы);

	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.Склады") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоСправочникам();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения");
		ИспользуемыеШаблоны.ПоСправочникам.Добавить(НомерГруппы);
		
	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.Партнеры") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоПереработке();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.Партнер");
		ИспользуемыеШаблоны.ПоПереработке.Добавить(НомерГруппы);

	ИначеЕсли ТипАналитикиРасходов = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Шаблон = ШаблонТекстаПервичныеПриемникиПоПереработке();
		Шаблон = СтрЗаменить(Шаблон, "&ПустоеЗначение", "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
		Шаблон = СтрЗаменить(Шаблон, "&ПолеИсточник", "ИсточникБазы.АналитикаУчетаНоменклатуры.Договор");
		ИспользуемыеШаблоны.ПоПереработке.Добавить(НомерГруппы);
		
	Иначе
		Шаблон = ШаблонТекстаПервичныеПриемникиПрочиеРасходы();
		ИспользуемыеШаблоны.ПоПрочимРасходам.Добавить(НомерГруппы);

	КонецЕсли;

	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоЗаказам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоЗаказам_1"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИСТИНА                                     КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиЗаказов КАК АналитикиЗаказов
		|		ПО ДД.АналитикаРасходов = АналитикиЗаказов.АналитикаРасходов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
		|		ПО АналитикиЗаказов.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И АналитикиЗаказов.Номенклатура = ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура
		|			И АналитикиЗаказов.Характеристика = ИсточникБазы.АналитикаУчетаНоменклатуры.Характеристика
		|			И АналитикиЗаказов.Назначение = ИсточникБазы.АналитикаУчетаНоменклатуры.Назначение
		|			И АналитикиЗаказов.Склад = ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период < &НачалоПериода
		|			И ИсточникБазы.Организация = ДД.Организация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоЗаказам_2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиЗаказов КАК АналитикиЗаказов
		|		ПО ДД.АналитикаРасходов = АналитикиЗаказов.АналитикаРасходов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО АналитикиЗаказов.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И АналитикиЗаказов.Номенклатура = ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура
		|			И АналитикиЗаказов.Характеристика = ИсточникБазы.АналитикаУчетаНоменклатуры.Характеристика
		|			И АналитикиЗаказов.Назначение = ИсточникБазы.АналитикаУчетаНоменклатуры.Назначение
		|			И АналитикиЗаказов.Склад = ИсточникБазы.АналитикаУчетаНоменклатуры.МестоХранения
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ИсточникБазы.Организация = ДД.Организация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоДекларациям()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИСТИНА                                     КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	Приобретения.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриобретенияПоДекларациям КАК Приобретения
		|		ПО ДД.АналитикаРасходов = Приобретения.Декларация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
		|		ПО Приобретения.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И Приобретения.АналитикаУчетаНоменклатуры = ИсточникБазы.АналитикаУчетаНоменклатуры
		|			И Приобретения.РазделУчета = ИсточникБазы.РазделУчета
		|			И Приобретения.ВидЗапасов = ИсточникБазы.ВидЗапасов
		|			И Приобретения.Организация = ИсточникБазы.Организация
		|			И Приобретения.Партия = ИсточникБазы.Партия
		|			И Приобретения.АналитикаУчетаПартий = ИсточникБазы.АналитикаУчетаПартий
		|			И Приобретения.АналитикаФинансовогоУчета = ИсточникБазы.АналитикаФинансовогоУчета
		|			И Приобретения.ВидДеятельностиНДС = ИсточникБазы.ВидДеятельностиНДС
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период < &НачалоПериода
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	Приобретения.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр 
		|		* ВЫБОР
		|			КОГДА ИсточникБазы.Количество = 0
		|				ТОГДА 1
		|			ИНАЧЕ Приобретения.Количество / ИсточникБазы.Количество
		|		КОНЕЦ
		|   КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриобретенияПоДекларациям КАК Приобретения
		|		ПО ДД.АналитикаРасходов = Приобретения.Декларация
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО Приобретения.РегистраторСебестоимости = ИсточникБазы.Регистратор
		|			И Приобретения.АналитикаУчетаНоменклатуры = ИсточникБазы.АналитикаУчетаНоменклатуры
		|			И Приобретения.РазделУчета = ИсточникБазы.РазделУчета
		|			И Приобретения.ВидЗапасов = ИсточникБазы.ВидЗапасов
		|			И Приобретения.Организация = ИсточникБазы.Организация
		|			И Приобретения.Партия = ИсточникБазы.Партия
		|			И Приобретения.АналитикаУчетаПартий = ИсточникБазы.АналитикаУчетаПартий
		|			И Приобретения.АналитикаФинансовогоУчета = ИсточникБазы.АналитикаФинансовогоУчета
		|			И Приобретения.ВидДеятельностиНДС = ИсточникБазы.ВидДеятельностиНДС
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.Количество = 0
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоДокументам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоДокументам_1,2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ИсточникБазы.ЭтоПартияПрошлогоПериода КАК ЭтоПартияПрошлогоПериода,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.ИспользоватьКорЧасть
		|			ТОГДА ИсточникБазы.КорРазделУчета
		|		ИНАЧЕ ИсточникБазы.РазделУчета КОНЕЦ)  КАК РазделУчета,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.ИспользоватьКорЧасть
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаНоменклатуры КОНЕЦ)  КАК АналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.ИспользоватьКорЧасть
		|			ТОГДА ИсточникБазы.КорВидЗапасов
		|		ИНАЧЕ ИсточникБазы.ВидЗапасов КОНЕЦ)   КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.ИспользоватьКорЧасть
		|			ТОГДА ИсточникБазы.КорПартия
		|		ИНАЧЕ ИсточникБазы.Партия КОНЕЦ)       КАК Партия,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.ИспользоватьКорЧасть
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаПартий
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|		И Группа.НомерГруппы = &НомерГруппы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостиПоДокументам КАК ИсточникБазы
		|		ПО ИсточникБазы.ИсходныйДокумент = ДД.АналитикаРасходов
		|		И ИсточникБазы.Организация = ДД.Организация
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	(&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоДокументам_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	(ВЫБОР
		|		КОГДА НЕ РеестрПартии.ДатаДокументаИБ ЕСТЬ NULL И РеестрПартии.ДатаДокументаИБ < &НачалоПериода
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) 					   КАК ЭтоПартияПрошлогоПериода,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорРазделУчета
		|		ИНАЧЕ ИсточникБазы.РазделУчета КОНЕЦ)  КАК РазделУчета,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаНоменклатуры
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаНоменклатуры КОНЕЦ)  КАК АналитикаУчетаНоменклатуры,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорВидЗапасов
		|		ИНАЧЕ ИсточникБазы.ВидЗапасов КОНЕЦ)   КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорПартия
		|		ИНАЧЕ ИсточникБазы.Партия КОНЕЦ)       КАК Партия,
		|	(ВЫБОР
		|		КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|		 И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|			ТОГДА ИсточникБазы.КорАналитикаУчетаПартий
		|		ИНАЧЕ ИсточникБазы.АналитикаУчетаПартий КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ИсточникБазы.Регистратор
		|			И Реестр.Организация = ДД.Организация
		|			И (НЕ Реестр.ДополнительнаяЗапись ИЛИ Реестр.ТипСсылки В (&ДокументыСДвумяОрганизациями))
		|			И Реестр.СторноИсправление
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
		|		ПО Корректировка.Ссылка = ИсточникБазы.Регистратор
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|
		// Условие соединения с реестром документов для партий должно соответствовать условию в запросе формирования
		// временной таблицы ВТДвиженияСебестоимостиПоДокументам.
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрПартии
		|		ПО РеестрПартии.Ссылка = ВЫБОР
		|			КОГДА ИсточникБазы.ТипЗаписи В (
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение),
		|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно))
		|				ТОГДА NULL
		|			КОГДА ИсточникБазы.Партия <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.Партия
		|			КОГДА ИсточникБазы.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.ДокументИсточник
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ РеестрПартии.ДополнительнаяЗапись
		|ГДЕ
		|	ДД.АналитикаРасходов = &ПустоеЗначение
		|	И НЕ ИсточникБазы.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
		|	И (НЕ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
		// Дополнительные расходы по товарам могут распределяться на полуфабрикат давальца, т.к. полуфабрикат давальца 
		// может иметь балансовую стоимость,
		// но не должны распределяться на продукцию давальца, т.к. продукция давальца не может иметь балансовой стоимости и
		// подлежит передаче давальцу. 
		|		ИЛИ ИсточникБазы.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) 
		|		)
		|	И (ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		ИЛИ ТИПЗНАЧЕНИЯ(Реестр.СторнируемыйДокумент) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов) 
		|		ИЛИ ТИПЗНАЧЕНИЯ(Реестр.ИсправляемыйДокумент) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		ИЛИ ТИПЗНАЧЕНИЯ(Корректировка.ДокументОснование) = ТИПЗНАЧЕНИЯ(ДД.АналитикаРасходов)
		|		)
		|	И НЕ ИсточникБазы.Количество = 0
		// Дополнительные расходы не должны распределяться на услуги.
		// Услуги могут быть в разделе учета "Неотфактурованные поставки".
		|	И АналитикаОтбора.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И (ЕСТЬNULL(АналитикаОтбора.Назначение.НаправлениеДеятельности,
		|	 ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ДД.НаправлениеДеятельности
		|		ИЛИ ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоСправочникам()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_1"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	(ИсточникБазы.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеТоваровОтХранителя
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеТоваровНаСклад
		|		)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПеремещениеТоваров)
		|	И НЕ ИсточникБазы.РазделУчета В
		|		(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
		|	И НЕ (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|			И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
		|	И (ЕСТЬNULL(АналитикаОтбора.Назначение.НаправлениеДеятельности,
		|	 ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ДД.НаправлениеДеятельности
		|		ИЛИ ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|   И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	ДД.АналитикаРасходов = &ПустоеЗначение
		|	И НЕ ИсточникБазы.Количество = 0
		|	И (ИсточникБазы.ТипЗаписи В (
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
		|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеТоваровОтХранителя
		|		ИЛИ ИсточникБазы.Регистратор ССЫЛКА Документ.ПоступлениеТоваровНаСклад
		|		)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПеремещениеТоваров)
		|	И НЕ ИсточникБазы.РазделУчета В
		|		(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
		|		 ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение))
		|	И НЕ (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|			И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
		|	И (ЕСТЬNULL(АналитикаОтбора.Назначение.НаправлениеДеятельности,
		|	 ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ДД.НаправлениеДеятельности
		|		ИЛИ ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	И (АналитикаОтбора.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) 
		|		ИЛИ ИсточникБазы.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоСправочникам_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.КоличествоОстаток             КАК Количество,
		|	ИсточникБазы.СтоимостьОстаток              КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДСОстаток        КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРеглОстаток          КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпрОстаток           КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
		|			Организация В (&МассивОрганизаций) И 
		|			(РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|				И НЕ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
		|			ИЛИ РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|				И (ТИПЗНАЧЕНИЯ(АналитикаУчетаНоменклатуры.МестоХранения) = ТИП(Справочник.Склады)
		|					ИЛИ АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)))) КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.КоличествоОстаток = 0
		|	И (ЕСТЬNULL(АналитикаОтбора.Назначение.НаправлениеДеятельности,
		|	 ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ДД.НаправлениеДеятельности
		|		ИЛИ ДД.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
		|	И (&УсловиеСоединения)";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПрочиеРасходы()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПрочиеРасходы"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|		И Группа.НомерГруппы = &НомерГруппы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостиПоПрочимРасходам КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|ГДЕ
		|   (&УсловиеСоединения)
		|";
	
	Возврат Шаблон;
	
КонецФункции

Функция ШаблонТекстаПервичныеПриемникиПоПереработке()
	
	Шаблон = 
		"ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоПереработке_1"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.КоличествоОстаток             КАК Количество,
		|	ИсточникБазы.СтоимостьОстаток              КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДСОстаток        КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРеглОстаток          КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпрОстаток           КАК СтоимостьУпр
		|
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
		|			Организация В (&МассивОрганизаций) И 
		|			РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
		|				И АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
		|		) КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.КлючАналитики
		|ГДЕ
		|	НЕ ИсточникБазы.КоличествоОстаток = 0
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоПереработке_2"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|			И ДД.АналитикаРасходов = &ПолеИсточник
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
		|		И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента))
		|	И (&УсловиеСоединения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ШаблонТекстаПервичныеПриемникиПоПереработке_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		|	ЛОЖЬ                                       КАК ЭтоПартияПрошлогоПериода,
		|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
		|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
		|	ИсточникБазы.Организация                   КАК Организация,
		|	ИсточникБазы.Партия                        КАК Партия,
		|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	ИсточникБазы.Количество                    КАК Количество,
		|	ИсточникБазы.Стоимость                     КАК Стоимость,
		|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
		|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
		|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
		|		ПО ДД.Ссылка = Группа.Объект
		|			И Группа.НомерГруппы = &НомерГруппы
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
		|		ПО ДД.Организация = ИсточникБазы.Организация
		|			И ИсточникБазы.СлужебноеВидДвиженияПриход
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
		|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
		|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
		|ГДЕ
		|	ДД.АналитикаРасходов = &ПустоеЗначение
		|	И НЕ ИсточникБазы.Количество = 0
		|	И ИсточникБазы.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
		|	И НЕ ИсточникБазы.Количество = 0
		|	И ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
		|		И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
		|	И (&УсловиеСоединения)
		|	";
	
	Возврат Шаблон;
	
КонецФункции

Функция ДополнительныеТаблицыДляПриемниковПоДокументам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.АналитикаРасходов КАК Ссылка
	|ПОМЕСТИТЬ ВТДокументыВАналитикеРасходов
	|ИЗ
	|	Регистраторы КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыОбъектовДополнительныхРасходов КАК Группа
	|		ПО Т.Ссылка = Группа.Объект
	|ГДЕ
	|	Т.АналитикаРасходов <> НЕОПРЕДЕЛЕНО
	|	И (&ОтборПоГруппамПоДокументам)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка,
	|	Т.ИсходныйДокумент
	|ПОМЕСТИТЬ ВТСвязиДокументовАналитикиРасходов
	|ИЗ
	|(ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Ссылка КАК ИсходныйДокумент
	|ИЗ
	|	ВТДокументыВАналитикеРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Т.Ссылка = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Корректировка.Ссылка КАК Ссылка,
	|	Т.Ссылка КАК ИсходныйДокумент
	|ИЗ
	|	ВТДокументыВАналитикеРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения КАК Корректировка
	|		ПО Т.Ссылка = Корректировка.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реестр.Ссылка КАК Ссылка,
	|	Т.Ссылка КАК ИсходныйДокумент
	|ИЗ
	|	ВТДокументыВАналитикеРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Т.Ссылка = Реестр.СторнируемыйДокумент
	|			И НЕ Реестр.ДополнительнаяЗапись
	|			И Реестр.СторноИсправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реестр.Ссылка КАК Ссылка,
	|	Т.Ссылка КАК ИсходныйДокумент
	|ИЗ
	|	ВТДокументыВАналитикеРасходов КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Т.Ссылка = Реестр.ИсправляемыйДокумент
	|			И НЕ Реестр.ДополнительнаяЗапись
	|			И Реестр.СторноИсправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Дополнительные расходы по партиям, переданным в филиал по документам прошлого периода.
	// Такие партии отражаются движением "Приход" по хоз. операциям "Внутреннее поступление работ" и "Внутреннее поступление товаров".
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Ссылка,
	|	Т.Партия КАК ИсходныйДокумент
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|	ПО Реестр.Ссылка = Т.Партия
	|		И НЕ Реестр.ДополнительнаяЗапись
	|ГДЕ
	|	Т.Организация В (&МассивОрганизаций)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Т.Период МЕЖДУ НАЧАЛОПЕРИОДА(Реестр.ДатаДокументаИБ, МЕСЯЦ) И &НачалоПериода
	|	И Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Дополнительные расходы по партиям, переданным в филиал по документам текущего периода.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Ссылка,
	|	Т.Партия КАК ИсходныйДокумент
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.СлужебноеВидДвиженияПриход
	|	И Т.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров))
	|) КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ИсточникБазы.Регистратор,
	|	Отбор.ИсходныйДокумент КАК ИсходныйДокумент,
	|	ИСТИНА КАК ЭтоПартияПрошлогоПериода,
	|	ВЫБОР КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|	  И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьКорЧасть,
	|	ИсточникБазы.Организация,
	|	ИсточникБазы.РазделУчета,
	|	ИсточникБазы.КорРазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.КорАналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов,
	|	ИсточникБазы.КорВидЗапасов,
	|	ИсточникБазы.Партия,
	|	ИсточникБазы.КорПартия,
	|	ИсточникБазы.АналитикаУчетаПартий,
	|	ИсточникБазы.КорАналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС,
	|	ИсточникБазы.Количество,
	|	ИсточникБазы.Стоимость + ИсточникБазы.ДопРасходы КАК Стоимость,
	|	ИсточникБазы.СтоимостьБезНДС + ИсточникБазы.ДопРасходыБезНДС КАК СтоимостьБезНДС,
	|	ИсточникБазы.СтоимостьРегл + ИсточникБазы.ДопРасходыРегл КАК СтоимостьРегл,
	|	ИсточникБазы.СтоимостьУпр + ИсточникБазы.ДопРасходыУпр КАК СтоимостьУпр
	|
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостиПоДокументам
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ИсточникБазы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиДокументовАналитикиРасходов КАК Отбор
	|		ПО ИсточникБазы.Регистратор = Отбор.Ссылка
	|ГДЕ
	|	ИсточникБазы.Организация В (&МассивОрганизаций)
	|	И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ИсточникБазы.Период < &НачалоПериода
	|	И (ИсточникБазы.Количество <> 0
	|		ИЛИ ИсточникБазы.ТипЗаписи В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно)))
	|	И НЕ ИсточникБазы.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
	|	И (НЕ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	// Дополнительные расходы по товарам могут распределяться на полуфабрикат давальца, т.к. полуфабрикат давальца 
	// может иметь балансовую стоимость,
	// но не должны распределяться на продукцию давальца, т.к. продукция давальца не может иметь балансовой стоимости и
	// подлежит передаче давальцу. 
	|			ИЛИ ИсточникБазы.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) 
	|		)
	
	// Дополнительные расходы не должны распределяться на услуги.
	// Услуги могут быть в разделе учета "Неотфактурованные поставки".
	|	И ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	// Расходы с аналитикой "Корректировка приобретения" распределяются только на положительные приходы.
	|	И НЕ (ТИПЗНАЧЕНИЯ(Отбор.ИсходныйДокумент) = ТИП(Документ.КорректировкаПриобретения)
	|		И ИсточникБазы.Количество < 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсточникБазы.Регистратор,
	|	Отбор.ИсходныйДокумент КАК ИсходныйДокумент,
	|	ВЫБОР КОГДА НЕ РеестрПартии.ДатаДокументаИБ ЕСТЬ NULL И РеестрПартии.ДатаДокументаИБ < &НачалоПериода
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПартияПрошлогоПериода,
	|	ВЫБОР КОГДА ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|	  И ИсточникБазы.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьКорЧасть,
	|	ИсточникБазы.Организация,
	|	ИсточникБазы.РазделУчета,
	|	ИсточникБазы.КорРазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.КорАналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов,
	|	ИсточникБазы.КорВидЗапасов,
	|	ИсточникБазы.Партия,
	|	ИсточникБазы.КорПартия,
	|	ИсточникБазы.АналитикаУчетаПартий,
	|	ИсточникБазы.КорАналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС,
	|	ИсточникБазы.Количество,
	|	ИсточникБазы.Стоимость + ИсточникБазы.ДопРасходы КАК Стоимость,
	|	ИсточникБазы.СтоимостьБезНДС + ИсточникБазы.ДопРасходыБезНДС КАК СтоимостьБезНДС,
	|	ИсточникБазы.СтоимостьРегл + ИсточникБазы.ДопРасходыРегл КАК СтоимостьРегл,
	|	ИсточникБазы.СтоимостьУпр + ИсточникБазы.ДопРасходыУпр КАК СтоимостьУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиДокументовАналитикиРасходов КАК Отбор
	|		ПО ИсточникБазы.Регистратор = Отбор.Ссылка
	// Условие соединения с реестром документов для партий должно соответствовать условию в функции ШаблонТекстаПервичныеПриемникиПоДокументам_3
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрПартии
	|		ПО РеестрПартии.Ссылка = ВЫБОР
	|			КОГДА ИсточникБазы.ТипЗаписи В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение),
	// Для перемещений между организациями (перемещение обособленно) строки из реестра партий не подбираются,
	// т.к. иначе подберет партию по организации-отправителю и может попасться партия прошлого периода. Для организации-получателя это операция текущего периода.
	|					ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно))
	|				ТОГДА NULL
	|			КОГДА ИсточникБазы.Партия <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.Партия
	|			КОГДА ИсточникБазы.ДокументИсточник <> НЕОПРЕДЕЛЕНО ТОГДА ИсточникБазы.ДокументИсточник
	|			ИНАЧЕ NULL КОНЕЦ
	|		И НЕ РеестрПартии.ДополнительнаяЗапись
	|ГДЕ
	|	ИсточникБазы.СлужебноеВидДвиженияПриход
	|	И (ИсточникБазы.Количество <> 0
	|		ИЛИ ИсточникБазы.ТипЗаписи В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
	|		))
	|	И НЕ ИсточникБазы.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
	|	И (НЕ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	// Дополнительные расходы по товарам могут распределяться на полуфабрикат давальца, т.к. полуфабрикат давальца 
	// может иметь балансовую стоимость,
	// но не должны распределяться на продукцию давальца, т.к. продукция давальца не может иметь балансовой стоимости и
	// подлежит передаче давальцу. 
	|			ИЛИ ИсточникБазы.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца) 
	|		)
	
	// Дополнительные расходы не должны распределяться на услуги.
	// Услуги могут быть в разделе учета "Неотфактурованные поставки".
	|	И ИсточникБазы.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	// Расходы с аналитикой "Корректировка приобретения" распределяются только на положительные приходы.
	|	И НЕ (ТИПЗНАЧЕНИЯ(Отбор.ИсходныйДокумент) = ТИП(Документ.КорректировкаПриобретения)
	|		И ИсточникБазы.Количество < 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсходныйДокумент
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДополнительныеТаблицыДляПриемниковПоПрочимРасходам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
	|	ИсточникБазы.Организация                   КАК Организация,
	|	ИсточникБазы.Партия                        КАК Партия,
	|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	СУММА(ИсточникБазы.Количество)             КАК Количество,
	|	СУММА(ИсточникБазы.Стоимость)              КАК Стоимость,
	|	СУММА(ИсточникБазы.СтоимостьБезНДС)        КАК СтоимостьБезНДС,
	|	СУММА(ИсточникБазы.СтоимостьРегл)          КАК СтоимостьРегл,
	|	СУММА(ИсточникБазы.СтоимостьУпр)           КАК СтоимостьУпр
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостиПоПрочимРасходам
	|ИЗ
	|(ВЫБРАТЬ
	|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
	|	ИсточникБазы.Организация                   КАК Организация,
	|	ИсточникБазы.Партия                        КАК Партия,
	|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ИсточникБазы.Количество                    КАК Количество,
	|	ИсточникБазы.Стоимость                     КАК Стоимость,
	|	ИсточникБазы.СтоимостьБезНДС               КАК СтоимостьБезНДС,
	|	ИсточникБазы.СтоимостьРегл                 КАК СтоимостьРегл,
	|	ИсточникБазы.СтоимостьУпр                  КАК СтоимостьУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ИсточникБазы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтбора
	|		ПО ИсточникБазы.АналитикаУчетаНоменклатуры = АналитикаОтбора.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК РеквизитыСклада
	|		ПО АналитикаОтбора.МестоХранения = РеквизитыСклада.Ссылка
	|ГДЕ
	|	ИсточникБазы.СлужебноеВидДвиженияПриход
	|	И ИсточникБазы.Количество <> 0
	|	И (ИсточникБазы.ТипЗаписи В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода))
	|		)
	|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПеремещениеТоваров)
	|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.СборкаТоваров)
	|	И НЕ ТИПЗНАЧЕНИЯ(ИсточникБазы.Регистратор) = ТИП(Документ.ПередачаТоваровМеждуОрганизациями)
	|	И (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|		ИЛИ ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И (АналитикаОтбора.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ИЛИ ЕСТЬNULL(РеквизитыСклада.ЦеховаяКладовая, ЛОЖЬ)

	|			))
	|	И НЕ (ИсточникБазы.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|			И АналитикаОтбора.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсточникБазы.РазделУчета                   КАК РазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов                    КАК ВидЗапасов,
	|	ИсточникБазы.Организация                   КАК Организация,
	|	ИсточникБазы.Партия                        КАК Партия,
	|	ИсточникБазы.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	ИсточникБазы.КоличествоОстаток             КАК Количество,
	|	ИсточникБазы.СтоимостьОстаток              КАК Стоимость,
	|	ИсточникБазы.СтоимостьБезНДСОстаток        КАК СтоимостьБезНДС,
	|	ИсточникБазы.СтоимостьРеглОстаток          КАК СтоимостьРегл,
	|	ИсточникБазы.СтоимостьУпрОстаток           КАК СтоимостьУпр
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&ГраницаНачалоПериода,
	|		Организация В (&МассивОрганизаций) И 
	|		(РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|			И НЕ АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|		ИЛИ РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			И (ТИПЗНАЧЕНИЯ(АналитикаУчетаНоменклатуры.МестоХранения) = ТИП(Справочник.Склады)
	|				ИЛИ АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)))) КАК ИсточникБазы
	|ГДЕ
	|	ИсточникБазы.КоличествоОстаток <> 0
	|) КАК ИсточникБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникБазы.РазделУчета,
	|	ИсточникБазы.АналитикаУчетаНоменклатуры,
	|	ИсточникБазы.ВидЗапасов,
	|	ИсточникБазы.Организация,
	|	ИсточникБазы.Партия,
	|	ИсточникБазы.АналитикаУчетаПартий,
	|	ИсточникБазы.АналитикаФинансовогоУчета,
	|	ИсточникБазы.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПервичныеПриемникиДополнительныхРасходов(ПараметрыРасчета)
	
	ИмяВременнойТаблицыГруппыОбъектов = "ГруппыОбъектовДополнительныхРасходов";
	ТекстПолученияОбъектов = 
		"ВЫБРАТЬ
		|	Регистраторы.Ссылка,
		|	Регистраторы.БазаРаспределенияПоПартиям КАК ТипБазыРаспределения,
		|	Регистраторы.НастройкиБазыРаспределенияПоПартиям КАК НастройкиСхемы,
		|	ТИПЗНАЧЕНИЯ(Регистраторы.АналитикаРасходов) КАК ТипАналитикиРасходов
		|ИЗ
		|	Регистраторы КАК Регистраторы";

	ОписаниеГрупп = ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов);
	
	ГотовыеТекстыЗапросов = Новый Массив;
	ГотовыеТекстыЗапросов.Добавить(ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицыГруппыОбъектов));
	ТекстОписаниеДанных =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	""ТекстОписаниеДанныхДляРаспределенияДополнительныхРасходов"" КАК ЗапросИсточник,
		|	ДД.Регистратор                   КАК Регистратор,
		|	ЛОЖЬ                             КАК ЭтоПартияПрошлогоПериода,
		|	ДД.РазделУчета                   КАК РазделУчета,
		|	ДД.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|	ДД.ВидЗапасов                    КАК ВидЗапасов,
		|	ДД.Организация                   КАК Организация,
		|	ДД.Партия                        КАК Партия,
		|	ДД.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета     КАК АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
		|	0                                КАК Количество,
		|	0                                КАК Стоимость,
		|	0                                КАК СтоимостьБезНДС,
		|	0                                КАК СтоимостьРегл,
		|	0                                КАК СтоимостьУпр
		|ПОМЕСТИТЬ ОписаниеДанных
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|ГДЕ
		|	ЛОЖЬ";
	ГотовыеТекстыЗапросов.Добавить(ТекстОписаниеДанных);
	ДополнитьТекстамиПоОписаниюГрупп(ГотовыеТекстыЗапросов, ОписаниеГрупп, ИмяВременнойТаблицыГруппыОбъектов);
	
	// Объединим все ТаблицаДанных(х) группами по КоличествоТаблицВЗапросе в промежуточные таблицы ПервичныеПриемники(у)
	// Затем объединим все ПервичныеПриемники(у) в итоговую таблицу ПервичныеПриемники и удалим все ТаблицаДанных(х) и ПервичныеПриемники(у)
	МассивУдаляемых = Новый Массив;
	МассивИсточников = Новый Массив;
	МассивИсточников.Добавить("ОписаниеДанных");
	
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		Если НЕ ОписаниеГруппы.Используется Тогда
			Продолжить
		КонецЕсли;
		МассивИсточников.Добавить(СтрШаблон("ТаблицаДанных%1", Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	КонецЦикла;
	
	СчетчикИсточников 		 = -1;
	КоличествоТаблицВЗапросе = 254;
	КоличествоЗапросов 		 = МассивИсточников.Количество() / КоличествоТаблицВЗапросе;
	КоличествоЗапросов 		 = Цел(КоличествоЗапросов) + ?(КоличествоЗапросов = Цел(КоличествоЗапросов), 0, 1);
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ
	|	Т.ЗапросИсточник,
	|	Т.Регистратор,
	|	Т.ЭтоПартияПрошлогоПериода,
	|	Т.РазделУчета,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидЗапасов,
	|	Т.Организация,
	|	Т.Партия,
	|	Т.АналитикаУчетаПартий,
	|	Т.АналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС,
	|	Т.Количество,
	|	Т.Стоимость,
	|	Т.СтоимостьБезНДС,
	|	Т.СтоимостьРегл,
	|	Т.СтоимостьУпр
	|ПОМЕСТИТЬ ПервичныеПриемникиИсх
	|ИЗ
	|	ОписаниеДанных КАК Т";
	
	Для НомерЗапроса = 1 По КоличествоЗапросов Цикл
		
		Если НомерЗапроса = 1 И КоличествоЗапросов = 1 Тогда
			ИмяПромежуточнойТаблицы = "ПервичныеПриемникиИсх";
		Иначе
			ИмяПромежуточнойТаблицы = "ПервичныеПриемники" + Формат(НомерЗапроса, "ЧН=0; ЧГ=0");
			МассивУдаляемых.Добавить(ИмяПромежуточнойТаблицы);
		КонецЕсли;
		
		МассивТекстовПодзапросов = Новый Массив;
		
		Для НомерТаблицы = 1 По КоличествоТаблицВЗапросе Цикл
			
			СчетчикИсточников = СчетчикИсточников + 1;
			Если СчетчикИсточников > МассивИсточников.Количество() - 1 Тогда
				Прервать;
			КонецЕсли;
			
			Если НомерТаблицы = 1 Тогда
				ТекстТекущегоЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "ПервичныеПриемникиИсх", ИмяПромежуточнойТаблицы);
			Иначе
				ТекстТекущегоЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "ПОМЕСТИТЬ ПервичныеПриемникиИсх", "");
			КонецЕсли;
			
			ТекстТекущегоЗапроса = СтрЗаменить(ТекстТекущегоЗапроса, "ОписаниеДанных", МассивИсточников[СчетчикИсточников]);
			
			МассивТекстовПодзапросов.Добавить(ТекстТекущегоЗапроса);
			МассивУдаляемых.Добавить(МассивИсточников[СчетчикИсточников]);
			
		КонецЦикла;
		
		ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(МассивТекстовПодзапросов)); // ТаблицаДанных(х) + ТаблицаДанных(х+1) + ... -> ПервичныеПриемники(у)
		
	КонецЦикла;
	
	Если КоличествоЗапросов > 1 Тогда
		
		МассивТекстовПодзапросов = Новый Массив;
		
		Для НомерЗапроса = 1 По КоличествоЗапросов Цикл
			
			ИмяПромежуточнойТаблицы = "ПервичныеПриемникиИсх" + Формат(НомерЗапроса, "ЧН=0; ЧГ=0");
			
			Если НомерЗапроса = 1 Тогда
				ТекстТекущегоЗапроса = ШаблонТекстаЗапроса;
			Иначе
				ТекстТекущегоЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "ПОМЕСТИТЬ ПервичныеПриемникиИсх", "");
			КонецЕсли;
			
			ТекстТекущегоЗапроса = СтрЗаменить(ТекстТекущегоЗапроса, "ОписаниеДанных", ИмяПромежуточнойТаблицы);
			
			МассивТекстовПодзапросов.Добавить(ТекстТекущегоЗапроса);
			
		КонецЦикла;
		
		ГотовыеТекстыЗапросов.Добавить(ОбъединитьТексты(МассивТекстовПодзапросов)); // ПервичныеПриемники(х) + ПервичныеПриемники(х+1) + ... -> ПервичныеПриемники
		
	КонецЕсли;
	
	Для Каждого ИмяТаблицы Из МассивУдаляемых Цикл
		ГотовыеТекстыЗапросов.Добавить("УНИЧТОЖИТЬ" + " " + ИмяТаблицы);
	КонецЦикла;
	
	ТекстПервичныеПриемники = 
		"ВЫБРАТЬ
		|	Т.Регистратор КАК Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода КАК ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета КАК РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов КАК ВидЗапасов,
		|	Т.Организация КАК Организация,
		|	Т.Партия КАК Партия,
		|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	СУММА(Т.Количество) КАК Количество,
		|	СУММА(Т.Стоимость) КАК Стоимость,
		|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр
		|ПОМЕСТИТЬ ПервичныеПриемники
		|ИЗ
		|	ПервичныеПриемникиИсх КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	РазделУчета,
		|	ВидЗапасов,
		|	Организация,
		|	Партия,
		|	АналитикаУчетаПартий,
		|	АналитикаФинансовогоУчета,
		|	ВидДеятельностиНДС";
	
	ГотовыеТекстыЗапросов.Добавить(ТекстПервичныеПриемники);
	
	Возврат ОбъединитьТексты(ГотовыеТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

Функция КорректировкаПриемниковПоРегистраторам()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС,
		|	СУММА(Т.Количество) КАК Количество,
		|	СУММА(Т.Стоимость) КАК Стоимость,
		|	СУММА(Т.СтоимостьБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(Т.СтоимостьРегл) КАК СтоимостьРегл,
		|	СУММА(Т.СтоимостьУпр) КАК СтоимостьУпр
		|
		|ПОМЕСТИТЬ ПриемникиПоТоварам
		|ИЗ
		|	(ВЫБРАТЬ
		|		Источник.Регистратор,
		|		Источник.ЭтоПартияПрошлогоПериода,
		|		Источник.АналитикаУчетаНоменклатуры,
		|		Источник.РазделУчета,
		|		Источник.ВидЗапасов,
		|		Источник.Организация,
		|		Источник.Партия,
		|		Источник.АналитикаУчетаПартий,
		|		Источник.АналитикаФинансовогоУчета,
		|		Источник.ВидДеятельностиНДС,
		|		Источник.Количество КАК Количество,
		|		Источник.Стоимость КАК Стоимость,
		|		Источник.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Источник.СтоимостьРегл КАК СтоимостьРегл,
		|		Источник.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|	ГДЕ
		|		НЕ Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		ИЛИ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Источник.Регистратор,
		|		(Данные.Период < &НачалоПериода),
		|		Данные.КорАналитикаУчетаНоменклатуры,
		|		Данные.КорРазделУчета,
		|		Данные.КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА Данные.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА Данные.Организация
		|			ИНАЧЕ
		|				Данные.КорОрганизация
		|		КОНЕЦ,
		|		Данные.КорПартия,
		|		Данные.КорАналитикаУчетаПартий,
		|		Данные.КорАналитикаФинансовогоУчета,
		|		Данные.КорВидДеятельностиНДС,
		|		Данные.Количество,
		|		Данные.Стоимость КАК Стоимость,
		|		Данные.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Данные.СтоимостьРегл КАК СтоимостьРегл,
		|		Данные.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Данные
		|			ПО Источник.АналитикаУчетаНоменклатуры = Данные.АналитикаУчетаНоменклатуры
		|				И Источник.РазделУчета = Данные.РазделУчета
		|				И Источник.ВидЗапасов = Данные.ВидЗапасов
		|				И Источник.Организация = Данные.Организация
		|				И Источник.Партия = Данные.Партия
		|				И Источник.АналитикаУчетаПартий = Данные.АналитикаУчетаПартий
		|				И Источник.АналитикаФинансовогоУчета = Данные.АналитикаФинансовогоУчета
		|				И Источник.ВидДеятельностиНДС = Данные.ВидДеятельностиНДС
		|				И Данные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И Данные.Период < &НачалоПериода
		|	ГДЕ
		|		Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Источник.Регистратор,
		|		(Данные.Период < &НачалоПериода),
		|		Данные.КорАналитикаУчетаНоменклатуры,
		|		Данные.КорРазделУчета,
		|		Данные.КорВидЗапасов,
		|		ВЫБОР
		|			КОГДА Данные.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА Данные.Организация
		|			ИНАЧЕ
		|				Данные.КорОрганизация
		|		КОНЕЦ,
		|		Данные.КорПартия,
		|		Данные.КорАналитикаУчетаПартий,
		|		Данные.КорАналитикаФинансовогоУчета,
		|		Данные.КорВидДеятельностиНДС,
		|		Данные.Количество,
		|		Данные.Стоимость КАК Стоимость,
		|		Данные.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|		Данные.СтоимостьРегл КАК СтоимостьРегл,
		|		Данные.СтоимостьУпр КАК СтоимостьУпр
		|	ИЗ
		|		ПервичныеПриемники КАК Источник
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК Данные
		|			ПО Источник.АналитикаУчетаНоменклатуры = Данные.АналитикаУчетаНоменклатуры
		|				И Источник.РазделУчета = Данные.РазделУчета
		|				И Источник.ВидЗапасов = Данные.ВидЗапасов
		|				И Источник.Организация = Данные.Организация
		|				И Источник.Партия = Данные.Партия
		|				И Источник.АналитикаУчетаПартий = Данные.АналитикаУчетаПартий
		|				И Источник.АналитикаФинансовогоУчета = Данные.АналитикаФинансовогоУчета
		|				И Источник.ВидДеятельностиНДС = Данные.ВидДеятельностиНДС
		|				И НЕ Данные.СлужебноеВидДвиженияПриход
		|	ГДЕ
		|		Источник.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		И НЕ &РаспределениеДопРасходовНаТоварыВПутиОтПоставщиков
		|	) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Регистратор,
		|	Т.ЭтоПартияПрошлогоПериода,
		|	Т.РазделУчета,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстПриемникиПоТоварамПрошлыхПериодовДополнительныхРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Реквизиты.Дата КАК Период,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка) КАК ТипЗаписи,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
		|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации,
		|	Источник.Количество КАК КоличествоКРаспределению,
		|	Источник.Стоимость КАК СтоимостьКРаспределению,
		|	Источник.СтоимостьБезНДС КАК СтоимостьБезНДСКРаспределению,
		|	Источник.СтоимостьРегл КАК СтоимостьРеглКРаспределению,
		|	Источник.СтоимостьУпр КАК СтоимостьУпрКРаспределению,
		|
		|	0 КАК ДопРасходыСНДСКРаспределению,
		|	0 КАК ДопРасходыБезНДСКРаспределению,
		|	0 КАК ДопРасходыРеглНДСКРаспределению,
		|	0 КАК ДопРасходыУпрНДСКРаспределению,
		|	0 КАК НДСРеглКРаспределению,
		|	0 КАК НДСУпрКРаспределению,
		|	0 КАК ПостояннаяРазницаКРаспределению,
		|	0 КАК ВременнаяРазницаКРаспределению,
		|	
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(
		|		ВЫБОР КОГДА Реестр.ДатаДокументаИБ ЕСТЬ NULL ИЛИ Реестр.ДатаДокументаИБ < &ДатаПереходаНаПартионныйУчетВерсии22
		|			ТОГДА &ДатаПереходаНаПартионныйУчетВерсии22
		|			ИНАЧЕ Реестр.ДатаДокументаИБ
		|		КОНЕЦ, МЕСЯЦ)) КАК ПериодПоступления
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварам КАК Источник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ПО Источник.Регистратор = Реквизиты.Ссылка
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
		|		ПО Реестр.Ссылка = ВЫБОР
		|			КОГДА Источник.Партия <> НЕОПРЕДЕЛЕНО ТОГДА Источник.Партия
		|			КОГДА Реквизиты.АналитикаРасходов <> НЕОПРЕДЕЛЕНО ТОГДА Реквизиты.АналитикаРасходов
		|			ИНАЧЕ NULL КОНЕЦ
		|		И НЕ Реестр.ДополнительнаяЗапись
		|ГДЕ
		|	Источник.ЭтоПартияПрошлогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Реквизиты.Дата,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|	Источник.Количество,
		|	Источник.Стоимость,
		|	Источник.СтоимостьБезНДС,
		|	Источник.СтоимостьРегл,
		|	Источник.СтоимостьУпр
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|ПОМЕСТИТЬ ВТОтборАналитикДляПеремещенийМеждуОрганизациями
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|СГРУППИРОВАТЬ ПО
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
		|	ДД.АналитикаУчетаНоменклатуры.Серия
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		// При методе оценки стоимости "Средняя за месяц" нужно проверить наличие движений по изменению аналитики.
		// При распределении на выбытия товаров в прошлом периоде нужно учитывать наличие изменений аналитики.
		// Если изменений аналитики не было, доп расходы должны распределяться только на исходную аналитику документа приобретения. 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация КАК Организация,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
		|
		|ПОМЕСТИТЬ ВТЕстьПеремещенияМеждуАналитиками
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриемникиПоТоварамПрошлыхПериодов КАК Отбор
		|		ПО Отбор.Партия = НЕОПРЕДЕЛЕНО
		|		И Отбор.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Отбор.Организация = ДД.Организация
		|		И Отбор.ВидЗапасов = ДД.ВидЗапасов
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И ДД.Период МЕЖДУ Отбор.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.Организация В(&МассивОрганизаций)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ДД.Партия = НЕОПРЕДЕЛЕНО
		|	И ДД.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
		|	И ДД.РазделУчета = ДД.КорРазделУчета
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация КАК Организация,
		|	ДД.КорПартия КАК Партия,
		|	ДД.КорВидЗапасов КАК ВидЗапасов,
		|	ДД.КорАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ДД.КорАналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ДД.КорАналитикаУчетаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВТПеремещенияМеждуОрганизациями
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК Поступления
		|		ПО ДД.Регистратор = Поступления.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикДляПеремещенийМеждуОрганизациями КАК Отбор
		|		ПО ДД.Партия = Отбор.Партия
		|		И ДД.АналитикаУчетаНоменклатуры.Номенклатура = Отбор.Номенклатура
		|		И ДД.АналитикаУчетаНоменклатуры.Характеристика = Отбор.Характеристика
		|		И (ДД.АналитикаУчетаНоменклатуры.Серия = Отбор.Серия
		|			ИЛИ ДД.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
		|ГДЕ
		|	ДД.Период МЕЖДУ Отбор.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.Организация В (&МассивОрганизаций)
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.ВидЗапасов КАК ВидЗапасов,
		|	ДД.Номенклатура КАК Номенклатура,
		|	ДД.Характеристика КАК Характеристика,
		|	ДД.Серия КАК Серия
		|ИЗ
		|	ВТОтборАналитикДляПеремещенийМеждуОрганизациями КАК ДД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Партия,
		|	Характеристика
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Аналитика.Номенклатура,
		|	Аналитика.Характеристика,
		|	Аналитика.Серия,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия КАК ПартияИсходная,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК Партия,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ) КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодовСНоменклатурой
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
		|		ПО Аналитика.Ссылка = ДД.АналитикаУчетаНоменклатуры
		|СГРУППИРОВАТЬ ПО
		|	Аналитика.Номенклатура,
		|	Аналитика.Характеристика,
		|	Аналитика.Серия,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.Партия
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ),
		|	(ВЫБОР
		|		КОГДА ДД.Организация В (&ОрганизацииСФИФОСкользящаяВПрошломПериоде)
		|		 ИЛИ ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|		 ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
		|			ТОГДА ДД.АналитикаУчетаПартий
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КОНЕЦ),
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ПартияИсходная,
		|	Характеристика
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ДД.Номенклатура,
		|	ДД.Характеристика,
		|	ДД.Серия,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.ПартияИсходная,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Перемещения.Организация КАК ОрганизацияПеремещения,
		|	Перемещения.ВидЗапасов КАК ВидЗапасовПеремещения,
		|	Перемещения.Партия КАК ПартияПеремещения,
		|	(ВЫБОР
		|		КОГДА ДД.ПартияИсходная = НЕОПРЕДЕЛЕНО И ВтЕстьПеремещения.Организация ЕСТЬ NULL ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьПеремещения,
		|
		|	ДД.ПериодПоступления
		|
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодовСПеремещениями
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовСНоменклатурой КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПеремещенияМеждуОрганизациями КАК Перемещения
		|		ПО Перемещения.Номенклатура = ДД.Номенклатура
		|		И (Перемещения.Партия = ДД.ПартияИсходная
		|			ИЛИ Перемещения.Партия = НЕОПРЕДЕЛЕНО)
		|		И Перемещения.Характеристика = ДД.Характеристика
		|		И (Перемещения.Серия = ДД.Серия
		|			ИЛИ Перемещения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|			ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути))
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЕстьПеремещенияМеждуАналитиками КАК ВтЕстьПеремещения
		|		ПО ВтЕстьПеремещения.Организация = ДД.Организация
		|		И ВтЕстьПеремещения.ВидЗапасов = ДД.ВидЗапасов
		|		И ВтЕстьПеремещения.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И ДД.ПартияИсходная = НЕОПРЕДЕЛЕНО
		|ГДЕ
		|	НЕ (Перемещения.Партия = НЕОПРЕДЕЛЕНО И Перемещения.Организация <> ДД.Организация)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ДД.Номенклатура,
		|	ДД.Характеристика,
		|	ДД.Серия,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.ПартияИсходная,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ОрганизацияПеремещения,
		|	ДД.ВидЗапасовПеремещения,
		|	ДД.ПартияПеремещения,
		|	ДД.ВидЗапасов КАК ВидЗапасовПриемника,
		|	ДД.ЕстьПеремещения,
		|	ДД.ПериодПоступления
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодовДополненная
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовСПеремещениями КАК ДД
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.Номенклатура,
		|	ДД.Характеристика,
		|	ДД.Серия,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.ПартияИсходная,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.ОрганизацияПеремещения,
		|	ДД.ВидЗапасовПеремещения,
		|	ДД.ПартияПеремещения,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК ВидЗапасовПриемника,
		|	ДД.ЕстьПеремещения,
		|	ДД.ПериодПоступления
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовСПеремещениями КАК ДД
		|ГДЕ
		|	 ДД.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета КАК РазделУчета,
		|	Остатки.ВидЗапасов КАК ВидЗапасов,
		|	Остатки.Организация КАК Организация,
		|	Остатки.Партия КАК Партия,
		|	Остатки.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	Остатки.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	Остатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиПрошлогоПериода
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(
		|		&ГраницаКонецПредыдущегоПериода, Организация В (&МассивОрганизаций)) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ВЗ.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВЗ.РазделУчета КАК РазделУчета,
		|	ВЗ.ВидЗапасов КАК ВидЗапасов,
		|	ВЗ.Организация КАК Организация,
		|	ВЗ.Партия КАК Партия,
		|	ВЗ.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ВЗ.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|	ВЗ.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|	СУММА(ВЗ.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиПрошлогоПериодаСУчетомКоррТекущегоПериода
		|ИЗ
		|	(ВЫБРАТЬ
		|		Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|		Остатки.РазделУчета КАК РазделУчета,
		|		Остатки.ВидЗапасов КАК ВидЗапасов,
		|		Остатки.Организация КАК Организация,
		|		Остатки.Партия КАК Партия,
		|		Остатки.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|		Остатки.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
		|		Остатки.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		|		Остатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		ВТ_СебестоимостьТоваровОстаткиПрошлогоПериода КАК Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры,
		|		СебестоимостьТоваровОбороты.РазделУчета,
		|		СебестоимостьТоваровОбороты.ВидЗапасов,
		|		СебестоимостьТоваровОбороты.Организация,
		|		СебестоимостьТоваровОбороты.Партия,
		|		СебестоимостьТоваровОбороты.АналитикаУчетаПартий,
		|		СебестоимостьТоваровОбороты.АналитикаФинансовогоУчета,
		|		СебестоимостьТоваровОбороты.ВидДеятельностиНДС,
		|		СебестоимостьТоваровОбороты.Количество
		|	ИЗ
		|		ВТ_СебестоимостьТоваровОстаткиПрошлогоПериода КАК СебестоимостьТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК СебестоимостьТоваровОбороты
		|		ПО СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры = СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры 
		|		И СебестоимостьТоваровОбороты.РазделУчета = СебестоимостьТоваровОстатки.РазделУчета 
		|		И СебестоимостьТоваровОбороты.ВидЗапасов = СебестоимостьТоваровОстатки.ВидЗапасов 
		|		И СебестоимостьТоваровОбороты.Организация = СебестоимостьТоваровОстатки.Организация 
		|		И СебестоимостьТоваровОбороты.Партия = СебестоимостьТоваровОстатки.Партия
		|		И СебестоимостьТоваровОбороты.АналитикаУчетаПартий = СебестоимостьТоваровОстатки.АналитикаУчетаПартий 
		|		И СебестоимостьТоваровОбороты.АналитикаФинансовогоУчета = СебестоимостьТоваровОстатки.АналитикаФинансовогоУчета
		|		И СебестоимостьТоваровОбороты.ВидДеятельностиНДС = СебестоимостьТоваровОстатки.ВидДеятельностиНДС
		|		И СебестоимостьТоваровОбороты.СлужебноеВидДвиженияПриход
		|		И СебестоимостьТоваровОбороты.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
		|		И СебестоимостьТоваровОбороты.Количество < 0) КАК ВЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЗ.АналитикаУчетаНоменклатуры,
		|	ВЗ.РазделУчета,
		|	ВЗ.ВидЗапасов,
		|	ВЗ.Организация,
		|	ВЗ.Партия,
		|	ВЗ.АналитикаУчетаПартий,
		|	ВЗ.АналитикаФинансовогоУчета,
		|	ВЗ.ВидДеятельностиНДС
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЗ.КоличествоОстаток) > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Движения.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости) КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасовПриемника КАК ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Движения.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета КАК КорРазделУчета,
		|	Движения.ВидЗапасов КАК КорВидЗапасов,
		|	Движения.Организация КАК КорОрганизация,
		|	ВЫБОР КОГДА Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости)
		|		ТОГДА Движения.КорПартия
		|		ИНАЧЕ Движения.Партия
		|	КОНЕЦ КАК КорПартия,
		|	ВЫБОР КОГДА Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости)
		|		ТОГДА Движения.КорАналитикаУчетаПартий
		|		ИНАЧЕ Движения.АналитикаУчетаПартий
		|	КОНЕЦ КАК КорАналитикаУчетаПартий,
		|
		|	МИНИМУМ(ДД.ПериодПоступления) КАК ПериодПоступления
		|
		|ПОМЕСТИТЬ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовДополненная КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
		|		ПО Движения.Период МЕЖДУ ДД.ПериодПоступления И &КонецПредыдущегоПериода
		// Условия по разделу учета должны быть одинаковые с функией ШаблонТекстаПервичныеПриемникиПоДокументам().
		|		И НЕ Движения.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
		|		И (НЕ Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение) 
		|				ИЛИ Движения.ВидЗапасов.ТипЗапасов В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца), 
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)))
		|		И Движения.Партия = ДД.ПартияПеремещения
		// При учете по средней по товарам в пути и по нефактуровке партия и аналитика учета партий пустые
		|		И (Движения.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			ИЛИ (ДД.ПартияПеремещения = НЕОПРЕДЕЛЕНО
		|				И Движения.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)))
		|		И Движения.Организация = ДД.ОрганизацияПеремещения
		|		И Движения.ВидЗапасов = ДД.ВидЗапасовПеремещения
		// При подборе аналитик номенклатуры склад не учитываем - соединяемся с аналитиками по всем складам.
		|		И Движения.АналитикаУчетаНоменклатуры.Номенклатура = ДД.Номенклатура
		|		И Движения.АналитикаУчетаНоменклатуры.Характеристика = ДД.Характеристика
		|		И (Движения.АналитикаУчетаНоменклатуры.Серия = ДД.Серия
		|			ИЛИ Движения.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|			ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути))
		// Отклонения по разделу учета "Собственные товары в пути (от поставщиков)" должны распределяться только на движения
		// с такой же аналитикой учета номенклатуры.
		|		И НЕ (Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|			И Движения.АналитикаУчетаНоменклатуры <> ДД.АналитикаУчетаНоменклатуры)
		// При отсутствии перемещений (изменения аналитики) доп расходы распределяем только исходную аналитику документа приобретения.
		|		И (ДД.ЕстьПеремещения
		|			ИЛИ ДД.АналитикаУчетаНоменклатуры = Движения.АналитикаУчетаНоменклатуры)
		// Отклонений в стоимости и доп расходы, отраженные по сделке, распределяются на выбытия товаров по этой же сделке,
		// кроме передачи в производство, т.к. в производстве нет учета по сделкам.
		// Для других типов аналитики финансового учета ракспределение с учетом аналитики не поддерживаем, т.к. такая аналитика может менятся при перемещениях между складами.
		|		И (ТИПЗНАЧЕНИЯ(Движения.АналитикаФинансовогоУчета) = ТИП(Справочник.СделкиСКлиентами) И Движения.АналитикаФинансовогоУчета = ДД.АналитикаФинансовогоУчета
		|			ИЛИ Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
		|			ИЛИ ТИПЗНАЧЕНИЯ(Движения.АналитикаФинансовогоУчета) <> ТИП(Справочник.СделкиСКлиентами))
		|ГДЕ
		|	ВЫБОР
		|		КОГДА НЕ &Константа_УчитыватьСебестоимостьТоваровПоНазначениям
		|		  ИЛИ ДД.ПериодПоступления < &Константа_ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям
		|			ТОГДА Движения.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Движения.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости),
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасовПриемника,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	Движения.АналитикаУчетаНоменклатуры,
		|	Движения.РазделУчета,
		|	Движения.ВидЗапасов,
		|	Движения.Организация,
		|	ВЫБОР КОГДА Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости)
		|		ТОГДА Движения.КорПартия
		|		ИНАЧЕ Движения.Партия
		|	КОНЕЦ,
		|	ВЫБОР КОГДА Движения.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СлужебноеИзменениеМетодаОценкиСтоимости)
		|		ТОГДА Движения.КорАналитикаУчетаПартий
		|		ИНАЧЕ Движения.АналитикаУчетаПартий
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|
		|	Остатки.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета КАК КорРазделУчета,
		|	Остатки.ВидЗапасов КАК КорВидЗапасов,
		|	Остатки.Организация КАК КорОрганизация,
		|	Остатки.Партия КАК КорПартия,
		|	Остатки.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|
		|	&КонецПредыдущегоПериода КАК ПериодПоступления
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовДополненная КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СебестоимостьТоваровОстаткиПрошлогоПериодаСУчетомКоррТекущегоПериода КАК Остатки
		|		ПО Остатки.Организация = ДД.ОрганизацияПеремещения
		|		И Остатки.Партия = ДД.ПартияПеремещения
		// При учете по средней по товарам в пути и по неотфактуровке партия и аналитика учета партий пустые
		|		И (Остатки.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|			ИЛИ (ДД.ПартияПеремещения = НЕОПРЕДЕЛЕНО
		|				И Остатки.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)))
		|		И Остатки.ВидЗапасов = ДД.ВидЗапасовПеремещения
		// Условия по разделу учета должны быть одинаковые с функией ШаблонТекстаПервичныеПриемникиПоДокументам().
		|		И НЕ Остатки.РазделУчета В (
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
		|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку))
		// Исключаем остатки товаров, переданных переработчику при переработке 2.4, т.к. такие остатки отражены по партнеру и
		// в бухгалтерских проводках по распределению доп рахсодов не получается заполнить контрагента.
		|		И НЕ (Остатки.РазделУчета  = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
		|			И Остатки.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
		|		И (НЕ Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение) 
		|				ИЛИ Остатки.ВидЗапасов.ТипЗапасов В (
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца), 
		|				ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)))
		// При подборе аналитик номенклатуры склад не учитываем - соединяемся с аналитиками по всем складам.
		|		И Остатки.АналитикаУчетаНоменклатуры.Номенклатура = ДД.Номенклатура
		|		И Остатки.АналитикаУчетаНоменклатуры.Характеристика = ДД.Характеристика
		|		И (Остатки.АналитикаУчетаНоменклатуры.Серия = ДД.Серия
		|			ИЛИ Остатки.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|			ИЛИ ДД.АналитикаУчетаНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
		|			ИЛИ ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути))
		// Отклонения по разделу учета "Собственные товары в пути (от поставщиков)" должны распределяться только на остатки
		// с такой же аналитикой учета номенклатуры.
		|		И НЕ (Остатки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
		|			И Остатки.АналитикаУчетаНоменклатуры <> ДД.АналитикаУчетаНоменклатуры)
		// При отсутствии перемещений (изменения аналитики) доп расходы распределяем только исходную аналитику документа приобретения.
		|		И (ДД.ЕстьПеремещения
		|			ИЛИ ДД.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры)
		|ГДЕ
		|	(ДД.ВидЗапасовПриемника <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
		|		ИЛИ ДД.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|	И ВЫБОР
		|		КОГДА НЕ &Константа_УчитыватьСебестоимостьТоваровПоНазначениям
		|		  ИЛИ ДД.ПериодПоступления < &Константа_ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям
		|			ТОГДА Остатки.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	Остатки.АналитикаУчетаНоменклатуры,
		|	Остатки.РазделУчета,
		|	Остатки.ВидЗапасов,
		|	Остатки.Организация,
		|	Остатки.Партия,
		|	Остатки.АналитикаУчетаПартий
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|ВЫБРАТЬ
		|	Аналитики.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Аналитики.КорРазделУчета КАК РазделУчета,
		|	Аналитики.КорВидЗапасов КАК ВидЗапасов,
		|	Аналитики.КорОрганизация КАК Организация,
		|	Аналитики.КорПартия КАК Партия,
		|	Аналитики.КорАналитикаУчетаПартий КАК АналитикаУчетаПартий,
		|
		|	МИНИМУМ(Аналитики.ПериодПоступления) КАК ПериодПоступления
		|ПОМЕСТИТЬ АналитикиПриемниковПоТоварамПрошлыхПериодов
		|ИЗ
		|	ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК Аналитики
		|
		|СГРУППИРОВАТЬ ПО
		|	Аналитики.КорАналитикаУчетаНоменклатуры,
		|	Аналитики.КорРазделУчета,
		|	Аналитики.КорВидЗапасов,
		|	Аналитики.КорОрганизация,
		|	Аналитики.КорПартия,
		|	Аналитики.КорАналитикаУчетаПартий
		|;
		
		// Описание формирования временной таблицы ПрошлыеВыбытияТоваров.
		// Таблицы ПрошлыеВыбытияТоваров содержит базу распределения дополнительных расходов и отклонений в стоимости,
		// если товары выбыли в прошлом периоде. 
		// Выбытием считается расход из регистра Себестоимость товаров, не связанный с изменением аналитики учета номенклатуры.
		// Не считается выбытием:
		//	- Перемещение товаров между складами, кроме перемещения между филиалами при учета по средней стоимости,
		//		т.к. при учете по средней стоимости нет возможности отследить движения товаров по филиалам
		//	- Изменение назначения товаров
		//	- Передача и возврат материалов в производство (в цеховую кладовую или в подразделение)
		//	- Передача продукции из производства (из цеховой кладовой или тз подразделения)
		//	- Передача на ответ. хранение и возврат с ответ хранения
		//	
		// Исходные данные для прошлых выбытий товаров:
		// Балансовые разделы учета:
		//	- ТоварыНаСкладах - все выбытия, кроме перемещений между аналитиками
		//	- ТоварыПереданныеНаКомиссию - не включаются в базу распределения, 
		//		т.к. пока не поддерживается в регл учете в части формирования бух проводок по отнесению отклонений
		//	- ПроизводственныеЗатраты - все выбытия, кроме перемещений между аналитиками
		//	- ТоварыПереданныеПереработчику - все выбытия, кроме перемещений между аналитиками
		//	- ТоварыВПути - все выбытия
		//	- НезавершенноеПроизводство - не включается в базу распределения, 
		//		т.к. выбытием считается распределение на партии производства
		//	- СобственныеТоварыВПути - не включается в базу распределения, т.к. из этого раздела нет выбытий, 
		//		есть только поступление на склад (перемещение между аналитиками)
		//	- НеотфактурованныеПоставки - не включаются в базу распределения, т.к. из этого раздела нет выбытий
		//	- СобственныеТоварыПереданныеПартнерам - все выбытия, кроме возвратов на склад
		//	- ТоварыПереданныеНаКомиссиюВПути - все выбытия, кроме возвратов на склад
		// Забалансовые разделы учета - не включаются в базу распределения
		//	ТоварыПринятыеНаКомиссию, МатериалыПринятыеВПереработку, ТоварыНаХраненииСПравомПродажи
		//	ТоварыПринятыеНаОтветхранение, ТоварыНаХраненииСПравомПродажиПереданныеПартнерам, ТоварыНаХраненииСПравомПродажиКОформлениюСписания,
		// 	ТоварыПринятыеНаКомиссиюВПути
		//
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности,
		|	СУММА(ДД.Количество) КАК Количество
		|
		|ПОМЕСТИТЬ ПрошлыеВыбытияТоваров
		|ИЗ
		|	АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Аналитики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДД
		|		ПО Аналитики.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Аналитики.РазделУчета = ДД.РазделУчета
		|			И Аналитики.ВидЗапасов = ДД.ВидЗапасов
		|			И Аналитики.Организация = ДД.Организация
		|			И Аналитики.Партия = ДД.Партия
		|			И Аналитики.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И ДД.Период МЕЖДУ Аналитики.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И НЕ ДД.РазделУчета В (&ЗабалансовыеРазделыУчета)
		// Исключаем балансовые разделы учета из которых нет выбытий.
		|	И НЕ ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
		|	И НЕ ДД.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство),
		//++ Устарело_Переработка24
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику),
		//-- Устарело_Переработка24
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
		|	И (НЕ ДД.Регистратор ССЫЛКА Документ.ПеремещениеТоваров 
		|		ИЛИ (ДД.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|				И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами)))
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.КорректировкаНазначенияТоваров
		//++ Локализация
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.КорректировкаВидаДеятельностиНДС
		//-- Локализация
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.ПередачаТоваровХранителю
		|	И НЕ ДД.Регистратор ССЫЛКА Документ.КорректировкаРегистров
		|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|	И ДД.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ДД.Количество) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация КАК Организация,
		|	ДД.Партия КАК Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности,
		|	СУММА(-ДД.Количество) КАК Количество
		|ИЗ
		|	АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Аналитики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДД
		|		ПО Аналитики.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|			И Аналитики.РазделУчета = ДД.РазделУчета
		|			И Аналитики.ВидЗапасов = ДД.ВидЗапасов
		|			И Аналитики.Организация = ДД.Организация
		|			И Аналитики.Партия = ДД.Партия
		|			И Аналитики.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|
		|ГДЕ
		|	&РаспределениеДопРасходовПоВыбывшимТоварам
		|	И ДД.Период МЕЖДУ Аналитики.ПериодПоступления И &КонецПредыдущегоПериода
		|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ДД.РазделУчета В (
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
		|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
		|	И ДД.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
		//++ Устарело_Переработка24
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
		//-- Устарело_Переработка24
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов))
		|	И ДД.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.Регистратор,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ВЫБОР
		|		КОГДА ДД.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА ДД.Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.СтруктураПредприятия
		|			ТОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
		|			ТОГДА ВЫРАЗИТЬ(ДД.КорАналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Партнеры
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.Склады).Подразделение
		|		КОГДА ДД.КорАналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ВЫРАЗИТЬ(ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Подразделение
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	КОНЕЦ,
		|	ДД.СтатьяРасходовСписания,
		|	ДД.АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ДД.Количество) = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры,
		|	Организация,
		|	Партия
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|
		|	ДД.Подразделение,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ КАК СтатьяРасходовСписанияРегл,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ КАК СтатьяРасходовСписанияУпр,
		|	(ВЫБОР
		|		КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		 ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|		 ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|		ИНАЧЕ ДД.АналитикаРасходов
		|	КОНЕЦ) КАК АналитикаРасходов,
		|	ДД.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	МАКСИМУМ(ДД.ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи,
		|	ДД.НастройкаХозяйственнойОперации,
		|
		|	ЕСТЬNULL(Выручка.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
		|	ЕСТЬNULL(Выручка.ЗаказКлиента, НЕОПРЕДЕЛЕНО) КАК ЗаказКлиента,
		|	ЕСТЬNULL(Выручка.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
		|	ЕСТЬNULL(Выручка.Склад, НЕОПРЕДЕЛЕНО) КАК Склад,
		|	ЕСТЬNULL(Выручка.Соглашение, НЕОПРЕДЕЛЕНО) КАК Соглашение,
		|	ЕСТЬNULL(Выручка.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
		|	ЕСТЬNULL(Выручка.ТипЗапасов, НЕОПРЕДЕЛЕНО) КАК ТипЗапасов,
		|	ЕСТЬNULL(Выручка.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУНоменклатуры,
		|	ЕСТЬNULL(Выручка.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
		|	ЛОЖЬ КАК СписаниеНаРасходыМалоценныхТМЦ,
		|
		|	СУММА(ЕСТЬNULL(Выручка.Количество, ДД.Количество)) КАК Количество
		|
		|ПОМЕСТИТЬ ПрошлыеВыбытияТоваровДетальные
		|ИЗ
		|	ПрошлыеВыбытияТоваров КАК ДД
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выручка
		|		ПО ДД.Регистратор = Выручка.Регистратор
		|		И ДД.АналитикаУчетаНоменклатуры = Выручка.АналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = Выручка.РазделУчета
		|		И ДД.ВидЗапасов = Выручка.ВидЗапасов
		|		И ДД.Партия = Выручка.Партия
		|		И ДД.АналитикаУчетаПартий = Выручка.АналитикаУчетаПартий
		|		И ДД.Организация = Выручка.АналитикаУчетаПоПартнерам.Организация
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборАналитикаПоПартнерам КАК Отбор
		|		ПО Выручка.АналитикаУчетаПоПартнерам = Отбор.КлючАналитики
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|		ПО ДД.СтатьяРасходовСписания = СтатьиРасходов.Ссылка
		|ГДЕ
		|	Выручка.Регистратор ЕСТЬ NULL
		|	ИЛИ НЕ Отбор.КлючАналитики ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	ДД.КорВидДеятельностиНДС,
		|	ДД.Подразделение,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ,
		|	ВЫБОР КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|		И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ВыбытияТоваровВПрошлыхПериодах)
		|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПроизводственныеРасходыПрошлыхПериодов)
		|		ИНАЧЕ ДД.СтатьяРасходовСписания
		|	КОНЕЦ,
		|	(ВЫБОР
		|		КОГДА Выручка.Регистратор ЕСТЬ NULL И (СтатьиРасходов.Ссылка ЕСТЬ NULL
		|		 ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
		|		 ИЛИ СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров))
		|			ТОГДА ДД.АналитикаУчетаНоменклатуры.Номенклатура
		|		ИНАЧЕ ДД.АналитикаРасходов
		|	КОНЕЦ), // АналитикаРасходов
		|	ДД.КорНаправлениеДеятельности,
		|	ДД.ХозяйственнаяОперация,
		|	ДД.НастройкаХозяйственнойОперации,
		|	ЕСТЬNULL(Выручка.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ЗаказКлиента, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Менеджер, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Склад, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Соглашение, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.Договор, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ТипЗапасов, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(Выручка.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО)
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(Выручка.Количество, ДД.Количество)) <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписанияРегл,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовСписанияУпр,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация,
		|	НЕОПРЕДЕЛЕНО КАК ИдентификаторФинЗаписи,
		|	НЕОПРЕДЕЛЕНО КАК НастройкаХозяйственнойОперации,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		|	(ВЫБОР
		|		КОГДА НЕ Списания.Регистратор ЕСТЬ NULL ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК СписаниеНаРасходыМалоценныхТМЦ,
		|
		|	ДД.КоличествоОстаток КАК Количество
		|ИЗ
		|	ВТ_СебестоимостьТоваровОстаткиПрошлогоПериода КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Т
		|		ПО ДД.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = Т.РазделУчета
		|		И ДД.ВидЗапасов = Т.ВидЗапасов
		|		И ДД.Организация = Т.Организация
		|		И ДД.Партия = Т.Партия
		|		И ДД.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Списания
		|		ПО Списания.Период = &КонецПредыдущегоПериода
		|		И Списания.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Списания.РазделУчета = ДД.РазделУчета
		|		И Списания.ВидЗапасов = ДД.ВидЗапасов
		|		И Списания.Организация = ДД.Организация
		|		И Списания.Партия = ДД.Партия
		|		И Списания.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|		И Списания.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыМалоценныхТМЦВМесяцеПриобретения)
		|ГДЕ
		|	ДД.КоличествоОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоВыбытие,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.РазделУчета,
		|	ДД.ВидЗапасов,
		|	ДД.Организация,
		|	ДД.Партия,
		|	ДД.АналитикаУчетаПартий,
		|	ДД.АналитикаФинансовогоУчета,
		|	ДД.ВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|
		|	Списания.Подразделение КАК Подразделение,
		|	Списания.СтатьяРасходовСписания КАК СтатьяРасходовСписанияРегл,
		|	Списания.СтатьяРасходовСписания КАК СтатьяРасходовСписанияУпр,
		|	Списания.СтатьяРасходовСписания КАК АналитикаРасходов,
		|	Списания.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
		|	Списания.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Списания.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
		|	Списания.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
		|
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		|	ИСТИНА КАК СписаниеНаРасходыМалоценныхТМЦ,
		|
		|	ДД.КоличествоОстаток КАК Количество
		|ИЗ
		|	ВТ_СебестоимостьТоваровОстаткиПрошлогоПериода КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ АналитикиПриемниковПоТоварамПрошлыхПериодов КАК Т
		|		ПО ДД.АналитикаУчетаНоменклатуры = Т.АналитикаУчетаНоменклатуры
		|		И ДД.РазделУчета = Т.РазделУчета
		|		И ДД.ВидЗапасов = Т.ВидЗапасов
		|		И ДД.Организация = Т.Организация
		|		И ДД.Партия = Т.Партия
		|		И ДД.АналитикаУчетаПартий = Т.АналитикаУчетаПартий
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Списания
		|		ПО Списания.Период = &КонецПредыдущегоПериода
		|		И Списания.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Списания.РазделУчета = ДД.РазделУчета
		|		И Списания.ВидЗапасов = ДД.ВидЗапасов
		|		И Списания.Организация = ДД.Организация
		|		И Списания.Партия = ДД.Партия
		|		И Списания.АналитикаУчетаПартий = ДД.АналитикаУчетаПартий
		|		И Списания.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыМалоценныхТМЦВМесяцеПриобретения)
		|ГДЕ
		|	ДД.КоличествоОстаток > 0
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Регистратор,
		|	Т.АналитикаУчетаНоменклатуры,
		|	Т.РазделУчета,
		|	Т.ВидЗапасов,
		|	Т.Организация,
		|	Т.Партия,
		|	Т.АналитикаУчетаПартий,
		|	Т.АналитикаФинансовогоУчета,
		|	Т.ВидДеятельностиНДС
		|ПОМЕСТИТЬ ПриемникиПоТоварамПрошлыхПериодовСвернутая
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|ВЫБРАТЬ
		|	Источник.Регистратор,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС,
		|
		|	СУММА(ВыбытиеДетально.Количество) КАК Количество
		|
		|ПОМЕСТИТЬ ВыбытиеСводно
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодовСвернутая КАК Источник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК ВозможныеАналитики
		|		ПО Источник.АналитикаУчетаНоменклатуры   = ВозможныеАналитики.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВозможныеАналитики.РазделУчета
		|			И Источник.Организация               = ВозможныеАналитики.Организация
		|			И Источник.Партия                    = ВозможныеАналитики.Партия
		|			И Источник.АналитикаУчетаПартий      = ВозможныеАналитики.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВозможныеАналитики.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВозможныеАналитики.ВидДеятельностиНДС
		|			И Источник.ВидЗапасов                = ВозможныеАналитики.ВидЗапасов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеВыбытияТоваровДетальные КАК ВыбытиеДетально
		|		ПО ВозможныеАналитики.КорАналитикаУчетаНоменклатуры = ВыбытиеДетально.АналитикаУчетаНоменклатуры
		|			И ВозможныеАналитики.КорРазделУчета = ВыбытиеДетально.РазделУчета
		|			И ВозможныеАналитики.КорВидЗапасов = ВыбытиеДетально.ВидЗапасов
		|			И ВозможныеАналитики.КорОрганизация = ВыбытиеДетально.Организация
		|			И ВозможныеАналитики.КорПартия = ВыбытиеДетально.Партия
		|			И ВозможныеАналитики.КорАналитикаУчетаПартий = ВыбытиеДетально.АналитикаУчетаПартий
		|			И ВозможныеАналитики.ЭтоВыбытие = ВыбытиеДетально.ЭтоВыбытие
		|			И (ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ И НЕ ВыбытиеДетально.ЭтоВыбытие
		|				ИЛИ НЕ ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Источник.Регистратор,
		|	Источник.АналитикаУчетаНоменклатуры,
		|	Источник.РазделУчета,
		|	Источник.ВидЗапасов,
		|	Источник.Организация,
		|	Источник.Партия,
		|	Источник.АналитикаУчетаПартий,
		|	Источник.АналитикаФинансовогоУчета,
		|	Источник.ВидДеятельностиНДС
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ВыбытиеДетально.Количество) = 0
		|;
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ) КАК ЭтоВыбытие,
		|
		|	Источник.Регистратор,
		|	Источник.Период,
		|	Источник.ТипЗаписи,
		// Аналитика распределения отклонения в стоимости, распределения по выбывшим товарам.
		// Для дополнительных расходов не применимо, т.к. источником дополнительных расходов являются расходы.
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаУчетаНоменклатуры
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.РазделУчета
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РазделУчета,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.ВидЗапасов
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидЗапасов,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.Организация
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Организация,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.Партия
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Партия,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаУчетаПартий
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаУчетаПартий,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.АналитикаФинансовогоУчета
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК АналитикаФинансовогоУчета,
		|	ВЫБОР
		|		КОГДА Реквизиты.Ссылка ЕСТЬ NULL
		|			ТОГДА Источник.ВидДеятельностиНДС
		|		ИНАЧЕ
		|			НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидДеятельностиНДС,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) КАК КорАналитикаУчетаНоменклатуры,
		|	ЕСТЬNULL(ВыбытиеДетально.РазделУчета, НЕОПРЕДЕЛЕНО) КАК КорРазделУчета,
		|	ЕСТЬNULL(ВыбытиеДетально.ВидЗапасов, НЕОПРЕДЕЛЕНО) КАК КорВидЗапасов,
		|	ЕСТЬNULL(ВыбытиеДетально.Организация, НЕОПРЕДЕЛЕНО) КАК КорОрганизация,
		|	ЕСТЬNULL(ВыбытиеДетально.Партия, НЕОПРЕДЕЛЕНО) КАК КорПартия,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаПартий, НЕОПРЕДЕЛЕНО) КАК КорАналитикаУчетаПартий,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК КорАналитикаФинансовогоУчета,
		|	ЕСТЬNULL(ВыбытиеДетально.ВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК КорВидДеятельностиНДС,
		|	ЕСТЬNULL(ВыбытиеДетально.КорВидДеятельностиНДС, НЕОПРЕДЕЛЕНО) КАК ВидДеятельностиНДСВыбытия,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
		|	ЕСТЬNULL(ВыбытиеДетально.СтатьяРасходовСписанияРегл, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходовСписанияРегл,
		|	ЕСТЬNULL(ВыбытиеДетально.СтатьяРасходовСписанияУпр, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходовСписанияУпр,
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
		|	ЕСТЬNULL(ВыбытиеДетально.КорНаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК КорНаправлениеДеятельности,
		|	ЕСТЬNULL(ВыбытиеДетально.ХозяйственнаяОперация, НЕОПРЕДЕЛЕНО) КАК ХозяйственнаяОперация,
		|	ЕСТЬNULL(ВыбытиеДетально.ИдентификаторФинЗаписи, НЕОПРЕДЕЛЕНО) КАК ИдентификаторФинЗаписи,
		|	ЕСТЬNULL(ВыбытиеДетально.НастройкаХозяйственнойОперации, НЕОПРЕДЕЛЕНО) КАК НастройкаХозяйственнойОперации,
		|
		|	ЕСТЬNULL(ВыбытиеДетально.АналитикаУчетаПоПартнерам, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаПоПартнерам,
		|	ЕСТЬNULL(ВыбытиеДетально.ЗаказКлиента, НЕОПРЕДЕЛЕНО) КАК ЗаказКлиента,
		|	ЕСТЬNULL(ВыбытиеДетально.Менеджер, НЕОПРЕДЕЛЕНО) КАК Менеджер,
		|	ЕСТЬNULL(ВыбытиеДетально.Склад, НЕОПРЕДЕЛЕНО) КАК Склад,
		|	ЕСТЬNULL(ВыбытиеДетально.Соглашение, НЕОПРЕДЕЛЕНО) КАК Соглашение,
		|	ЕСТЬNULL(ВыбытиеДетально.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
		|	ЕСТЬNULL(ВыбытиеДетально.ТипЗапасов, НЕОПРЕДЕЛЕНО) КАК ТипЗапасов,
		|	ЕСТЬNULL(ВыбытиеДетально.ИсточникГФУНоменклатуры, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУНоменклатуры,
		|	ЕСТЬNULL(ВыбытиеДетально.ИсточникГФУРасчетов, НЕОПРЕДЕЛЕНО) КАК ИсточникГФУРасчетов,
		|
		|	Источник.СтоимостьКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК СтоимостьСНДС,
		|	Источник.СтоимостьБезНДСКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК СтоимостьБезНДС,
		// Для малоценных ТМЦ стоимость регл и упр списываем на расходы.
		|	Источник.СтоимостьРеглКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК СтоимостьРегл,
		|	Источник.СтоимостьУпрКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК СтоимостьУпр,
		|	Источник.КоличествоКРаспределению
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК Количество,
		|	Источник.ДопРасходыСНДСКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК ДопРасходыСНДС,
		|	Источник.ДопРасходыБезНДСКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК ДопРасходыБезНДС,
		|	Источник.ДопРасходыРеглНДСКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК ДопРасходыРегл,
		|	Источник.ДопРасходыУпрНДСКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК ДопРасходыУпр,
		|	Источник.НДСРеглКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК НДСРегл,
		|	Источник.НДСУпрКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК НДСУпр,
		|	Источник.ПостояннаяРазницаКРаспределению
		|	 * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КОНЕЦ КАК ПостояннаяРазница,
		|	 (ВЫБОР
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА -(Источник.СтоимостьРеглКРаспределению + Источник.ДопРасходыРеглНДСКРаспределению)
		|		КОГДА ЕСТЬNULL(ВыбытиеДетально.СписаниеНаРасходыМалоценныхТМЦ, ЛОЖЬ) И НЕ ЕСТЬNULL(ВыбытиеДетально.ЭтоВыбытие, ЛОЖЬ)
		|			ТОГДА Источник.СтоимостьРеглКРаспределению + Источник.ДопРасходыРеглНДСКРаспределению
		|		ИНАЧЕ Источник.ВременнаяРазницаКРаспределению КОНЕЦ)
		|		* ВЫРАЗИТЬ(ЕСТЬNULL(ВыбытиеДетально.Количество, 0) / ВыбылоСводно.Количество КАК ЧИСЛО (28, 10)) КАК ВременнаяРазница
		|	
		|ПОМЕСТИТЬ ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов
		|ИЗ
		|	ПриемникиПоТоварамПрошлыхПериодов КАК Источник
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбытиеСводно КАК ВыбылоСводно
		|		ПО Источник.Регистратор                  = ВыбылоСводно.Регистратор
		|			И Источник.АналитикаУчетаНоменклатуры   = ВыбылоСводно.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВыбылоСводно.РазделУчета
		|			И Источник.ВидЗапасов                = ВыбылоСводно.ВидЗапасов
		|			И Источник.Организация               = ВыбылоСводно.Организация
		|			И Источник.Партия                    = ВыбылоСводно.Партия
		|			И Источник.АналитикаУчетаПартий      = ВыбылоСводно.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВыбылоСводно.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВыбылоСводно.ВидДеятельностиНДС
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВозможныеАналитикиПриемниковПоТоварамПрошлыхПериодов КАК ВозможныеАналитики
		|		ПО Источник.АналитикаУчетаНоменклатуры   = ВозможныеАналитики.АналитикаУчетаНоменклатуры
		|			И Источник.РазделУчета               = ВозможныеАналитики.РазделУчета
		|			И Источник.Организация               = ВозможныеАналитики.Организация
		|			И Источник.Партия                    = ВозможныеАналитики.Партия
		|			И Источник.АналитикаУчетаПартий      = ВозможныеАналитики.АналитикаУчетаПартий
		|			И Источник.АналитикаФинансовогоУчета = ВозможныеАналитики.АналитикаФинансовогоУчета
		|			И Источник.ВидДеятельностиНДС        = ВозможныеАналитики.ВидДеятельностиНДС
		|			И Источник.ВидЗапасов                = ВозможныеАналитики.ВидЗапасов
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрошлыеВыбытияТоваровДетальные КАК ВыбытиеДетально
		|		ПО ВозможныеАналитики.КорАналитикаУчетаНоменклатуры = ВыбытиеДетально.АналитикаУчетаНоменклатуры
		|			И ВозможныеАналитики.КорРазделУчета = ВыбытиеДетально.РазделУчета
		|			И ВозможныеАналитики.КорВидЗапасов = ВыбытиеДетально.ВидЗапасов
		|			И ВозможныеАналитики.КорОрганизация = ВыбытиеДетально.Организация
		|			И ВозможныеАналитики.КорПартия = ВыбытиеДетально.Партия
		|			И ВозможныеАналитики.КорАналитикаУчетаПартий = ВыбытиеДетально.АналитикаУчетаПартий
		|			И ВозможныеАналитики.ЭтоВыбытие = ВыбытиеДетально.ЭтоВыбытие
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
		|		ПО Источник.Регистратор = Реквизиты.Ссылка";
	
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ТекстДолиДополнительныхРасходов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_1"" КАК ЗапросИсточник,
		|	Регистраторы.Ссылка КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	ПриемникиПоТоварам.РазделУчета КАК КорРазделУчета,
		|	ПриемникиПоТоварам.АналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	ПриемникиПоТоварам.ВидЗапасов КАК КорВидЗапасов,
		|	ПриемникиПоТоварам.Организация КАК КорОрганизация,
		|	ПриемникиПоТоварам.Партия КАК КорПартия,
		|	ПриемникиПоТоварам.АналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	ПриемникиПоТоварам.АналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	ПриемникиПоТоварам.ВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДСВыбытия,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость),
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК КорСтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК КорПодразделение,
		|	НЕОПРЕДЕЛЕНО КАК КорНаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	ПриемникиПоТоварам.ВидЗапасов КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	ПриемникиПоТоварам.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.Стоимость <> 0
		|					ТОГДА ПриемникиПоТоварам.Стоимость
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.Стоимость, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимости,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьБезНДС <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьБезНДС
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьБезНДС, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиБезНДС,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьРегл <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьРегл
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьРегл, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиРегл,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|		 ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА (ВЫБОР 
		|				КОГДА ПриемникиПоТоварам.СтоимостьУпр <> 0
		|					ТОГДА ПриемникиПоТоварам.СтоимостьУпр
		|				ИНАЧЕ ПриемникиПоТоварам.Количество * ЕСТЬNULL(Цены.СтоимостьУпр, 0) КОНЕЦ)
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * ПриемникиПоТоварам.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * ПриемникиПоТоварам.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ДоляСтоимостиУпр
		|ИЗ
		|	Регистраторы КАК Регистраторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПриемникиПоТоварам КАК ПриемникиПоТоварам
		|		ПО Регистраторы.Ссылка = ПриемникиПоТоварам.Регистратор
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПартийТоваров КАК Цены
		|		ПО Цены.Организация = ПриемникиПоТоварам.Организация
		|			И Цены.Период = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
		|			И Цены.АналитикаУчетаНоменклатуры = ПриемникиПоТоварам.АналитикаУчетаНоменклатуры
		|			И Цены.ВидЗапасов = ПриемникиПоТоварам.ВидЗапасов
		|			И Цены.РазделУчета = ПриемникиПоТоварам.РазделУчета
		|			И Цены.Партия = ПриемникиПоТоварам.Партия
		|			И Цены.АналитикаУчетаПартий = ПриемникиПоТоварам.АналитикаУчетаПартий
		|			И Цены.АналитикаФинансовогоУчета = ПриемникиПоТоварам.АналитикаФинансовогоУчета
		|			И Цены.ВидДеятельностиНДС = ПриемникиПоТоварам.ВидДеятельностиНДС
		|			
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = ПриемникиПоТоварам.АналитикаУчетаНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ ПриемникиПоТоварам.ЭтоПартияПрошлогоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_2"" КАК ЗапросИсточник,
		|	Показатели.Регистратор КАК Регистратор,
		// Приемник СебестоимостьТоваров
		|	Показатели.КорРазделУчета КАК КорРазделУчета,
		|	Показатели.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|	Показатели.КорВидЗапасов КАК КорВидЗапасов,
		|	Показатели.КорОрганизация КАК КорОрганизация,
		|	Показатели.КорПартия КАК КорПартия,
		|	Показатели.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
		|	Показатели.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
		|	Показатели.КорВидДеятельностиНДС КАК КорВидДеятельностиНДС,
		|	Показатели.ВидДеятельностиНДСВыбытия КАК ВидДеятельностиНДСВыбытия,
		|	(ВЫБОР
		|		КОГДА Показатели.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|		 ИЛИ Показатели.ХозяйственнаяОперация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость)
		|		ИНАЧЕ Показатели.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
		|	(ВЫБОР
		|		КОГДА Показатели.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
		|		 ИЛИ Показатели.ХозяйственнаяОперация = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.РаспределениеПоВыбывшимТоварам) КОНЕЦ) КАК ТипЗаписи,
		// Приемник Прочие расходы/Прочие активы
		|	Показатели.СтатьяРасходовСписанияРегл КАК СтатьяРасходов,
		|	Показатели.АналитикаРасходов,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
		|	Показатели.Подразделение,
		|	Показатели.КорНаправлениеДеятельности КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	Показатели.АналитикаУчетаПоПартнерам,
		|	Показатели.ЗаказКлиента,
		|	Показатели.Менеджер,
		|	Показатели.Склад,
		|	Показатели.Соглашение,
		|	Показатели.Договор,
		|	Показатели.ТипЗапасов,
		|	Показатели.ИсточникГФУНоменклатуры,
		|	Показатели.ИсточникГФУРасчетов,
		// Показатели приемника
		|	Показатели.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьСНДС
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьБезНДС
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьРегл
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.СебестоимостьТоваров)
		|			ИЛИ Регистраторы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|			ТОГДА Показатели.СтоимостьУпр
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.КоличествоТоваров)
		|			ТОГДА Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ОбъемТоваров)
		|			ТОГДА &Объем * Показатели.Количество
		|		КОГДА Регистраторы.БазаРаспределенияПоПартиям = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВесТоваров)
		|			ТОГДА &Вес * Показатели.Количество
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ
		|ИЗ
		|	ПоказателиБазыРаспределенияПриемниковПрошлыхПериодов КАК Показатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
		|		ПО Показатели.Регистратор = Регистраторы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
		|		ПО СН.Ссылка = Показатели.КорАналитикаУчетаНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_3"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		// Приемник Себестоимость товаров
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ИсточникБазы.Организация КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДСВыбытия,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	ИсточникБазы.СтатьяРасходов                                         КАК СтатьяРасходов,
		|	ИсточникБазы.АналитикаРасходов                                      КАК АналитикаРасходов,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка) КАК СтатьяАктивовПассивов,
		|	НЕОПРЕДЕЛЕНО                                                        КАК АналитикаАктивовПассивов,
		|	ИсточникБазы.Подразделение                                          КАК Подразделение,
		|	ИсточникБазы.НаправлениеДеятельности                                КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	0 КАК Количество,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.СуммаБезНДС,
		|	ИсточникБазы.СуммаРегл,
		|	ИсточникБазы.СуммаУпр
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК ИсточникБазы
		|		ПО ДД.АналитикаРасходов = ИсточникБазы.Регистратор
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период <= &КонецПериода
		|			И НЕ ИсточникБазы.РасчетСебестоимости
		|ГДЕ
		|	ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ТекстДолиДополнительныхРасходов_4"" КАК ЗапросИсточник,
		|	ДД.Ссылка КАК Регистратор,
		// Приемник Себестоимость товаров
		|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
		|	ИсточникБазы.Организация КАК КорОрганизация,
		|	НЕОПРЕДЕЛЕНО КАК КорПартия,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаПартий,
		|	НЕОПРЕДЕЛЕНО КАК КорАналитикаФинансовогоУчета,
		|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
		|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДСВыбытия,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачислениеНДСНалоговымАгентом) КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходы),
		// Приемник Прочие расходы/Прочие активы
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
		|	НЕОПРЕДЕЛЕНО                                                 КАК АналитикаРасходов,
		|	ИсточникБазы.Статья                                          КАК СтатьяАктивовПассивов,
		|	ИсточникБазы.Аналитика                                       КАК АналитикаАктивовПассивов,
		|	ИсточникБазы.Подразделение                                   КАК Подразделение,
		|	ИсточникБазы.НаправлениеДеятельности                         КАК НаправлениеДеятельности,
		//Приемник Выручка и себестоимость
		|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПоПартнерам,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
		|	НЕОПРЕДЕЛЕНО КАК Менеджер,
		|	НЕОПРЕДЕЛЕНО КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Соглашение,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникГФУРасчетов,
		// Показатели приемника
		|	0 КАК Количество,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма,
		|	ИсточникБазы.Сумма
		|ИЗ
		|	Регистраторы КАК ДД
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыПассивы КАК ИсточникБазы
		|		ПО ДД.АналитикаРасходов = ИсточникБазы.Регистратор
		|			И ИсточникБазы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ИсточникБазы.Период <= &КонецПериода
		|			И ИсточникБазы.ВидИсточника = ЗНАЧЕНИЕ(Перечисление.ВидыИсточниковДвижений.ПустаяСсылка)
		|			И НЕ ИсточникБазы.РасчетСебестоимости
		|ГДЕ
		|	ДД.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.НДСНалоговогоАгента)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#Область ПроцедурыЭтапа18_РаспределениеНаПродажи

#Область Описание_РаспределениеНаПродажи

// Этап распределения расходов на продажи выполнят распределение фиксированной суммы расходов на себестоимость пролаж -
// ресурсы "Расходы на продажу" в регитсре накопления "Выручка и себестоимость продаж".

// Полный текст запрос формируется в функции ТекстЗапросаРаспределениеРасходовНаПродажи().
// Исходными данными для распределения являются остатки регистра "Прочие расходы" - временная таблица ВТКэшРасчетныеОстаткиПрочиеРасходы.
// Для отбора базы распределения формиются следующие временные таблицы:
// - ВтОтборПродажПоПартнеру - расходы с типом аналитики "Партнер"
// - ВтОтборПродажПоЗаказу - расходы с типами аналитики документы "Акт выполненных работ", "Реализация товаров и услуг",
// 		"Отчет давальцу (2.5)" и "Заказ клиента" в статусе "На согласовании" если заказ используется как счет.
// - ВтОтборПродажПоРегистратору - расходы с типами аналитики документы "Реализация товаров и услуг" для реализаций по заказу и
// 		"Отчет давальцу (2.5)".
// - ВтОтборПродажПоРеализациямПрошлыхПериодов - расходы с типами аналитики документы "Акт выполненных работ",
// 		"Реализация товаров и услуг" и "Заказ клиента" в статусе "Не согласован", если дата документа относится к прошлому периоду.
// - ВтОтборПродажПоСделке - расходы с типом аналитики "Сделки с клиентами"
// - ВтНезаполненныеАналитикиРасходов - расходы с незаполненной аналитикой
//
// База распределения формируется в функции ТекстЗапросаБазаРаспределенияРасходовНаПродажи().
// Данные текущего периода выбираются из временной таблицы ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж
// с отбором по временным таблицам ВтОтборПродажПоПартнеру, ВтОтборПродажПоЗаказу, ВтОтборПродажПоСделке, ВтНезаполненныеАналитикиРасходов
// Данные прошлого периода выбираются из движений регистра накопления "Выручка и себестоимость продаж"
// с отбором по временной таблице ВтОтборПродажПоРеализациямПрошлыхПериодов.
//
// База распределения сохраняется в следующих временных табоицах:
// - ВтБазаРаспределенияПродажИсхДанные - детальные записи базы распределения
// - ВтБазаРаспределенияПродажДанные - сгруппированные записи базы распределения
// - ВтБазаРаспределенияПродажСуммы - итоговые суммы базы распределения для каждой аналитики расходов, организации и направления деятельности
// - ВтБазаРаспределенияНаПродажи - окончательная таблица базы распределения с долями распределения
//		формируется по данным таблиц ВтБазаРаспределенияПродажДанные и ВтБазаРаспределенияПродажСуммы.
//		Доли для распределения рассчитывается по формулам:
//		- Доля выручки = Выручка / Итоговая выручка - отдельно для упр и регл учета
//		- Доля количество = Количество / Итоговое количество
//		- Доля себестоимость = Себестоимость / Итоговая себестоимость - отдельно для упр и регл учета
//		- Доля вес = Вес / Итоговый вес
//		- Доля объекм = Объекм / Итоговый объем
//
// База распределения для расходов по заказам клиента формируется в функции ТекстЗапросаБазаРаспределенияРасходовНаЗаказы().
// Для отбора базы распределения формируется временная таблица ВтОтборПоЗаказуКлиента.
// База распределения сохраняется в следующих временных табоицах:
// - ВтЗаказыПланФактИсходныеДанные - детальные плановые и фактические данные по заказам клиентов. Формируется по движениям 
//		регистра накопления "Заказы клиентов".
// - ВтПланФактПоЗаказу - сгруппированные по заказам плановые и фактические данные
// - ВтДолиПоЗаказу - доли распределения. Формируются по данным временных таблиц ВтЗаказыПланФактИсходныеДанные и ВтПланФактПоЗаказу
//		по следующим формулам:
//		- Доля количество = Количество факт / Количество план
//		- Доля вес = Вес факт / Вес план
//		- Доля объем = Объем факт / Объем план
//		- Доля сумма = Сумма факт / Сумма план
// - ВтБазаРаспределенияПоЗаказуКлиента - окончательная база распределения с долями распределения
//		Доли для распределения рассчитывается по формулам:
//		- Доля выручки = (Выручка / Сумма по заказу) * Доля сумма
//		- Доля количество = (Количество / Количество по заказу) * Доля количество
//		- Доля вес = (Количество / Количество по заказу) * Доля вес
//		- Доля объем = (Количество / Количество по заказу) * Доля объем
//
// Исходные данные для распределения формируются в функции ТекстЗапросаПодготовкаДанныхРаспределенияРасходовНаПродажи().
// Включают в себя следующие временные таблицы:
// - СтатьиКРаспределениюНаПродажу - статьи расходов с вариантом распределения "На себестоимость продаж"
// - ОстаткиРасходовПоЗаказам - расходы, с аналитикой "Заказ клиента" с отбором по статьям расходов из временной 
//		таблицы СтатьиКРаспределениюНаПродажу.
// - РасходыКРаспределениюНаПродажу - суммы расходов к распределению. 
//	Формируются по данным следующих источников:
//	- Остатки расходов из временной таблицы ВТКэшРасчетныеОстаткиПрочиеРасходы - остатки расходов на конец периода
//	- Движения "Расход" из временной таблицы ВТКэшРасчетныеОборотыПрочиеРасходы - прочие списания расходов
//	- Движения "Приход" из временной таблицы ВТКэшРасчетныеОборотыПрочиеРасходы с признаком Сторно - сторнирование расходов
//	- Движения "Расход" из регистра "Прочие расходы" прошлых периодов - списания и распределения расходов в прошлых периодах
//	- Движения "Приход" в регистр "Прочие расходы" прошдых периодов - сторнирование расходов в прошлых периодах
//
// Распределение расходов по заказам клиентов выполняется в функции ТекстЗапросаВыборкаРаспределениеРасходовНаЗаказКлиента().
// Данные для распределения берутся из таблицы РасходыКРаспределениюНаПродажу.
// База распределения берется из таблицы ВтБазаРаспределенияПоЗаказуКлиента.
// Результат сохраняется во временной таблице РаспределениеНаЗаказКлиента.
//
// Распределение расходов по всем другим аналитикам выполняется в функции ТекстЗапросаВыборкаРаспределениеРасходовНаПродажи().
// Данные для распределения берутся из таблицы РасходыКРаспределениюНаПродажу.
// База распределения берется из таблицы ВтБазаРаспределенияНаПродажи.
// Результат распределения дополняется результатам распределения расходов по заказам из таблицы РаспределениеНаЗаказКлиента.
//
// Результат распределения сохраняется во временную таблицу ВтРаспределениеРасходовНаПродажи.

#КонецОбласти

Функция ТаблицаДляРаспределенияРасходовНаПродажу(ПараметрыРасчета)
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ТаблицаДляРаспределенияПартий(ПараметрыРасчета,
		ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи());
	
КонецФункции

// Выборка данных

Процедура ПолучитьДанныеДляРаспределенияРасходовНаПродажу(ПараметрыРасчета)
	
	ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Вставить("РаспределятьРасходыНаПродажуНаВсеРеализацииЗаказа",
		ПараметрыРасчета.РасширенныеНастройкиРасчетаСебестоимости.РаспределятьРасходыНаПродажуНаВсеРеализацииЗаказа);
		
	РасчетСебестоимостиПрикладныеАлгоритмы.ПолучитьДанныеЭтапаРасчета(
		ПараметрыРасчета,
		ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета));
	
КонецПроцедуры

Функция ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета) Экспорт
	
	Возврат ТекстЗапросаБазаРаспределенияРасходовНаПродажи()
		+ ТекстЗапросаПодготовкаДанныхРаспределенияРасходовНаПродажи()
		+ ТекстЗапросаБазаРаспределенияРасходовНаЗаказы()
		+ ТекстЗапросаВыборкаРаспределениеРасходовНаЗаказКлиента()
		+ ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи()
		+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстЗапросаВыборкаРаспределениеРасходовНаПродажи()
	
КонецФункции

Функция ТекстЗапросаБазаРаспределенияРасходовНаПродажи()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоПартнеру
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.АналитикаРасходов ССЫЛКА Справочник.Партнеры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоЗаказу
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И (ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.АктВыполненныхРабот
	|	ИЛИ ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.РеализацияТоваровУслуг)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Заказы клиента, используемые как счет, будут распределяться по фактическим данным.
	// У таких заказов нет движений по регистру "Заказы клиентов".
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказ
	|		ПО Заказ.Ссылка = ПрочиеРасходы.АналитикаРасходов
	|		И Заказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоРегистратору
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И (ПрочиеРасходы.АналитикаРасходов ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ВЫРАЗИТЬ(ПрочиеРасходы.АналитикаРасходов КАК Документ.РеализацияТоваровУслуг).РеализацияПоЗаказам
	|	)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоРеализациямПрошлыхПериодов
	|ИЗ
	|	ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов ССЫЛКА Документ.АктВыполненныхРабот
	|	И ВЫРАЗИТЬ(Отбор.АналитикаРасходов КАК Документ.АктВыполненныхРабот).Дата < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ВЫРАЗИТЬ(Отбор.АналитикаРасходов КАК Документ.РеализацияТоваровУслуг).Дата < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
	|	И ВЫРАЗИТЬ(Отбор.АналитикаРасходов КАК Документ.ЗаказКлиента).Дата < &НачалоПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
	|	ПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПродажПоСделке
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.АналитикаРасходов ССЫЛКА Справочник.СделкиСКлиентами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	Отбор.Организация КАК Организация,
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтНезаполненныеАналитикиРасходов
	|ИЗ ВтОтборПродажПоПартнеру КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	Отбор.Организация,
	|	Отбор.АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ ВтОтборПродажПоСделке КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	Отбор.Организация,
	|	Отбор.АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ ВтОтборПродажПоЗаказу КАК Отбор
	|ГДЕ
	|	Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор КАК Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента КАК ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение КАК Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов КАК ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов КАК ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета КАК РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия КАК Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер КАК Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад КАК Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение КАК Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор КАК Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиРегл КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость
	|		+ ВыручкаИСебестоимостьПродаж.ДопРасходы
	|		+ ВыручкаИСебестоимостьПродаж.Трудозатраты
	|		+ ВыручкаИСебестоимостьПродаж.ПостатейныеПостоянныеСНДС
	|		+ ВыручкаИСебестоимостьПродаж.ПостатейныеПеременныеСНДС КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьРегл
	|		+ ВыручкаИСебестоимостьПродаж.ДопРасходыРегл
	|		+ ВыручкаИСебестоимостьПродаж.ТрудозатратыРегл
	|		+ ВыручкаИСебестоимостьПродаж.ПостатейныеПостоянныеРегл
	|		+ ВыручкаИСебестоимостьПродаж.ПостатейныеПеременныеРегл КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента КАК ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажИсхДанные
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоПартнеру КАК Отбор
	|			ПО КлючиАналитикиУчетаПоПартнерам.Партнер = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоЗаказу КАК Отбор
	|			ПО ВыручкаИСебестоимостьПродаж.ЗаказКлиента = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ (Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.АктВыполненныхРабот.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ИЛИ Отбор.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|	)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	&КонецПериода КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоРеализациямПрошлыхПериодов КАК Отбор
	|		ПО ВыручкаИСебестоимостьПродаж.ЗаказКлиента = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период < &НачалоПериода
	|	И ВыручкаИСебестоимостьПродаж.Активность
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПродажПоСделке КАК Отбор
	|			ПО ЕСТЬNULL(ВыручкаИСебестоимостьПродаж.ЗаказКлиента.Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)) = Отбор.АналитикаРасходов
	|			И КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И НЕ Отбор.АналитикаРасходов = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отбор.АналитикаРасходов КАК АналитикаРасходов,
	|	Отбор.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Отбор.Организация КАК Организация,
	|	ВыручкаИСебестоимостьПродаж.Период КАК Период,
	|	ВыручкаИСебестоимостьПродаж.Регистратор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.ЗаказКлиента,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам,
	|	ВыручкаИСебестоимостьПродаж.Подразделение,
	|	ВыручкаИСебестоимостьПродаж.ТипЗапасов,
	|	ВыручкаИСебестоимостьПродаж.ВидЗапасов,
	|	ВыручкаИСебестоимостьПродаж.РазделУчета,
	|	ВыручкаИСебестоимостьПродаж.Партия,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаПартий,
	|	ВыручкаИСебестоимостьПродаж.АналитикаФинансовогоУчета,
	|	ВыручкаИСебестоимостьПродаж.ВидДеятельностиНДС,
	|	ВыручкаИСебестоимостьПродаж.Менеджер,
	|	ВыручкаИСебестоимостьПродаж.Склад,
	|	ВыручкаИСебестоимостьПродаж.Соглашение,
	|	ВыручкаИСебестоимостьПродаж.Договор,
	|	ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента,
	|	ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиНоменклатуры,
	|	ВыручкаИСебестоимостьПродаж.Сторно,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручки КАК ВыручкаУпр,
	|	ВыручкаИСебестоимостьПродаж.СуммаВыручкиБезНДС КАК ВыручкаРегл,
	|	ВыручкаИСебестоимостьПродаж.Стоимость КАК СебестоимостьУпр,
	|	ВыручкаИСебестоимостьПродаж.СтоимостьБезНДС КАК СебестоимостьРегл,
	|	ВыручкаИСебестоимостьПродаж.Количество КАК Количество,
	|	&Вес * ВыручкаИСебестоимостьПродаж.Количество КАК Вес,
	|	&Объем * ВыручкаИСебестоимостьПродаж.Количество КАК Объем,
	|	ВыручкаИСебестоимостьПродаж.НалогообложениеНДС,
	|	ВыручкаИСебестоимостьПродаж.ВалютаВзаиморасчетов,
	|	ВыручкаИСебестоимостьПродаж.ВалютаДокумента,
	|	ВыручкаИСебестоимостьПродаж.ИсточникГФУНоменклатуры
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО КлючиАналитикиУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНезаполненныеАналитикиРасходов КАК Отбор
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Отбор.Организация
	|ГДЕ
	|	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлючиАналитикиУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|	И ВыручкаИСебестоимостьПродаж.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И КлючиАналитикиУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И (ВыручкаИСебестоимостьПродаж.НаправлениеДеятельностиКонтрагента = Отбор.НаправлениеДеятельности
	|		ИЛИ Отбор.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	)
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|ВЫБРАТЬ
	|	Данные.НаправлениеДеятельности,
	|	Данные.АналитикаРасходов,
	|	Данные.Организация,
	|	Данные.Период,
	|	Данные.Регистратор,
	|	Данные.АналитикаУчетаНоменклатуры,
	|	Данные.ЗаказКлиента,
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.Подразделение,
	|	Данные.ТипЗапасов,
	|	Данные.ВидЗапасов,
	|	Данные.РазделУчета,
	|	Данные.Партия,
	|	Данные.АналитикаУчетаПартий,
	|	Данные.АналитикаФинансовогоУчета,
	|	Данные.ВидДеятельностиНДС,
	|	Данные.Менеджер,
	|	Данные.Склад,
	|	Данные.Соглашение,
	|	Данные.Договор,
	|	Данные.АналитикаУчетаНаборов,
	|	Данные.НаправлениеДеятельностиКонтрагента,
	|	Данные.НаправлениеДеятельностиНоменклатуры,
	|	Данные.НалогообложениеНДС,
	|	Данные.ВалютаВзаиморасчетов,
	|	Данные.ВалютаДокумента,
	|	Данные.ИсточникГФУНоменклатуры,
	|	Данные.Сторно,
	|	СУММА(Данные.Количество) КАК Количество,
	|	СУММА(Данные.Вес) КАК Вес,
	|	СУММА(Данные.Объем) КАК Объем,
	|	СУММА(Данные.ВыручкаУпр) КАК ВыручкаУпр,
	|	СУММА(Данные.ВыручкаРегл) КАК ВыручкаРегл,
	|	СУММА(Данные.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(Данные.СебестоимостьРегл) КАК СебестоимостьРегл
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажДанные
	|ИЗ
	|	ВтБазаРаспределенияПродажИсхДанные КАК Данные
	|СГРУППИРОВАТЬ ПО
	|	Данные.НаправлениеДеятельности,
	|	Данные.АналитикаРасходов,
	|	Данные.Организация,
	|	Данные.Период,
	|	Данные.Регистратор,
	|	Данные.АналитикаУчетаНоменклатуры,
	|	Данные.ЗаказКлиента,
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.Подразделение,
	|	Данные.ТипЗапасов,
	|	Данные.ВидЗапасов,
	|	Данные.РазделУчета,
	|	Данные.Партия,
	|	Данные.АналитикаУчетаПартий,
	|	Данные.АналитикаФинансовогоУчета,
	|	Данные.ВидДеятельностиНДС,
	|	Данные.Менеджер,
	|	Данные.Склад,
	|	Данные.Соглашение,
	|	Данные.Договор,
	|	Данные.АналитикаУчетаНаборов,
	|	Данные.НаправлениеДеятельностиКонтрагента,
	|	Данные.НаправлениеДеятельностиНоменклатуры,
	|	Данные.НалогообложениеНДС,
	|	Данные.ВалютаВзаиморасчетов,
	|	Данные.ВалютаДокумента,
	|	Данные.ИсточникГФУНоменклатуры,
	|	Данные.Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов КАК АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация КАК Организация,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.ВыручкаУпр) КАК ВыручкаУпр,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.ВыручкаРегл) КАК ВыручкаРегл,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.СебестоимостьРегл) КАК СебестоимостьРегл,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Количество) КАК Количество,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Вес) КАК Вес,
	|	СУММА(ВтБазаРаспределенияПродажИсхДанные.Объем) КАК Объем
	|ПОМЕСТИТЬ ВтБазаРаспределенияПродажСуммы
	|ИЗ
	|	ВтБазаРаспределенияПродажИсхДанные КАК ВтБазаРаспределенияПродажИсхДанные
	|СГРУППИРОВАТЬ ПО
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов КАК АналитикаРасходов,
	|	ВтБазаРаспределенияПродажИсхДанные.Период КАК Период,
	|	ВтБазаРаспределенияПродажИсхДанные.Организация КАК Организация,
	|	ВтБазаРаспределенияПродажИсхДанные.Регистратор КАК Регистратор,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаНоменклатуры,
	|	ВтБазаРаспределенияПродажИсхДанные.ЗаказКлиента,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаПоПартнерам,
	|	ВтБазаРаспределенияПродажИсхДанные.Подразделение,
	|	ВтБазаРаспределенияПродажИсхДанные.ТипЗапасов,
	|	ВтБазаРаспределенияПродажИсхДанные.ВидЗапасов,
	|	ВтБазаРаспределенияПродажИсхДанные.РазделУчета,
	|	ВтБазаРаспределенияПродажИсхДанные.Партия,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаПартий,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаФинансовогоУчета,
	|	ВтБазаРаспределенияПродажИсхДанные.ВидДеятельностиНДС,
	|	ВтБазаРаспределенияПродажИсхДанные.Менеджер,
	|	ВтБазаРаспределенияПродажИсхДанные.Склад,
	|	ВтБазаРаспределенияПродажИсхДанные.Соглашение,
	|	ВтБазаРаспределенияПродажИсхДанные.Договор,
	|	ВтБазаРаспределенияПродажИсхДанные.АналитикаУчетаНаборов,
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельностиКонтрагента,
	|	ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельностиНоменклатуры,
	|	ВтБазаРаспределенияПродажИсхДанные.Сторно,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.ВыручкаУпр, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.ВыручкаУпр / ВтБазаРаспределенияПродажСуммы.ВыручкаУпр
	|	КОНЕЦ КАК ДоляВыручкаУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.ВыручкаРегл, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.ВыручкаРегл / ВтБазаРаспределенияПродажСуммы.ВыручкаРегл
	|	КОНЕЦ КАК ДоляВыручкаРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.СебестоимостьУпр, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.СебестоимостьУпр / ВтБазаРаспределенияПродажСуммы.СебестоимостьУпр
	|	КОНЕЦ КАК ДоляСебеСтоимостьУпр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.СебестоимостьРегл, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.СебестоимостьРегл / ВтБазаРаспределенияПродажСуммы.СебестоимостьРегл
	|	КОНЕЦ КАК ДоляСебеСтоимостьРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Количество, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Количество / ВтБазаРаспределенияПродажСуммы.Количество
	|	КОНЕЦ КАК ДоляКоличество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Вес, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Вес / ВтБазаРаспределенияПродажСуммы.Вес
	|	КОНЕЦ КАК ДоляВес,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтБазаРаспределенияПродажСуммы.Объем, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВтБазаРаспределенияПродажИсхДанные.Объем / ВтБазаРаспределенияПродажСуммы.Объем
	|	КОНЕЦ КАК ДоляОбъем,
	|	ВтБазаРаспределенияПродажИсхДанные.НалогообложениеНДС,
	|	ВтБазаРаспределенияПродажИсхДанные.ВалютаВзаиморасчетов,
	|	ВтБазаРаспределенияПродажИсхДанные.ВалютаДокумента,
	|	ВтБазаРаспределенияПродажИсхДанные.ИсточникГФУНоменклатуры
	|ПОМЕСТИТЬ ВтБазаРаспределенияНаПродажи
	|ИЗ
	|	ВтБазаРаспределенияПродажДанные КАК ВтБазаРаспределенияПродажИсхДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтБазаРаспределенияПродажСуммы КАК ВтБазаРаспределенияПродажСуммы
	|		ПО ВтБазаРаспределенияПродажИсхДанные.АналитикаРасходов = ВтБазаРаспределенияПродажСуммы.АналитикаРасходов
	|			И ВтБазаРаспределенияПродажИсхДанные.Организация = ВтБазаРаспределенияПродажСуммы.Организация
	|			И ВтБазаРаспределенияПродажИсхДанные.НаправлениеДеятельности = ВтБазаРаспределенияПродажСуммы.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация,
	|	НаправлениеДеятельности;
	|";
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса);
	
КонецФункции

Функция ТекстЗапросаБазаРаспределенияРасходовНаЗаказы()
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ДД.АналитикаРасходов КАК Документ.ЗаказКлиента) КАК АналитикаРасходов,
	|	ВЫРАЗИТЬ(ДД.АналитикаРасходов КАК Документ.ЗаказКлиента).ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВтОтборПоЗаказуКлиента
	|ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК ДД
	|
	// Исключаем заказы, которые учтены во временной таблице ВтОтборПродажПоЗаказу.
	// Расходы по таким заказам уже распределены. 
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтОтборПродажПоЗаказу КАК ВтОтборПродажПоЗаказу
	|	ПО ВтОтборПродажПоЗаказу.Организация = ДД.Организация
	|		И ВтОтборПродажПоЗаказу.АналитикаРасходов = ДД.АналитикаРасходов
	|		И ВтОтборПродажПоЗаказу.НаправлениеДеятельности = ДД.НаправлениеДеятельности
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
	|	И ВтОтборПродажПоЗаказу.АналитикаРасходов ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.Номенклатура КАК Номенклатура,
	|	ДД.Характеристика КАК Характеристика,
	|	ДД.КодСтроки КАК КодСтроки,
	|	ДД.Склад КАК Склад,
	|	ДД.Серия КАК Серия,
	|	ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК Факт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА &Вес * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА &Вес * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА &Объем * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА &Объем * ДД.Заказано
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПлан,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ДД.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаФакт,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ДД.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПлан,
	|	0 КАК КоличествоПродано,
	|	0 КАК СебестоимостьСНДС,
	|	0 КАК СебестоимостьБезНДС,
	|	0 КАК СебестоимостьРегл,
	|	0 КАК СебестоимостьУпр
	|
	|ПОМЕСТИТЬ ВтЗаказыПланФактИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиента КАК ВтОтборПоЗаказуКлиента
	|		ПО ДД.ЗаказКлиента = ВтОтборПоЗаказуКлиента.АналитикаРасходов
	|			И ДД.ЗаказКлиента.Организация = ВтОтборПоЗаказуКлиента.Организация
	|			И (ВтОтборПоЗаказуКлиента.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДД.ЗаказКлиента.НаправлениеДеятельности = ВтОтборПоЗаказуКлиента.НаправлениеДеятельности)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ДД.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период <= &КонецПериода
	|	И ДД.Заказано <> 0
	|	И НЕ (ВтОтборПоЗаказуКлиента.ВернутьМногооборотнуюТару И СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Себестоимость продаж прошлого периода.
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	0 КАК КодСтроки,
	|	ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ИСТИНА КАК Факт,
	|	0 КАК КоличествоФакт,
	|	0 КАК КоличествоПлан,
	|	0 КАК ВесФакт,
	|	0 КАК ВесПлан,
	|	0 КАК ОбъемФакт,
	|	0 КАК ОбъемПлан,
	|	0 КАК СуммаФакт,
	|	0 КАК СуммаПлан,
	|	СУММА(ДД.Количество) КАК КоличествоПродано,
	|	СУММА(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК СебестоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл) КАК СебестоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр) КАК СебестоимостьУпр
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиента КАК ВтОтборПоЗаказуКлиента
	|	ПО ВтОтборПоЗаказуКлиента.АналитикаРасходов = ДД.ЗаказКлиента
	|		И ВтОтборПоЗаказуКлиента.Организация = ДД.АналитикаУчетаПоПартнерам.Организация
	|		И (ВтОтборПоЗаказуКлиента.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ИЛИ ВтОтборПоЗаказуКлиента.НаправлениеДеятельности = ДД.НаправлениеДеятельностиКонтрагента)
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
	|	ДД.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ДД.АналитикаУчетаНоменклатуры.Серия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Себестоимость продаж текущего периода.
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	0 КАК КодСтроки,
	|	ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	ДД.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ИСТИНА КАК Факт,
	|	0 КАК КоличествоФакт,
	|	0 КАК КоличествоПлан,
	|	0 КАК ВесФакт,
	|	0 КАК ВесПлан,
	|	0 КАК ОбъемФакт,
	|	0 КАК ОбъемПлан,
	|	0 КАК СуммаФакт,
	|	0 КАК СуммаПлан,
	|	СУММА(ДД.Количество) КАК КоличествоПродано,
	|	СУММА(ДД.Стоимость
	|		+ ДД.ДопРасходы
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеСНДС
	|		+ ДД.ПостатейныеПеременныеСНДС) КАК СебестоимостьСНДС,
	|	СУММА(ДД.СтоимостьБезНДС
	|		+ ДД.ДопРасходыБезНДС
	|		+ ДД.Трудозатраты
	|		+ ДД.ПостатейныеПостоянныеБезНДС
	|		+ ДД.ПостатейныеПеременныеБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СтоимостьРегл
	|		+ ДД.ДопРасходыРегл
	|		+ ДД.ТрудозатратыРегл
	|		+ ДД.ПостатейныеПостоянныеРегл
	|		+ ДД.ПостатейныеПеременныеРегл) КАК СебестоимостьРегл,
	|	СУММА(ДД.СтоимостьУпр
	|		+ ДД.ДопРасходыУпр
	|		+ ДД.ТрудозатратыУпр
	|		+ ДД.ПостатейныеПостоянныеУпр
	|		+ ДД.ПостатейныеПеременныеУпр) КАК СебестоимостьУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборПоЗаказуКлиента КАК ВтОтборПоЗаказуКлиента
	|	ПО ВтОтборПоЗаказуКлиента.АналитикаРасходов = ДД.ЗаказКлиента
	|		И ВтОтборПоЗаказуКлиента.Организация = ДД.АналитикаУчетаПоПартнерам.Организация
	|		И (ВтОтборПоЗаказуКлиента.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ИЛИ ВтОтборПоЗаказуКлиента.НаправлениеДеятельности = ДД.НаправлениеДеятельностиКонтрагента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ВтОтборПоЗаказуКлиента.НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ДД.АналитикаУчетаНоменклатуры.Характеристика,
	|	ДД.АналитикаУчетаНоменклатуры.МестоХранения,
	|	ДД.АналитикаУчетаНоменклатуры.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.ЗаказКлиента				КАК ЗаказКлиента,
	|	ДД.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ДД.КоличествоФакт)	КАК КоличествоФакт,
	|	СУММА(ДД.ВесФакт)			КАК ВесФакт,
	|	СУММА(ДД.ОбъемФакт)			КАК ОбъемФакт,
	|	СУММА(ДД.СуммаФакт)			КАК СуммаФакт,
	|	СУММА(ДД.КоличествоПлан)	КАК КоличествоПлан,
	|	СУММА(ДД.ВесПлан)			КАК ВесПлан,
	|	СУММА(ДД.ОбъемПлан)			КАК ОбъемПлан,
	|	ВЫБОР 
	|		КОГДА СУММА(ДД.СуммаФакт) > СУММА(ДД.СуммаПлан)
	|			ТОГДА СУММА(ДД.СуммаФакт)
	|		ИНАЧЕ СУММА(ДД.СуммаПлан)
	|	КОНЕЦ						КАК СуммаПлан,
	|	СУММА(ДД.СебестоимостьСНДС)	КАК СебестоимостьСНДС,
	|	СУММА(ДД.СебестоимостьБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СебестоимостьРегл)	КАК СебестоимостьРегл,
	|	СУММА(ДД.СебестоимостьУпр)	КАК СебестоимостьУпр,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьСНДС)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьСНДС)
	|		ИНАЧЕ (СУММА(ДД.СебестоимостьСНДС) / СУММА(ДД.КоличествоПродано)) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьСНДСПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьБезНДС)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьБезНДС)
	|		ИНАЧЕ (СУММА(ДД.СебестоимостьБезНДС) / СУММА(ДД.КоличествоПродано)) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьБезНДСПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьРегл)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьРегл)
	|		ИНАЧЕ СУММА(ДД.СебестоимостьРегл) / СУММА(ДД.КоличествоПродано) * СУММА(ДД.КоличествоПлан)
	|	КОНЕЦ) КАК СебестоимостьРеглПлан,
	|	(ВЫБОР
	|		КОГДА СУММА(ДД.КоличествоПродано) = 0 ТОГДА 0
	|		КОГДА СУММА(ДД.КоличествоПлан) = 0 ТОГДА СУММА(ДД.СебестоимостьУпр)
	|		КОГДА СУММА(ДД.КоличествоПродано) >= СУММА(ДД.КоличествоПлан)
	|			ТОГДА СУММА(ДД.СебестоимостьУпр)
	|		ИНАЧЕ СУММА(ДД.СебестоимостьУпр) / СУММА(ДД.КоличествоПродано) * СУММА(ДД.КоличествоПлан)
	|	 КОНЕЦ) КАК СебестоимостьУпрПлан
	|
	|ПОМЕСТИТЬ ВтПланФактПоЗаказу
	|ИЗ
	|	ВтЗаказыПланФактИсходныеДанные КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ЗаказКлиента,
	|	ДД.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	ДД.Номенклатура КАК Номенклатура,
	|	ДД.Характеристика КАК Характеристика,
	|	ДД.Склад КАК Склад,
	|	ДД.Серия КАК Серия,
	|	СУММА(ДД.КоличествоФакт) КАК Количество,
	|	СУММА(ДД.СуммаФакт) КАК Сумма,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.КоличествоПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.КоличествоФакт) / МАКСИМУМ(ПланФакт.КоличествоПлан)
	|	КОНЕЦ КАК КоличествоДоля,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.ВесПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.ВесФакт) / МАКСИМУМ(ПланФакт.ВесПлан)
	|	КОНЕЦ КАК ВесДоля,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.ОбъемПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.ОбъемФакт) / МАКСИМУМ(ПланФакт.ОбъемПлан)
	|	КОНЕЦ КАК ОбъемДоля,
	|	ВЫБОР КОГДА МАКСИМУМ(ПланФакт.СуммаПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СуммаФакт) / МАКСИМУМ(ПланФакт.СуммаПлан)
	|	КОНЕЦ КАК СуммаДоля,
	|	СУММА(ДД.СебестоимостьСНДС)	КАК СебестоимостьСНДС,
	|	СУММА(ДД.СебестоимостьБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(ДД.СебестоимостьРегл)	КАК СебестоимостьРегл,
	|	СУММА(ДД.СебестоимостьУпр)	КАК СебестоимостьУпр,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьСНДСПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьСНДС) / МАКСИМУМ(ПланФакт.СебестоимостьСНДСПлан)
	|	КОНЕЦ КАК СебестоимостьСНДСДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьБезНДСПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьБезНДС) / МАКСИМУМ(ПланФакт.СебестоимостьБезНДСПлан)
	|	КОНЕЦ КАК СебестоимостьБезНДСДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьРеглПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьРегл) / МАКСИМУМ(ПланФакт.СебестоимостьРеглПлан)
	|	КОНЕЦ КАК СебестоимостьРеглДоля,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ПланФакт.СебестоимостьУпрПлан) = 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ДД.СебестоимостьУпр) / МАКСИМУМ(ПланФакт.СебестоимостьУпрПлан)
	|	КОНЕЦ КАК СебестоимостьУпрДоля
	|
	|ПОМЕСТИТЬ ВтДолиПоЗаказу
	|ИЗ
	|	ВтЗаказыПланФактИсходныеДанные КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПланФактПоЗаказу КАК ПланФакт
	|		ПО ДД.ЗаказКлиента = ПланФакт.ЗаказКлиента
	|		И ДД.НаправлениеДеятельности = ПланФакт.НаправлениеДеятельности
	|ГДЕ
	|	ДД.Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Регистратор,
	|	ДД.ЗаказКлиента,
	|	ДД.НаправлениеДеятельности,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Склад,
	|	ДД.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Распределение по данным прошлого периода.
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	Доли.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ТипЗапасов КАК ТипЗапасов,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.Менеджер КАК Менеджер,
	|	ДД.Склад КАК Склад,
	|	ДД.Соглашение КАК Соглашение,
	|	ДД.Договор КАК Договор,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента КАК ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДД.ДокументДвижения КАК ДокументДвижения,
	|	ДД.РасчетСебестоимости КАК РасчетСебестоимости,
	|	ДД.РасчетПартий КАК РасчетПартий,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	ДД.Сторно КАК Сторно,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.КоличествоДоля
	|	КОНЕЦ) КАК КоличествоДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ВесДоля
	|	КОНЕЦ) КАК ВесДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ОбъемДоля
	|	КОНЕЦ) КАК ОбъемДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Сумма = 0 ИЛИ ДД.СуммаВВалютеВзаиморасчетов = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.СуммаВВалютеВзаиморасчетов / Доли.Сумма) * Доли.СуммаДоля
	|	КОНЕЦ) КАК СуммаДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьСНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.Стоимость
	|			+ ДД.ДопРасходы
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеСНДС
	|			+ ДД.ПостатейныеПеременныеСНДС)
	|			/ Доли.СебестоимостьСНДС) * Доли.СебестоимостьСНДСДоля КОНЕЦ) КАК СебестоимостьСНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьБезНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьБезНДС
	|			+ ДД.ДопРасходыБезНДС
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеБезНДС
	|			+ ДД.ПостатейныеПеременныеБезНДС)
	|			/ Доли.СебестоимостьБезНДС) * Доли.СебестоимостьБезНДСДоля КОНЕЦ) КАК СебестоимостьБезНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьРегл = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьРегл
	|			+ ДД.ДопРасходыРегл
	|			+ ДД.ТрудозатратыРегл
	|			+ ДД.ПостатейныеПостоянныеРегл
	|			+ ДД.ПостатейныеПеременныеРегл)
	|			/ Доли.СебестоимостьРегл) * Доли.СебестоимостьРеглДоля КОНЕЦ) КАК СебестоимостьРеглДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьУпр = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьУпр
	|			+ ДД.ДопРасходыУпр
	|			+ ДД.ТрудозатратыУпр
	|			+ ДД.ПостатейныеПостоянныеУпр
	|			+ ДД.ПостатейныеПеременныеУпр)
	|			/ Доли.СебестоимостьУпр) * Доли.СебестоимостьУпрДоля КОНЕЦ) КАК СебестоимостьУпрДоля
	|
	|ПОМЕСТИТЬ ВтБазаРаспределенияПоЗаказуКлиента
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ДД.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ДД.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиПоЗаказу КАК Доли
	|		ПО ДД.ЗаказКлиента = Доли.ЗаказКлиента
	|			И ДД.Регистратор = Доли.Регистратор
	|			И (Доли.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДД.НаправлениеДеятельностиКонтрагента = Доли.НаправлениеДеятельности)
	|			И (Доли.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ИЛИ ДД.Склад = Доли.Склад)
	|			И КлючиАналитикиУчетаНоменклатуры.Номенклатура = Доли.Номенклатура
	|			И КлючиАналитикиУчетаНоменклатуры.Характеристика = Доли.Характеристика
	|			И КлючиАналитикиУчетаНоменклатуры.Серия = Доли.Серия
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение по данным текущего периода.
	|ВЫБРАТЬ
	|	ДД.Период КАК Период,
	|	ДД.Регистратор КАК Регистратор,
	|	Доли.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента КАК ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ТипЗапасов КАК ТипЗапасов,
	|	ДД.ВидЗапасов КАК ВидЗапасов,
	|	ДД.РазделУчета КАК РазделУчета,
	|	ДД.Партия КАК Партия,
	|	ДД.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
	|	ДД.Менеджер КАК Менеджер,
	|	ДД.Склад КАК Склад,
	|	ДД.Соглашение КАК Соглашение,
	|	ДД.Договор КАК Договор,
	|	ДД.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДД.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента КАК ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДД.ДокументДвижения КАК ДокументДвижения,
	|	ДД.РасчетСебестоимости КАК РасчетСебестоимости,
	|	ДД.РасчетПартий КАК РасчетПартий,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	ДД.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	ДД.Сторно КАК Сторно,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.КоличествоДоля
	|	КОНЕЦ) КАК КоличествоДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ВесДоля
	|	КОНЕЦ) КАК ВесДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Количество = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.Количество / Доли.Количество) * Доли.ОбъемДоля
	|	КОНЕЦ) КАК ОбъемДоля,
	|	(ВЫБОР
	|		КОГДА Доли.Сумма = 0 ИЛИ ДД.СуммаВВалютеВзаиморасчетов = 0 ТОГДА 0
	|		ИНАЧЕ (ДД.СуммаВВалютеВзаиморасчетов / Доли.Сумма) * Доли.СуммаДоля
	|	КОНЕЦ) КАК СуммаДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьСНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.Стоимость
	|			+ ДД.ДопРасходы
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеСНДС
	|			+ ДД.ПостатейныеПеременныеСНДС)
	|			/ Доли.СебестоимостьСНДС) * Доли.СебестоимостьСНДСДоля КОНЕЦ) КАК СебестоимостьСНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьБезНДС = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьБезНДС
	|			+ ДД.ДопРасходыБезНДС
	|			+ ДД.Трудозатраты
	|			+ ДД.ПостатейныеПостоянныеБезНДС
	|			+ ДД.ПостатейныеПеременныеБезНДС)
	|			/ Доли.СебестоимостьБезНДС) * Доли.СебестоимостьБезНДСДоля КОНЕЦ) КАК СебестоимостьБезНДСДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьРегл = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьРегл
	|			+ ДД.ДопРасходыРегл
	|			+ ДД.ТрудозатратыРегл
	|			+ ДД.ПостатейныеПостоянныеРегл
	|			+ ДД.ПостатейныеПеременныеРегл)
	|			/ Доли.СебестоимостьРегл) * Доли.СебестоимостьРеглДоля КОНЕЦ) КАК СебестоимостьРеглДоля,
	|	(ВЫБОР
	|		КОГДА Доли.СебестоимостьУпр = 0 ТОГДА 0
	|		ИНАЧЕ ((ДД.СтоимостьУпр
	|			+ ДД.ДопРасходыУпр
	|			+ ДД.ТрудозатратыУпр
	|			+ ДД.ПостатейныеПостоянныеУпр
	|			+ ДД.ПостатейныеПеременныеУпр)
	|			/ Доли.СебестоимостьУпр) * Доли.СебестоимостьУпрДоля КОНЕЦ) КАК СебестоимостьУпрДоля
	|
	|ИЗ
	|	ВТКэшРасчетныеОборотыВыручкаИСебестоимостьПродаж КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|			ПО ДД.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ПО ДД.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтДолиПоЗаказу КАК Доли
	|		ПО ДД.ЗаказКлиента = Доли.ЗаказКлиента
	|			И ДД.Регистратор = Доли.Регистратор
	|			И (Доли.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|				ИЛИ ДД.НаправлениеДеятельностиКонтрагента = Доли.НаправлениеДеятельности)
	|			И (Доли.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) ИЛИ ДД.Склад = Доли.Склад)
	|			И КлючиАналитикиУчетаНоменклатуры.Номенклатура = Доли.Номенклатура
	|			И КлючиАналитикиУчетаНоменклатуры.Характеристика = Доли.Характеристика
	|			И КлючиАналитикиУчетаНоменклатуры.Серия = Доли.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	НаправлениеДеятельности,
	|	Организация
	|;";
	
	Возврат РасчетСебестоимостиПрикладныеАлгоритмы.ПодставитьШаблоныВесаИОбъемаВТекстЗапроса(ТекстЗапроса);
	
КонецФункции

Функция ТекстЗапросаПодготовкаДанныхРаспределенияРасходовНаПродажи() 
	
	ТекстЗапроса = "ВЫБРАТЬ 
	|	Т.Ссылка КАК СтатьяРасходов,
	|	Т.ВариантРаспределенияРасходовУпр КАК ВариантРаспределенияРасходовУпр,
	|	Т.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
	|	Т.ВариантРаспределенияРасходовНУ КАК ВариантРаспределенияРасходовНУ,
	|	Т.ПравилоРаспределенияНаСебестоимостьПродажУпр КАК ПравилоРаспределенияНаСебестоимостьПродажУпр,
	|	Т.ПравилоРаспределенияНаСебестоимостьПродажРегл КАК ПравилоРаспределенияНаСебестоимостьПродажРегл,
	|	Т.ПринятиеКНалоговомуУчету КАК ПринятиеКНалоговомуУчету
	|	
	|ПОМЕСТИТЬ СтатьиКРаспределениюНаПродажу
	|
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Т
	|
	|ГДЕ
	|	Т.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|	ИЛИ
	|		Т.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|		
	|ИНДЕКСИРОВАТЬ ПО СтатьяРасходов;
	|
	|ВЫБРАТЬ
    |	Расходы.Организация КАК Организация,
    |	Расходы.Подразделение КАК Подразделение,
    |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
    |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
    |	Расходы.АналитикаРасходов КАК АналитикаРасходов
	|ПОМЕСТИТЬ ОстаткиРасходовПоЗаказам
	|
    |ИЗ
	|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиКРаспределениюНаПродажу КАК Т
	|		ПО Расходы.СтатьяРасходов = Т.СтатьяРасходов
	|
    |ГДЕ
    |	Расходы.АналитикаРасходов ССЫЛКА Документ.ЗаказКлиента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	НаправлениеДеятельности,
	|	СтатьяРасходов,
	|	АналитикаРасходов;
	|
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСтоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВыручкеУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСебестоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоСебестоимостиУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноКоличеству)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоКоличествуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноВесу)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВесуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноОбъему)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоОбъемуУпр,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСтоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВыручкеРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноСебестоимости)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоСебестоимостиРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноКоличеству)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоКоличествуРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноВесу)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоВесуРегл,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Т.ПравилоРаспределенияНаСебестоимостьПродажРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ПравилаРаспределенияНаСебестоимостьПродаж.ПропорциональноОбъему)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоэффПоОбъемуРегл,
	|	СУММА(ВЫБОР
	|		КОГДА Т.ВариантРаспределенияРасходовУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА Т.ВариантРаспределенияРасходовУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА Т.ВариантРаспределенияРасходовУпр = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаУпр,
	|	СУММА(ВЫБОР
	|		КОГДА Т.ВариантРаспределенияРасходовРегл = 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|			ТОГДА Расходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаРегл,
	|	СУММА(ВЫБОР
	|			КОГДА Т.ВариантРаспределенияРасходовНУ = 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|				ТОГДА Расходы.ПостояннаяРазница
	|			КОГДА Т.ВариантРаспределенияРасходовРегл = 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|					И НЕ Т.ПринятиеКНалоговомуУчету
	|				ТОГДА Расходы.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПостояннаяРазница,
	|	СУММА(ВЫБОР
	|			КОГДА Т.ВариантРаспределенияРасходовНУ = 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|				ТОГДА Расходы.ВременнаяРазница
	|			КОГДА Т.ВариантРаспределенияРасходовРегл = 
	|					ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПродаж)
	|					И Т.ПринятиеКНалоговомуУчету
	|				ТОГДА Расходы.СуммаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ РасходыКРаспределениюНаПродажу
	|
	|ИЗ
	|	&ИсточникиРасходов КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиКРаспределениюНаПродажу КАК Т
	|		ПО Расходы.СтатьяРасходов = Т.СтатьяРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	Расходы.Организация,
	|	Расходы.Подразделение,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаРасходов,
	|	Организация
	|;";
	
    МассивИсточников = Новый Массив;
	ТекстЗапросаИсточника = "ВЫБРАТЬ
	                        |	Расходы.Организация КАК Организация,
	                        |	Расходы.Подразделение КАК Подразделение,
	                        |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                        |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	                        |	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	                        |	Расходы.Сумма КАК Сумма,
	                        |	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	                        |	Расходы.СуммаРегл КАК СуммаРегл,
	                        |	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	                        |	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	                        |	Расходы.СуммаУпр КАК СуммаУпр
	                        |ИЗ
							|	ВТКэшРасчетныеОстаткиПрочиеРасходы КАК Расходы
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиКРаспределениюНаПродажу КАК Т
							|		ПО Расходы.СтатьяРасходов = Т.СтатьяРасходов";
	МассивИсточников.Добавить(ТекстЗапросаИсточника);
	ТекстЗапросаИсточника = "ВЫБРАТЬ
	                        |	Расходы.Организация КАК Организация,
	                        |	Расходы.Подразделение КАК Подразделение,
	                        |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                        |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	                        |	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	                        |	Расходы.Сумма КАК Сумма,
	                        |	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	                        |	Расходы.СуммаРегл КАК СуммаРегл,
	                        |	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	                        |	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	                        |	Расходы.СуммаУпр КАК СуммаУпр
	                        |ИЗ
	                        |	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиРасходовПоЗаказам КАК Остатки
	                        |		ПО	Расходы.Организация = Остатки.Организация
	                        |			И Расходы.Подразделение = Остатки.Подразделение
	                        |			И Расходы.НаправлениеДеятельности = Остатки.НаправлениеДеятельности
	                        |			И Расходы.СтатьяРасходов = Остатки.СтатьяРасходов
	                        |			И Расходы.АналитикаРасходов = Остатки.АналитикаРасходов
	                        |ГДЕ
							|	НЕ Расходы.СлужебноеВидДвиженияПриход";
	МассивИсточников.Добавить(ТекстЗапросаИсточника);
	ТекстЗапросаИсточника = "ВЫБРАТЬ
	                        |	Расходы.Организация КАК Организация,
	                        |	Расходы.Подразделение КАК Подразделение,
	                        |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                        |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	                        |	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	                        |	-Расходы.Сумма КАК Сумма,
	                        |	-Расходы.СуммаБезНДС КАК СуммаБезНДС,
	                        |	-Расходы.СуммаРегл КАК СуммаРегл,
	                        |	-Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	                        |	-Расходы.ВременнаяРазница КАК ВременнаяРазница,
	                        |	-Расходы.СуммаУпр КАК СуммаУпр
	                        |ИЗ
	                        |	ВТКэшРасчетныеОборотыПрочиеРасходы КАК Расходы
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиРасходовПоЗаказам КАК Остатки
	                        |		ПО	Расходы.Организация = Остатки.Организация
	                        |			И Расходы.Подразделение = Остатки.Подразделение
	                        |			И Расходы.НаправлениеДеятельности = Остатки.НаправлениеДеятельности
	                        |			И Расходы.СтатьяРасходов = Остатки.СтатьяРасходов
	                        |			И Расходы.АналитикаРасходов = Остатки.АналитикаРасходов
	                        |ГДЕ
							|	Расходы.СлужебноеВидДвиженияПриход И Расходы.Сторно";
	МассивИсточников.Добавить(ТекстЗапросаИсточника);
	ТекстЗапросаИсточника = "ВЫБРАТЬ
	                        |	Расходы.Организация КАК Организация,
	                        |	Расходы.Подразделение КАК Подразделение,
	                        |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                        |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	                        |	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	                        |	Расходы.Сумма КАК Сумма,
	                        |	Расходы.СуммаБезНДС КАК СуммаБезНДС,
	                        |	Расходы.СуммаРегл КАК СуммаРегл,
	                        |	Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	                        |	Расходы.ВременнаяРазница КАК ВременнаяРазница,
	                        |	Расходы.СуммаУпр КАК СуммаУпр
	                        |ИЗ
	                        |	РегистрНакопления.ПрочиеРасходы КАК Расходы
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиРасходовПоЗаказам КАК Остатки
	                        |		ПО	Расходы.Организация = Остатки.Организация
	                        |			И Расходы.Подразделение = Остатки.Подразделение
	                        |			И Расходы.НаправлениеДеятельности = Остатки.НаправлениеДеятельности
	                        |			И Расходы.СтатьяРасходов = Остатки.СтатьяРасходов
	                        |			И Расходы.АналитикаРасходов = Остатки.АналитикаРасходов
	                        |ГДЕ
	                        |	Расходы.Период < &НачалоПериода
	                        |	И Расходы.Активность
	                        |	И Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	МассивИсточников.Добавить(ТекстЗапросаИсточника);
	ТекстЗапросаИсточника = "ВЫБРАТЬ
	                        |	Расходы.Организация КАК Организация,
	                        |	Расходы.Подразделение КАК Подразделение,
	                        |	Расходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                        |	Расходы.СтатьяРасходов КАК СтатьяРасходов,
	                        |	Расходы.АналитикаРасходов КАК АналитикаРасходов,
	                        |	-Расходы.Сумма КАК Сумма,
	                        |	-Расходы.СуммаБезНДС КАК СуммаБезНДС,
	                        |	-Расходы.СуммаРегл КАК СуммаРегл,
	                        |	-Расходы.ПостояннаяРазница КАК ПостояннаяРазница,
	                        |	-Расходы.ВременнаяРазница КАК ВременнаяРазница,
	                        |	-Расходы.СуммаУпр КАК СуммаУпр
	                        |ИЗ
	                        |	РегистрНакопления.ПрочиеРасходы КАК Расходы
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиРасходовПоЗаказам КАК Остатки
	                        |		ПО	Расходы.Организация = Остатки.Организация
	                        |			И Расходы.Подразделение = Остатки.Подразделение
	                        |			И Расходы.НаправлениеДеятельности = Остатки.НаправлениеДеятельности
	                        |			И Расходы.СтатьяРасходов = Остатки.СтатьяРасходов
	                        |			И Расходы.АналитикаРасходов = Остатки.АналитикаРасходов
	                        |ГДЕ
	                        |	Расходы.Период < &НачалоПериода
	                        |	И Расходы.Активность
	                        |	И Расходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                        |	И Расходы.Сторно";
	МассивИсточников.Добавить(ТекстЗапросаИсточника);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникиРасходов", "("+ОбъединитьТексты(МассивИсточников)+")");
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкаРаспределениеРасходовНаЗаказКлиента() 
	
	ТекстЗапроса = "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	&КонецПериода КАК Период,
	|	База.Регистратор,
	|	База.АналитикаУчетаНоменклатуры,
	|	База.ЗаказКлиента,
	|	База.АналитикаУчетаПоПартнерам,
	|	База.Подразделение КАК ПодразделениеВыручки,
	|	База.ТипЗапасов,
	|	База.ВидЗапасов,
	|	База.РазделУчета,
	|	База.Партия,
	|	База.АналитикаУчетаПартий,
	|	База.АналитикаФинансовогоУчета,
	|	База.ВидДеятельностиНДС,
	|	База.Менеджер,
	|	База.Склад,
	|	База.Соглашение,
	|	База.Договор,
	|	База.АналитикаУчетаНаборов,
	|	База.НаправлениеДеятельностиКонтрагента,
	|	База.НаправлениеДеятельностиНоменклатуры,
	|	База.НалогообложениеНДС,
	|	База.ВалютаВзаиморасчетов,
	|	База.ВалютаДокумента,
	|	База.ИсточникГФУНоменклатуры,
	|	База.Сторно,
	|	Расходы.Сумма * (Расходы.КоэффПоВыручкеУпр * База.СуммаДоля + Расходы.КоэффПоКоличествуУпр * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуУпр * База.ВесДоля + Расходы.КоэффПоОбъемуУпр * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиУпр * База.СебестоимостьСНДСДоля) КАК Сумма,
	|	Расходы.СуммаБезНДС * (Расходы.КоэффПоВыручкеУпр * База.СуммаДоля + Расходы.КоэффПоКоличествуУпр * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуУпр * База.ВесДоля + Расходы.КоэффПоОбъемуУпр * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиУпр * База.СебестоимостьБезНДСДоля) КАК СуммаБезНДС,
	|	Расходы.СуммаУпр * (Расходы.КоэффПоВыручкеУпр * База.СуммаДоля + Расходы.КоэффПоКоличествуУпр * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуУпр * База.ВесДоля + Расходы.КоэффПоОбъемуУпр * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиУпр * База.СебестоимостьУпрДоля) КАК СуммаУпр,
	|	Расходы.СуммаРегл * (Расходы.КоэффПоВыручкеРегл * База.СуммаДоля + Расходы.КоэффПоКоличествуРегл * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуРегл * База.ВесДоля + Расходы.КоэффПоОбъемуРегл * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиРегл * База.СебестоимостьРеглДоля) КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница * (Расходы.КоэффПоВыручкеРегл * База.СуммаДоля + Расходы.КоэффПоКоличествуРегл * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуРегл * База.ВесДоля + Расходы.КоэффПоОбъемуРегл * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиРегл * База.СебестоимостьРеглДоля) КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница * (Расходы.КоэффПоВыручкеРегл * База.СуммаДоля + Расходы.КоэффПоКоличествуРегл * База.КоличествоДоля
	|		+ Расходы.КоэффПоВесуРегл * База.ВесДоля + Расходы.КоэффПоОбъемуРегл * База.ОбъемДоля
	|		+ Расходы.КоэффПоСебестоимостиРегл * База.СебестоимостьРеглДоля) КАК ВременнаяРазница
	|ПОМЕСТИТЬ РаспределениеНаЗаказКлиента
	|ИЗ
	|	РасходыКРаспределениюНаПродажу КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтБазаРаспределенияПоЗаказуКлиента КАК База
	|		ПО	Расходы.АналитикаРасходов = База.ЗаказКлиента
	|			И Расходы.НаправлениеДеятельности = База.НаправлениеДеятельности
	|			И Расходы.Организация = База.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	&КонецПериода,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.Подразделение КАК ПодразделениеВыручки,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.Сторно,
	|	-ДД.РасходыНаПродажуСНДС КАК РасходыНаПродажуСНДС,
	|	-ДД.РасходыНаПродажуБезНДС КАК РасходыНаПродажуБезНДС,
	|	-ДД.РасходыНаПродажуУпр КАК РасходыНаПродажуУпр,
	|	-ДД.РасходыНаПродажуРегл КАК РасходыНаПродажуРегл,
	|	-ДД.ПостояннаяРазница КАК ПостояннаяРазница,
	|	-ДД.ВременнаяРазница КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК Расходы
	|		ПО ДД.АналитикаУчетаНоменклатуры = Расходы.АналитикаУчетаНоменклатуры
	|			И ДД.ЗаказКлиента = Расходы.АналитикаРасходов
	|			И ДД.Регистратор = Расходы.Регистратор
	|			И ДД.ИдентификаторФинЗаписи = Расходы.ИдентификаторФинЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыКРаспределениюНаПродажу КАК РасходыКРаспределению
	|			ПО РасходыКРаспределению.СтатьяРасходов = Расходы.СтатьяРасходов
	|				И РасходыКРаспределению.АналитикаРасходов = Расходы.АналитикаРасходов
	|				И РасходыКРаспределению.Подразделение = Расходы.Подразделение
	|				И РасходыКРаспределению.НаправлениеДеятельности = Расходы.НаправлениеДеятельности
	|				И РасходыКРаспределению.Организация = Расходы.Организация
	|ГДЕ
	|	ДД.Активность
	|	И ДД.Период < &НачалоПериода
	|;
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВыборкаРаспределениеРасходовНаПродажи() 
	
	ТекстЗапроса = "
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	База.Период,
	|	База.Регистратор,
	|	База.АналитикаУчетаНоменклатуры,
	|	База.ЗаказКлиента,
	|	База.АналитикаУчетаПоПартнерам,
	|	База.Подразделение КАК ПодразделениеВыручки,
	|	База.ТипЗапасов,
	|	База.ВидЗапасов,
	|	База.РазделУчета,
	|	База.Партия,
	|	База.АналитикаУчетаПартий,
	|	База.АналитикаФинансовогоУчета,
	|	База.ВидДеятельностиНДС,
	|	База.Менеджер,
	|	База.Склад,
	|	База.Соглашение,
	|	База.Договор,
	|	База.АналитикаУчетаНаборов,
	|	База.НаправлениеДеятельностиКонтрагента,
	|	База.НаправлениеДеятельностиНоменклатуры,
	|	База.НалогообложениеНДС,
	|	База.ВалютаВзаиморасчетов,
	|	База.ВалютаДокумента,
	|	База.ИсточникГФУНоменклатуры,
	|	База.Сторно,
	|	Расходы.Сумма * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК Сумма,
	|	Расходы.СуммаБезНДС * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК СуммаБезНДС,
	|	Расходы.СуммаУпр * (Расходы.КоэффПоВыручкеУпр * База.ДоляВыручкаУпр + Расходы.КоэффПоСебестоимостиУпр *
	|		База.ДоляСебестоимостьУпр + Расходы.КоэффПоКоличествуУпр * База.ДоляКоличество + Расходы.КоэффПоВесуУпр * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуУпр * База.ДоляОбъем) КАК СуммаУпр,
	|	Расходы.СуммаРегл * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК СуммаРегл,
	|	Расходы.ПостояннаяРазница * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК ПостояннаяРазница,
	|	Расходы.ВременнаяРазница * (Расходы.КоэффПоВыручкеРегл * База.ДоляВыручкаРегл + Расходы.КоэффПоСебестоимостиРегл *
	|		База.ДоляСебестоимостьРегл + Расходы.КоэффПоКоличествуРегл * База.ДоляКоличество + Расходы.КоэффПоВесуРегл * База.ДоляВес +
	|		Расходы.КоэффПоОбъемуРегл * База.ДоляОбъем) КАК ВременнаяРазница
	|ИЗ
	|	РасходыКРаспределениюНаПродажу КАК Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтБазаРаспределенияНаПродажи КАК База
	|		ПО	Расходы.АналитикаРасходов = База.АналитикаРасходов
	|			И Расходы.Организация = База.Организация
	|			И Расходы.НаправлениеДеятельности = База.НаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.ПодразделениеРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ПодразделениеВыручки,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.Сторно,
	|	СУММА(ДД.Сумма) КАК Сумма,
	|	СУММА(ДД.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДД.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ДД.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ДД.ПостояннаяРазница) КАК ПостояннаяРазница,
	|	СУММА(ДД.ВременнаяРазница) КАК ВременнаяРазница
	|ИЗ
	|	РаспределениеНаЗаказКлиента КАК ДД
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.ПодразделениеРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.ПодразделениеВыручки,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.Сторно";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОписаниеДанныхДляРаспределенияРасходовНаПродажи() 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	Расходы.Организация,
	|	Расходы.Подразделение КАК ПодразделениеРасходов,
	|	Расходы.НаправлениеДеятельности,
	|	Расходы.СтатьяРасходов,
	|	Расходы.АналитикаРасходов,
	|	ДД.Период,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ЗаказКлиента,
	|	ДД.АналитикаУчетаПоПартнерам,
	|	ДД.Подразделение КАК ПодразделениеВыручки,
	|	ДД.ТипЗапасов,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Менеджер,
	|	ДД.Склад,
	|	ДД.Соглашение,
	|	ДД.Договор,
	|	ДД.АналитикаУчетаНаборов,
	|	ДД.НаправлениеДеятельностиКонтрагента,
	|	ДД.НаправлениеДеятельностиНоменклатуры,
	|	ДД.НалогообложениеНДС,
	|	ДД.ВалютаВзаиморасчетов,
	|	ДД.ВалютаДокумента,
	|	ДД.ИсточникГФУНоменклатуры,
	|	ДД.Сторно,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК Расходы
	|	ПО ИСТИНА
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапов_Общие

#Область ПроцедурыПоддержкиРаботыЧерезОВЗ

Процедура ИнициализироватьТаблицуОВЗ(ПараметрыРасчета) Экспорт

	Если РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(ПараметрыРасчета.МенеджерВременныхТаблиц, "ВтОВЗ") Тогда
		Возврат; // ВТ по ОВЗ уже была инициализирована ранее
	КонецЕсли;
	
	РасчетСебестоимостиПротоколРасчета.НачалоЭтапаРасчета(ПараметрыРасчета, "ИнициализироватьТаблицуОВЗ");
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	Запрос.Текст = ТекстВТпоОВЗ();
	Если Не РасчетСебестоимостиПрикладныеАлгоритмы.ВременнаяТаблицаСуществует(Запрос.МенеджерВременныхТаблиц, "ЗначенияПоказателейОВЗ") Тогда
		Запрос.Текст = Запрос.Текст + РасчетСебестоимостиПостатейныеЗатраты.ТекстЗначенияПоказателейРаспределенияНаОВЗ();
	КонецЕсли;
	РасчетСебестоимостиПрикладныеАлгоритмы.ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос, Истина, "ВтОВЗ");
	
КонецПроцедуры

Функция ТекстВТпоОВЗ() Экспорт

	ТекстЗапроса = РасчетСебестоимостиПостатейныеЗатраты.ТекстОписаниеДанныхДляОВЗ();
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ИзменитьПриемникЗапросаОписанияДанных(ТекстЗапроса, "ВтОВЗ");
	Возврат ТекстЗапроса + ";
	|";

КонецФункции

Функция ТекстЗначенияПоказателейРаспределенияНаОВЗ() Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО	КАК Показатель,
	|	НЕОПРЕДЕЛЕНО	КАК ОВЗ,
	|	НЕОПРЕДЕЛЕНО	КАК БазаРаспределения,
	|	НЕОПРЕДЕЛЕНО	КАК ЗначениеПоказателя
	|ПОМЕСТИТЬ ЗначенияПоказателейОВЗ;
	|";
	

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляОВЗ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	0																	КАК НомерУзла,
	|	НЕОПРЕДЕЛЕНО														КАК ОВЗ,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)						КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)				КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовУпр,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовРегл,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)	КАК ВариантРаспределенияРасходовНУ,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовУпр,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовРегл,
	|	ЗНАЧЕНИЕ(Справочник.ПравилаРаспределенияРасходов.ПустаяСсылка)		КАК ПравилоРаспределенияРасходовНУ,
	|	ЛОЖЬ																КАК НеИспользуется,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)		КАК ПустаяСтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)			КАК ПустоеНаправлениеДеятельности,
	|	ИСТИНА																КАК ЭтоОВЗ
	|ПОМЕСТИТЬ Данные
	|";
	
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляТранзитаРасходовМеждуОВЗ() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	НЕОПРЕДЕЛЕНО													КАК ДокументДвижения,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)		КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)	КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО													КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК КорОрганизация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК КорПодразделение,
	|	НЕОПРЕДЕЛЕНО													КАК КорАналитикаРасходов,
	|	0																КАК Вес, 
	|	0																КАК ВесРегл,
	|	0																КАК ПриведенныйВес, 
	|	0																КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ Данные
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОписаниеДанныхДляИсходныхДанныхТранзитаРасходовМеждуОВЗ() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	АВТОНОМЕРЗАПИСИ()												КАК НомерУзла,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)					КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)			КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)		КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)	КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО													КАК АналитикаРасходов,
	|	0																КАК Вес,
	|	0																КАК ВесРегл,
	|	0																КАК ПриведенныйВес, 
	|	0																КАК ПриведенныйВесРегл
	|ПОМЕСТИТЬ Данные
	|";
	
	ТекстЗапроса = РасчетСебестоимостиПрикладныеАлгоритмы.ПодготовитьЗапросОписанияДанных(ТекстЗапроса);

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПараметрыНастроекОтбора

Функция ПолучитьОписаниеГруппОбъектовПоНастройкамОтбора(ТекстПолученияОбъектов, ПараметрыРасчета, ИмяВременнойТаблицыГруппыОбъектов, НедоступныеПоляОтбора = Неопределено) Экспорт
	
	МассивТиповОбъектов = Новый Массив;
	МассивТиповОбъектов.Добавить(Тип("ДокументСсылка.РаспределениеПрочихЗатрат")); // для закрытия периода.
	МассивТиповОбъектов.Добавить(Тип("Число")); // для случаев когда вызывается процедура извне.
	
	ГруппыОбъектов = Новый ТаблицаЗначений;
	ГруппыОбъектов.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число"));
	ГруппыОбъектов.Колонки.Добавить("Объект", Новый ОписаниеТипов(МассивТиповОбъектов));
	
	ОписаниеГрупп = Новый ТаблицаЗначений;
	ОписаниеГрупп.Колонки.Добавить("НомерГруппы", Новый ОписаниеТипов("Число"));
	ОписаниеГрупп.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	ОписаниеГрупп.Колонки.Добавить("ТекстУсловия", Новый ОписаниеТипов("Строка"));
	ОписаниеГрупп.Колонки.Добавить("ПараметрыЗапроса", Новый ОписаниеТипов("Структура"));
	ОписаниеГрупп.Колонки.Добавить("КоличествоПараметров", Новый ОписаниеТипов("Число"));
	
	Если ПараметрыРасчета = Неопределено Тогда
		Возврат ОписаниеГрупп;
	КонецЕсли;
	
	ИндексируемыеПоля = "ТекстУсловия, КоличествоПараметров";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстПолученияОбъектов;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ГруппыСформированыУспешно = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = ОпределитьПараметрыОтбора(Выборка, НедоступныеПоляОтбора);
		
		Если ПараметрыОтбора = Неопределено Тогда
			ГруппыСформированыУспешно = Ложь;
			РеквизитОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "Организация");
			РасчетСебестоимостиПрикладныеАлгоритмы.ЗарегистрироватьПроблемуВыполненияРасчета(ПараметрыРасчета, РеквизитОрганизация,
			НСтр("ru = 'Некорректные условия отбора'"), 
			НСтр("ru = 'В условиях отбора не поддерживается использование дополнительных реквизитов'"),
			Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		НомерГруппы = ОпределитьГруппу(ПараметрыОтбора, ОписаниеГрупп);
		
		НовыйОбъект = ГруппыОбъектов.Добавить();
		НовыйОбъект.НомерГруппы = НомерГруппы;
		НовыйОбъект.Объект = Выборка.Ссылка;
		
		Если НомерГруппы < ОписаниеГрупп.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыОтбора.ПараметрыЗапроса.Количество()>0 Тогда
			Для Каждого ПараметрЗапроса Из ПараметрыОтбора.ПараметрыЗапроса Цикл
				Если ОписаниеГрупп.Колонки.Найти(ПараметрЗапроса.Ключ) = Неопределено Тогда
					ОписаниеГрупп.Колонки.Добавить(ПараметрЗапроса.Ключ);
					ИндексируемыеПоля = СтрШаблон("%1, %2", ИндексируемыеПоля, ПараметрЗапроса.Ключ);
					ОписаниеГрупп.Индексы.Добавить(ИндексируемыеПоля);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеГруппы = ОписаниеГрупп.Добавить();
		ОписаниеГруппы.НомерГруппы = НомерГруппы;
		ОписаниеГруппы.Используется = Истина;
		ОписаниеГруппы.ТекстУсловия = ПараметрыОтбора.ТекстУсловия;
		ОписаниеГруппы.ПараметрыЗапроса = ПараметрыОтбора.ПараметрыЗапроса;
		ОписаниеГруппы.КоличествоПараметров = ПараметрыОтбора.ПараметрыЗапроса.Количество();
		ЗаполнитьЗначенияСвойств(ОписаниеГруппы, ПараметрыОтбора.ПараметрыЗапроса);

		Для Каждого Параметр Из ПараметрыОтбора.ПараметрыЗапроса Цикл
			
			Если Параметр.Ключ = "ПоказательБазыРаспределения" Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПараметра = СформироватьИмяПараметра(Параметр.Ключ, НомерГруппы, ИмяВременнойТаблицыГруппыОбъектов);
			ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Вставить(ИмяПараметра, Параметр.Значение);
			
		КонецЦикла;
		
	КонецЦикла;

	Если Не ГруппыСформированыУспешно Тогда
		ВызватьИсключение НСтр("ru = 'В заданных отборах документов распределения обнаружены неподдерживаемые условия.
									|Зарегистрированы ошибки расчета.'");
	КонецЕсли;
	
	ОписаниеГрупп.Индексы.Очистить();
	ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Вставить(ИмяВременнойТаблицыГруппыОбъектов, ГруппыОбъектов);
	
	Возврат ОписаниеГрупп;
	
КонецФункции

Функция ОпределитьПараметрыОтбора(Выборка, НедоступныеПоляДляОтбора = Неопределено)

	ИмяСхемы = ПравилаРаспределенияПовтИсп.ИмяСхемыБазыРаспределения(Выборка.ТипБазыРаспределения);
	
	ПараметрыОтбора = Новый Структура("ТекстУсловия, ПараметрыЗапроса", "", Новый Структура);
	ПараметрыОтбора.ПараметрыЗапроса.Вставить("ПоказательБазыРаспределения", ИмяСхемы);
	Если ИмяСхемы = "Товары" Тогда
		ПараметрыОтбора.ПараметрыЗапроса.Вставить("ТипАналитикиРасходов", Выборка.ТипАналитикиРасходов);
	КонецЕсли;
	
	ВыборкаНастройкиСхемы = Выборка.НастройкиСхемы; // ХранилищеЗначения
	НастройкиКомпоновкиДанных = ВыборкаНастройкиСхемы.Получить(); // НастройкиКомпоновкиДанных
	Если НастройкиКомпоновкиДанных = Неопределено Тогда
		// Отборы не заданы.
		Возврат ПараметрыОтбора;
	КонецЕсли;
	
	Если Не НедоступныеПоляДляОтбора = Неопределено Тогда
		
		Для Каждого НедоступноеПоле Из НедоступныеПоляДляОтбора Цикл
			ОчиститьНедоступныеПоляИзОтбора(НастройкиКомпоновкиДанных.Отбор.Элементы, НедоступноеПоле);
		КонецЦикла;
		
	КонецЕсли;
	
	УдалитьИзОтбораНекорректныеЗначения(НастройкиКомпоновкиДанных.Отбор.Элементы);
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, НастройкиКомпоновкиДанных);
	НастройкиКомпоновкиДанныхXML = ЗаписьXML.Закрыть();
	
	МакетКомпоновки = ПравилаРаспределенияПовтИсп.МакетКомпоновкиДанных(ИмяСхемы,
		Выборка.ТипБазыРаспределения, НастройкиКомпоновкиДанныхXML);
	
	Если Не МакетКомпоновки.НаборыДанных.Количество() Тогда
		Возврат ПараметрыОтбора;
	КонецЕсли;
	
	ТекстЗапроса = МакетКомпоновки.НаборыДанных[0].Запрос;
	
	ДлинаПрефикса = СтрДлина("ГДЕ");
	НачалоУсловия = СтрНайти(ТекстЗапроса, "ГДЕ") + ДлинаПрефикса;
	Если НачалоУсловия = ДлинаПрефикса Тогда
		ПараметрыОтбора.ТекстУсловия = "";
	Иначе
		ПараметрыОтбора.ТекстУсловия = ТекстУсловияБезФорматирования(
			СокрЛП(Сред(ТекстЗапроса, НачалоУсловия)));
	КонецЕсли;
	
	Если СтрНайти(ПараметрыОтбора.ТекстУсловия, "ДополнительныеРеквизиты.") <> 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Псевдонимы = Неопределено;
	Если ИмяСхемы = "НаправлениеРаспределения" Тогда
		
		Псевдонимы = Новый Соответствие();
		Псевдонимы.Вставить("Подразделение", "Ссылка");
		
	КонецЕсли;
	
	ЗаменитьПустыеЗначенияНаПсевдонимы(ПараметрыОтбора.ТекстУсловия,
		ТекстЗапроса,
		Псевдонимы);
	
	Для Каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		
				ПараметрыОтбора.ПараметрыЗапроса.Вставить(Параметр.Имя, Параметр.Значение);
		
	КонецЦикла;
	
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Процедура УдалитьИзОтбораНекорректныеЗначения(КоллекцияЭлементовОтбора)
	
	Индекс = КоллекцияЭлементовОтбора.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ЭлементОтбора = КоллекцияЭлементовОтбора[Индекс];
		Индекс = Индекс - 1;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") 
				И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке 
				И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
			
			ИндексСписка = ЭлементОтбора.ПравоеЗначение.Количество() - 1;
			Пока ИндексСписка >= 0 Цикл
				Если Не ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение[ИндексСписка].Значение) Тогда 
					ЭлементОтбора.ПравоеЗначение.Удалить(ИндексСписка);
				КонецЕсли;
				ИндексСписка = ИндексСписка - 1;
			КонецЦикла;
			
			Если ЭлементОтбора.ПравоеЗначение.Количество() = 0 Тогда
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьНедоступныеПоляИзОтбора(КоллекцияЭлементовОтбора, ИмяПоля)
	
	Индекс = КоллекцияЭлементовОтбора.Количество() - 1;
	Пока Индекс >= 0 Цикл
		
		ЭлементОтбора = КоллекцияЭлементовОтбора[Индекс];
		Индекс = Индекс - 1;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ОчиститьНедоступныеПоляИзОтбора(ЭлементОтбора.Элементы, ИмяПоля);
			
			Если ЭлементОтбора.Элементы.Количество() = 0 Тогда
				КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(ЭлементОтбора.ЛевоеЗначение, ИмяПоля) Тогда
			КоллекцияЭлементовОтбора.Удалить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьГруппу(НовыеПараметры, ОписаниеГрупп)
	
	// -4 количество начальных колонок в таблице.
	Если ОписаниеГрупп.Колонки.Количество() - 4 < НовыеПараметры.ПараметрыЗапроса.Количество() Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	КлючПоиска = Новый Структура("ТекстУсловия, КоличествоПараметров",
		НовыеПараметры.ТекстУсловия, НовыеПараметры.ПараметрыЗапроса.Количество());
	ЕстьСпискиЗначений = Ложь;
	ВсеПараметрыУстановлены = Истина;
	Для Каждого ПараметрЗапроса Из НовыеПараметры.ПараметрыЗапроса Цикл
		
		Если ТипЗнч(ПараметрЗапроса.Ключ) = Тип("СписокЗначений") Тогда
			
			ЕстьСпискиЗначений = Истина;
			Продолжить;
			
		КонецЕсли;
		
		Если ОписаниеГрупп.Колонки.Найти(ПараметрЗапроса.Ключ) = Неопределено Тогда
			
			ВсеПараметрыУстановлены = Ложь;
			Прервать;
			
		КонецЕсли;
		
		КлючПоиска.Вставить(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		
	КонецЦикла;	
	
	Если Не ВсеПараметрыУстановлены Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	ГруппыУсловия = ОписаниеГрупп.НайтиСтроки(КлючПоиска);
	Если ГруппыУсловия.Количество() = 0 Тогда
		Возврат ОписаниеГрупп.Количество();
	КонецЕсли;
	
	Если Не ЕстьСпискиЗначений И ГруппыУсловия.Количество() = 1 Тогда
		Возврат ГруппыУсловия[0].НомерГруппы;
	КонецЕсли;
	
	НомерГруппы = ОписаниеГрупп.Количество();
	Для Каждого ОписаниеГруппы Из ГруппыУсловия Цикл
		
		ГруппаСоответствует = Истина;
		ИндексПараметра = 0;
		Пока ГруппаСоответствует И ИндексПараметра < НовыеПараметры.ПараметрыЗапроса.Количество() Цикл
			
			НовыйПараметр = НовыеПараметры.ПараметрыЗапроса[ИндексПараметра];
			Если Не ТипЗнч(НовыйПараметр.Значение) = Тип("СписокЗначений") Тогда
				// Поиск по полям ссылочного типа выполнен ранее.
				ИндексПараметра = ИндексПараметра + 1;
				Продолжить;
			КонецЕсли;
			
			ПараметрГруппы = ОписаниеГруппы[НовыйПараметр.Ключ];
			Если Не ТипЗнч(ПараметрГруппы) = ТипЗнч(НовыйПараметр.Значение) Тогда
				ГруппаСоответствует = Ложь;
			Иначе
				
				НовыйПараметр.Значение.СортироватьПоЗначению();
				ГруппаСоответствует = (ПараметрГруппы.Количество() = НовыйПараметр.Значение.Количество());
				
				ИндексЭлемента = 0;
				Пока ИндексЭлемента < ПараметрГруппы.Количество()
					И ГруппаСоответствует Цикл
					
					ГруппаСоответствует = (ПараметрГруппы[ИндексЭлемента].Значение = НовыйПараметр.Значение[ИндексЭлемента].Значение);
					ИндексЭлемента = ИндексЭлемента + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ГруппаСоответствует Тогда
			
			НомерГруппы = ОписаниеГруппы.НомерГруппы;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НомерГруппы;
	
КонецФункции

Функция ТекстУсловияБезФорматирования(Текст)
	
	СимволыКЗамене = Новый Массив;
	СимволыКЗамене.Добавить(Символы.ВК);
	СимволыКЗамене.Добавить(Символы.ВТаб);
	СимволыКЗамене.Добавить(Символы.НПП);
	СимволыКЗамене.Добавить(Символы.ПС);
	СимволыКЗамене.Добавить(Символы.ПФ);
	СимволыКЗамене.Добавить(Символы.Таб);
	
	Для Каждого СимволКЗамене Из СимволыКЗамене Цикл
		Текст = СтрЗаменить(Текст, СимволКЗамене, " ");
	КонецЦикла;
	
	Пока СтрНайти(Текст, "  ") > 0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

Процедура ЗаменитьПустыеЗначенияНаПсевдонимы(ТекстУсловия, Знач ТекстЗапроса, Псевдонимы = Неопределено)
	
	Определитель = "ЗНАЧЕНИЕ(";
	
	Пока СтрНайти(ТекстУсловия, Определитель) > 0 Цикл
		
		НачалоПустогоЗначения = СтрНайти(ТекстУсловия, Определитель);
		ПустоеЗначение = Сред(ТекстУсловия, 
			НачалоПустогоЗначения,
			СтрНайти(ТекстУсловия, ")",, НачалоПустогоЗначения) - НачалоПустогоЗначения + 1);
			
		ПозицияЗапятой = СтрНайти(ТекстЗапроса, ",", , СтрНайти(ТекстЗапроса, ПустоеЗначение));
		ПозицияНачалаПсевдонима = СтрНайти(ТекстЗапроса, " ", НаправлениеПоиска.СКонца, ПозицияЗапятой) + 1;
		
		Если ПозицияЗапятой - ПозицияНачалаПсевдонима <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Псевдоним = Сред(ТекстЗапроса, 
			ПозицияНачалаПсевдонима,
			ПозицияЗапятой - ПозицияНачалаПсевдонима);

		Если Не Псевдонимы = Неопределено
			И Не Псевдонимы.Получить(Псевдоним) = Неопределено Тогда
			Псевдоним = Псевдонимы.Получить(Псевдоним);
		КонецЕсли;
		
		ТекстУсловия = СтрЗаменить(ТекстУсловия, ПустоеЗначение, 
			СтрШаблон("%1.%2", "ИсточникБазы", Псевдоним));
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьИмяПараметра(ИсходноеИмя, НомерГруппы, Этап)
	
	Возврат СтрШаблон("%1_%2_%3", ИсходноеИмя, Формат(НомерГруппы, "ЧН=; ЧГ=0"), Этап);
	
КонецФункции

// Дополняет тексты запросов новыми текстами по описанию групп.
// Параметры:
//	ТекстыЗапросов - Массив - тексты запросов базы распределения в разрезе документов распределения расходов.
//	ОписаниеГрупп - Структура -
//	ИсточникШаблона - Строка - откуда получать шаблон текста запроса.
Процедура ДополнитьТекстамиПоОписаниюГрупп(ТекстыЗапросов, ОписаниеГрупп, ИсточникШаблона) Экспорт
	
	ИспользуемыеШаблоны = Новый Структура;
	ИспользуемыеШаблоны.Вставить("ПоЗаказам", 		 Новый Массив);
	ИспользуемыеШаблоны.Вставить("ПоДекларациям", 	 Новый Массив);
	ИспользуемыеШаблоны.Вставить("ПоДокументам", 	 Новый Массив);
	ИспользуемыеШаблоны.Вставить("ПоСправочникам", 	 Новый Массив);
	ИспользуемыеШаблоны.Вставить("ПоПрочимРасходам", Новый Массив);
	ИспользуемыеШаблоны.Вставить("ПоПереработке", 	 Новый Массив);
	
	ДобавленныеШаблоны = Новый Структура;
	
	Для Каждого ОписаниеГруппы Из ОписаниеГрупп Цикл
		
		ШаблонЗапроса = "";
		Если ИсточникШаблона = "ГруппыОбъектовДополнительныхРасходов" Тогда
			
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "ИсточникБазы.Склад", "АналитикаОтбора.МестоХранения");
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "ИсточникБазы.", "АналитикаОтбора.");
			ОписаниеГруппы.ТекстУсловия = СтрЗаменить(ОписаниеГруппы.ТекстУсловия, "АналитикаОтбора.Партия", "ИсточникБазы.Партия");
			ШаблонЗапроса = ШаблонТекстаПервичныеПриемникиДополнительныхРасходов(ОписаниеГруппы.ПараметрыЗапроса.ТипАналитикиРасходов, ИспользуемыеШаблоны, ОписаниеГруппы.НомерГруппы);
			
		Иначе
			
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИсточникШаблона);
			ШаблонЗапроса = Менеджер.ШаблонТекстаБазыРаспределения(
				ОписаниеГруппы.ПоказательБазыРаспределения);
			
		КонецЕсли;

		Если ЗначениеЗаполнено(ШаблонЗапроса) Тогда
			
			Если ЗначениеЗаполнено(ИспользуемыеШаблоны.ПоДокументам) И НЕ ДобавленныеШаблоны.Свойство("ПоДокументам") Тогда
				
				ТекстыЗапросов.Добавить(ДополнительныеТаблицыДляПриемниковПоДокументам());
				ДобавленныеШаблоны.Вставить("ПоДокументам", ТекстыЗапросов.Количество() - 1);
				
			ИначеЕсли ЗначениеЗаполнено(ИспользуемыеШаблоны.ПоПрочимРасходам) И НЕ ДобавленныеШаблоны.Свойство("ПоПрочимРасходам") Тогда
				
				ТекстыЗапросов.Добавить(ДополнительныеТаблицыДляПриемниковПоПрочимРасходам());
				ДобавленныеШаблоны.Вставить("ПоПрочимРасходам", ТекстыЗапросов.Количество() - 1);
				
			КонецЕсли;
			
			ТекстыЗапросов.Добавить(
				СформироватьТекстЗапросаПоОтбору(
					ШаблонЗапроса, 
					ОписаниеГруппы,
					СтрЗаменить(ИсточникШаблона, ".", "")));
			
		Иначе
			ОписаниеГруппы.Используется = Ложь;
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИспользуемыеШаблоны.ПоДокументам) Тогда
		
		НомераГрупп = "";
		Для Каждого НомерГруппы Из ИспользуемыеШаблоны.ПоДокументам Цикл
			НомераГрупп = НомераГрупп + ?(НомераГрупп = "", "", ", ") + Формат(НомерГруппы, "ЧН=0; ЧГ=");
		КонецЦикла;
		
		ТекстыЗапросов[ДобавленныеШаблоны.ПоДокументам] = СтрЗаменить(
			ТекстыЗапросов[ДобавленныеШаблоны.ПоДокументам], "&ОтборПоГруппамПоДокументам", "Группа.НомерГруппы В (" + НомераГрупп + ")");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстПомещенияГруппыОбъектовВоВременнуюТаблицу(ИмяВременнойТаблицы) Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.НомерГруппы,
		|	Т.Объект
		|ПОМЕСТИТЬ ИмяВременнойТаблицы
		|ИЗ
		|	&ИмяВременнойТаблицы КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерГруппы";
	
	Возврат СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
КонецФункции

Функция СформироватьТекстЗапросаПоОтбору(ШаблонЗапроса, ОписаниеГруппы, ПостфиксПараметра)

	ТекстаЗапроса = СтрЗаменить(ШаблонЗапроса, "&НомерГруппы", Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0"));
	ТекстаЗапроса = СтрЗаменить(ТекстаЗапроса, "ТаблицаДанных",
		СтрШаблон("ТаблицаДанных%1", Формат(ОписаниеГруппы.НомерГруппы, "ЧН=0; ЧГ=0")));
	Если Не ЗначениеЗаполнено(СокрЛП(ОписаниеГруппы.ТекстУсловия)) Тогда
		Возврат СтрЗаменить(ТекстаЗапроса, "&УсловиеСоединения", "ИСТИНА");
	КонецЕсли;
	
	УсловиеДляГруппы = ОписаниеГруппы.ТекстУсловия;

	МассивПараметров = Новый Массив;
	Для Каждого Колонка Из ОписаниеГруппы.Владелец().Колонки Цикл
		
		Если Колонка.Имя = "НомерГруппы"
			Или Колонка.Имя = "ТекстУсловия"
			Или Колонка.Имя = "КоличествоПараметров"
			Или Колонка.Имя = "ИсточникиДополнительныхРеквизитов" Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПараметров.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	ПозицииПараметров = Новый СписокЗначений;

	Индекс = МассивПараметров.ВГраница();
	Пока Индекс >= 0 Цикл
		
		ИмяПараметра = СтрШаблон("&%1", МассивПараметров[Индекс]);
		НовоеИмяПараметра = СформироватьИмяПараметра(ИмяПараметра, ОписаниеГруппы.НомерГруппы, ПостфиксПараметра);
		
		НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра);

		Пока НачальнаяПозиция > 0 Цикл
			
			Если Не ПозицииПараметров.НайтиПоЗначению(НачальнаяПозиция) = Неопределено Тогда
				
				Если НачальнаяПозиция + СтрДлина(ИмяПараметра) > СтрДлина(УсловиеДляГруппы) Тогда
					НачальнаяПозиция = 0;
				Иначе
					НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра, , НачальнаяПозиция + СтрДлина(ИмяПараметра));
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			НоваяПозиция = ПозицииПараметров.Добавить(НачальнаяПозиция);
			
			УсловиеДляГруппы = Лев(УсловиеДляГруппы, НачальнаяПозиция - 1) + НовоеИмяПараметра
				+ Сред(УсловиеДляГруппы, НачальнаяПозиция + СтрДлина(ИмяПараметра));

			ПозицииПараметров.СортироватьПоЗначению();
			ИндексПозиции = ПозицииПараметров.Индекс(НоваяПозиция) + 1;
			Пока ИндексПозиции < ПозицииПараметров.Количество() Цикл
				ПозицииПараметров[ИндексПозиции].Значение = ПозицииПараметров[ИндексПозиции].Значение
					+ СтрДлина(НовоеИмяПараметра) - СтрДлина(ИмяПараметра);
				ИндексПозиции = ИндексПозиции + 1;
			КонецЦикла;
			
			НачальнаяПозиция = СтрНайти(УсловиеДляГруппы, ИмяПараметра, , НачальнаяПозиция + СтрДлина(НовоеИмяПараметра) - 1);
			
		КонецЦикла;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Возврат СтрЗаменить(ТекстаЗапроса, "&УсловиеСоединения", УсловиеДляГруппы);
	
КонецФункции

#КонецОбласти

#Область ПроцедурыЭтапов_Контекстные

// Используется для всех вызовов заполнения расчетной партии.
//
Процедура ЗаполнитьРасчетнуюПартию(ПараметрыРасчета, Контекст, РасчетнаяПартия, Расход, Приход, ПартияЗаполнена) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область Тестирование

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСРаспределениемПартий(СписокЭтапов) Экспорт
	
	// Этап РаспределениеДопРасходовМеждуПартиямиИТоварами пока реализован на нестандартной механике.
	Возврат;
	
КонецПроцедуры

// Дополняет список этапов расчета.
// 
// Параметры:
// 	СписокЭтапов - СписокЗначений - 
//
Процедура ДополнитьЭтапыСТрансляциейПартий(СписокЭтапов) Экспорт
	
	СписокЭтапов.Добавить("РаспределениеОтклоненийВСтоимости"); // пока возможна отладка только 1го шага из 4х
	СписокЭтапов.Добавить("РаспределениеДопРасходовМеждуПартиямиИТоварами"); // пока возможна отладка только 1го шага из 4х

	СписокЭтапов.Добавить("РаспределениеПостатейныхРасходовНаПродажу");
	
КонецПроцедуры

Процедура ТекстЗапросаДляРасчетаЭтапа(ИмяЭтапа, ПараметрыРасчета, ТекстЗапроса) Экспорт
	
	Если ИмяЭтапа = "РаспределениеОтклоненийВСтоимости" Тогда
		ТекстЗапроса = ТекстРаспределенияОтклоненийВСтоимостиСебестоимостьТоваров(ПараметрыРасчета);
	ИначеЕсли ИмяЭтапа = "РаспределениеДопРасходовМеждуПартиямиИТоварами" Тогда
		ТекстЗапроса = ТекстЗапросаДляРаспределенияДополнительныхРасходов(ПараметрыРасчета) + "
			|;
			|" + СтрЗаменить(ДополнительныеТаблицыДляПриемниковПоДокументам(), "&ОтборПоГруппамПоДокументам", "ИСТИНА") + "
			|;
			|" + ДополнительныеТаблицыДляПриемниковПоПрочимРасходам();
	ИначеЕсли ИмяЭтапа = "РаспределениеПостатейныхРасходовНаПродажу" Тогда
		ТекстЗапроса = ТекстЗапросаРаспределениеРасходовНаПродажи(ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ОбъединитьТексты(ТекстыЗапросов, Разделитель = "")
	
	Если ПустаяСтрока(Разделитель) Тогда
		Разделитель = ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении();
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыЗапросов, Разделитель);
	
КонецФункции


#КонецОбласти
