/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Механизм партионного учета версии 2.2
//
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОтразитьВМеханизмеУчетаЗатратИСебестоимости(Документ, Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(
				Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя, Регистры)
			И Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(
				Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(Метаданные.РегистрыНакопления.СебестоимостьТоваров.Имя, Регистры)
	 И НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж.Имя, Регистры) Тогда
	 	Возврат;
	КонецЕсли;
	
	Для Каждого ТекущийЭлемент Из ТекстыЗапроса Цикл
		Если ТекущийЭлемент.Представление = "СебестоимостьТоваров" Тогда
			ТекстыЗапроса.Удалить(ТекущийЭлемент);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	МетаДокумент = Метаданные.НайтиПоТипу(ТипЗнч(Документ));
	
	Если МетаДокумент = Неопределено ИЛИ НЕ Метаданные.Документы.Содержит(МетаДокумент) Тогда
		ВызватьИсключение НСтр("ru='Не удалось определить тип документа'");
	КонецЕсли;
	
	ПараметрыОтражения = Новый Структура;
	// Описание документа.
	ПараметрыОтражения.Вставить("Документ", 			Документ);
	ПараметрыОтражения.Вставить("МетаданныеДокумента", 	МетаДокумент);
	ПараметрыОтражения.Вставить("МенеджерДокумента", 	МенеджерОбъектаПоСсылке(Документ));
	// Параметры проведения документа.
	ПараметрыОтражения.Вставить("Запрос", 				Запрос);
	ПараметрыОтражения.Вставить("ТекстыЗапроса", 		ТекстыЗапроса);
	ПараметрыОтражения.Вставить("Регистры", 			Регистры);
	// Регистры для отражения.
	ПараметрыОтражения.Вставить("РегистрыДляОтражения", Новый Структура);
	
	ОписаниеДополнительныхПараметров = Неопределено;
	ОписаниеДополнительныхТаблиц = Неопределено;
	
	// Себестоимость
	МетаданныеРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров;
	ИмяРегистра 	   = МетаданныеРегистра.Имя;
	
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, ПараметрыОтражения.Регистры)
	 И ПараметрыОтражения.МенеджерДокумента.ОписаниеРегистровУчетаЗатратИСебестоимости(ПараметрыОтражения.Документ).Найти(МетаданныеРегистра) <> Неопределено Тогда
		
		ПараметрыОтражения.Вставить("ИмяРегистра", ИмяРегистра);
		
		ОписаниеРегистра = Новый Структура;
	
		// Получим данные для отражения документа.
		ОписаниеДополнительныхПараметров = ПараметрыОтражения.МенеджерДокумента.УстановитьДополнительныеПараметрыОперацийУчетаЗатратИСебестоимости(
			ПараметрыОтражения.Документ,
			ПараметрыОтражения.Запрос);
		ОписаниеДополнительныхТаблиц = ПараметрыОтражения.МенеджерДокумента.СформироватьДополнительныеТаблицыОперацийУчетаЗатратИСебестоимости(
			ПараметрыОтражения.Документ,
			ПараметрыОтражения.Запрос,
			ПараметрыОтражения.ТекстыЗапроса);
		ОписаниеОперацийДокумента = ПараметрыОтражения.МенеджерДокумента.ОписаниеОперацийУчетаСебестоимости(
			ПараметрыОтражения.Документ);
		
		ОписаниеРегистра.Вставить("МетаданныеРегистра", 			  МетаданныеРегистра);
		ОписаниеРегистра.Вставить("ПоляРегистра", 			  		  ВсеПоляРегистра(МетаданныеРегистра));
		ОписаниеРегистра.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
		ОписаниеРегистра.Вставить("ОписаниеДополнительныхТаблиц", 	  ОписаниеДополнительныхТаблиц);
		ОписаниеРегистра.Вставить("ОписаниеОперацийДокумента", 		  ОписаниеОперацийДокумента);
		
		ПараметрыОтражения.РегистрыДляОтражения.Вставить(ИмяРегистра, ОписаниеРегистра);
		
		// Сформируем тексты запросов для отражения в учете себестоимости.
		ОтразитьОперацииВУчетеСебестоимости(ПараметрыОтражения);
		
	КонецЕсли;
	
	// Выручка
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж;
	ИмяРегистра 	   = МетаданныеРегистра.Имя;
	
	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, ПараметрыОтражения.Регистры)
	 И ПараметрыОтражения.МенеджерДокумента.ОписаниеРегистровУчетаЗатратИСебестоимости(ПараметрыОтражения.Документ).Найти(МетаданныеРегистра) <> Неопределено Тогда
	
		ПараметрыОтражения.Вставить("ИмяРегистра", ИмяРегистра);
		
		ОписаниеРегистра = Новый Структура;
		
		Если НЕ ЗначениеЗаполнено(ОписаниеДополнительныхПараметров) Тогда
			ОписаниеДополнительныхПараметров = ПараметрыОтражения.МенеджерДокумента.УстановитьДополнительныеПараметрыОперацийУчетаЗатратИСебестоимости(
				ПараметрыОтражения.Документ,
				ПараметрыОтражения.Запрос);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОписаниеДополнительныхТаблиц) Тогда
			ОписаниеДополнительныхТаблиц = ПараметрыОтражения.МенеджерДокумента.СформироватьДополнительныеТаблицыОперацийУчетаЗатратИСебестоимости(
				ПараметрыОтражения.Документ,
				ПараметрыОтражения.Запрос,
				ПараметрыОтражения.ТекстыЗапроса);
		КонецЕсли;
		
		ОписаниеОперацийДокумента = ПараметрыОтражения.МенеджерДокумента.ОписаниеОперацийУчетаВыручки(
			ПараметрыОтражения.Документ);
		
		ОписаниеРегистра.Вставить("МетаданныеРегистра", 			  МетаданныеРегистра);
		ОписаниеРегистра.Вставить("ОписаниеДополнительныхПараметров", ОписаниеДополнительныхПараметров);
		ОписаниеРегистра.Вставить("ОписаниеДополнительныхТаблиц", 	  ОписаниеДополнительныхТаблиц);
		ОписаниеРегистра.Вставить("ОписаниеОперацийДокумента", 		  ОписаниеОперацийДокумента);
		
		ПараметрыОтражения.РегистрыДляОтражения.Вставить(ИмяРегистра, ОписаниеРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет описание операции для отражения.
//
// Параметры:
//	ОписаниеОпераций - Массив -
//	ВидОперации  - ПеречислениеСсылка.ОперацииУчетаСебестоимости -
//	ТекстЗапроса - Строка -
//	ОписаниеОперации - Строка -
//	
Процедура ДобавитьОписаниеОперацииДляОтраженияВУчетеСебестоимости(ОписаниеОпераций, ВидОперации, ТекстЗапроса, ОписаниеОперации = "") Экспорт
	
	ТекущаяОперация = Новый Структура;
	
	ТекущаяОперация.Вставить("ВидОперации",  	 ВидОперации);
	ТекущаяОперация.Вставить("ТекстЗапроса", 	 ТекстЗапроса);
	ТекущаяОперация.Вставить("НомерОперации", 	 0);
	ТекущаяОперация.Вставить("ОписаниеОперации", ОписаниеОперации);
	
	ОписаниеОпераций.Добавить(ТекущаяОперация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписаниеОпераций

Функция СформироватьОписаниеОперации(МетаданныеРегистра) Экспорт
	
	Описание = Новый Структура;
	Поля 	 = Новый Массив;
	
	// Общие и служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "Период");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "Ссылка");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "КорректируемыйДокумент");
	
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "ХозяйственнаяОперация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "ИдентификаторФинЗаписи");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, "НастройкаХозяйственнойОперации");
	
	Описание.Вставить("Поля", Поля);
	Описание.Вставить("ВидОперации", Неопределено);
	
	Возврат Описание;
	
КонецФункции

Процедура ДобавитьОписаниеПоляОперации(МетаданныеРегистра, Поля, ИмяПоля, ТипПоляПоУмолчанию = Неопределено, Дополнительное = Ложь)
	
	ОписаниеПоля = Новый Структура;
	ОписаниеПоля.Вставить("Имя", ИмяПоля);
	
	ТипПоля = Неопределено;
	
	Если ТипПоляПоУмолчанию <> Неопределено Тогда
		
		ТипПоля = ТипПоляПоУмолчанию;
		
	ИначеЕсли НРег(ИмяПоля) = НРег("Период") Тогда
		
		ТипПоля = МетаданныеРегистра.СтандартныеРеквизиты["Период"].Тип;
		
	ИначеЕсли НРег(ИмяПоля) = НРег("Ссылка") Тогда
		
		ТипПоля = МетаданныеРегистра.СтандартныеРеквизиты["Регистратор"].Тип;
		
	Иначе
		
		МетаданныеПоля = МетаданныеРегистра.Измерения.Найти(ИмяПоля);
		
		Если МетаданныеПоля <> Неопределено Тогда
			ТипПоля = МетаданныеПоля.Тип;
		Иначе
			
			МетаданныеПоля = МетаданныеРегистра.Ресурсы.Найти(ИмяПоля);
			
			Если МетаданныеПоля <> Неопределено Тогда
				ТипПоля = МетаданныеПоля.Тип;
			Иначе
				
				МетаданныеПоля = МетаданныеРегистра.Реквизиты.Найти(ИмяПоля);
				
				Если МетаданныеПоля <> Неопределено Тогда
					ТипПоля = МетаданныеПоля.Тип;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеПоля.Вставить("Тип", ТипПоля);
	ОписаниеПоля.Вставить("Дополнительное", Дополнительное);
	
	Поля.Добавить(ОписаниеПоля);
	
КонецПроцедуры

Процедура ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации, ГруппаПродукцииОбязательна = Истина)
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"Сделка",
		Новый ОписаниеТипов("СправочникСсылка.СделкиСКлиентами"));
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"Подразделение",
		Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"Менеджер",
		Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"ГруппаПродукции",
		Новый ОписаниеТипов("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры"),
		НЕ ГруппаПродукцииОбязательна);
	
КонецПроцедуры

Процедура ДобавитьОписаниеСуммовыхПолейСебестоимости(МетаданныеРегистра, ОписаниеОперации)
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.Стоимость.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьБезНДС.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьРегл.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Реквизиты.НДСРегл.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьУпр.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Реквизиты.НДСУпр.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьЗабалансовая.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьЗабалансоваяРегл.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ДопРасходы.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ДопРасходыБезНДС.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ДопРасходыРегл.Имя);
		
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ДопРасходыУпр.Имя);
		
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ПостояннаяРазница.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.ВременнаяРазница.Имя);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Реквизиты.КорСтоимость.Имя);
	
КонецПроцедуры

Процедура ДобавитьОписаниеСуммовыхПолейСебестоимостиСокращенная(МетаданныеРегистра, ОписаниеОперации, Дополнительное = Ложь)
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.Стоимость.Имя,,
		Дополнительное);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьБезНДС.Имя,,
		Дополнительное);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьРегл.Имя,,
		Дополнительное);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьУпр.Имя,,
		Дополнительное);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Реквизиты.КорСтоимость.Имя,,
		Дополнительное);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьЗабалансовая.Имя,
		,
		Истина);
	
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		Метаданные.РегистрыНакопления.СебестоимостьТоваров.Ресурсы.СтоимостьЗабалансоваяРегл.Имя,
		,
		Истина);
	
КонецПроцедуры

Функция ЕстьПолеТаблицыДанные(ПараметрыОтражения, ИмяПоля)
	
	ИмяРегистра = ПараметрыОтражения.ИмяРегистра;
	КолонкиТаблицыДанные = ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].КолонкиТаблицыДанные;
	
	Возврат КолонкиТаблицыДанные.Свойство(ИмяПоля);
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиВнешнееПоступление(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ДокументИсточник");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ПериодДокументаИсточника", Новый ОписаниеТипов("Дата"));
	
	// Поля аналитики учета партий.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПартий");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаПартий");
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"Поставщик",
		Метаданные.Справочники.КлючиАналитикиУчетаПартий.Реквизиты.Поставщик.Тип);
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"Контрагент",
		Метаданные.Справочники.КлючиАналитикиУчетаПартий.Реквизиты.Контрагент.Тип);
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"СтавкаНДС",
		Метаданные.Справочники.КлючиАналитикиУчетаПартий.Реквизиты.СтавкаНДС.Тип);
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	ДобавитьОписаниеСуммовыхПолейСебестоимости(МетаданныеРегистра, ОписаниеОперации);
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации, Ложь);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ТипЗаписи",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия",, Истина);
	
	// Для неотфактурованной поставки работ и услуг
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтатьяРасходовСписания",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаРасходов",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорНаправлениеДеятельности",, Истина);
	
	// Используются только в документе "Ввод остатков товаров".
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РезервПодОбесценениеРегл",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РезервПодОбесценениеУпр",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиВнутреннееПоступление(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ДокументИсточник");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ПериодДокументаИсточника", Новый ОписаниеТипов("Дата"));
	
	// Поля аналитики учета партий.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПартий");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаПартий");
	ДобавитьОписаниеПоляОперации(
		МетаданныеРегистра,
		ОписаниеОперации.Поля,
		"КодСтроки",
		Метаданные.Справочники.КлючиАналитикиУчетаПартий.Реквизиты.КодСтроки.Тип);
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	ДобавитьОписаниеПоляОперации(
			МетаданныеРегистра,
			ОписаниеОперации.Поля,
			"КорГруппаПродукции",
			Новый ОписаниеТипов("СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры"));
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	ДобавитьОписаниеСуммовыхПолейСебестоимости(МетаданныеРегистра, ОписаниеОперации);
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидДеятельностиНДС",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ТипЗаписи",, Истина);
	// Используются только в документе "Ввод остатков товаров".
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РезервПодОбесценениеРегл",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РезервПодОбесценениеУпр",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиВыбытиеПоФиксированнойСтоимости(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ДокументИсточник");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ПериодДокументаИсточника", Новый ОписаниеТипов("Дата"));
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтатьяРасходовАктивов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаРасходовАктивов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтатьяДоходов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаДоходов");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	ДобавитьОписаниеСуммовыхПолейСебестоимостиСокращенная(МетаданныеРегистра, ОписаниеОперации);
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ТипЗаписи",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПоПартнерам",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиПеремещение(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорОрганизация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	ДобавитьОписаниеСуммовыхПолейСебестоимостиСокращенная(МетаданныеРегистра, ОписаниеОперации, Истина);
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПартий",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ЗаказКлиента",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПоПартнерам",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиРеализация(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ДокументИсточник");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ПериодДокументаИсточника", Новый ОписаниеТипов("Дата"));
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорОрганизация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаПартий");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПоПартнерам");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ЗаказКлиента");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтоимостьЗабалансовая",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтоимостьЗабалансоваяРегл",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ТипЗаписи",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидДеятельностиНДС",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиСписаниеНаДругиеПартии(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорОрганизация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаПартий",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииСебестоимостиСписаниеНаРасходыАктивы(ПараметрыОтражения) Экспорт
	
	МетаданныеРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].МетаданныеРегистра;
	ОписаниеОперации   = СформироватьОписаниеОперации(МетаданныеРегистра);
	
	// Служебные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ДокументИсточник");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ПериодДокументаИсточника", Новый ОписаниеТипов("Дата"));
	
	// Поля учета номенклатуры.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Организация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДС");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ВидДеятельностиНДСДокумента");
	
	// Корреспондирующие поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорОрганизация");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаНоменклатуры");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорВидЗапасов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтатьяРасходовАктивов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаРасходовАктивов");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорНаправлениеДеятельности");
	
	// Количественные и суммовые показатели.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Количество");
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ИдентификаторСтроки");
	
	// Поля аналитики финансового учета.
	ДобавитьОписаниеПолейАналитикиФинансовогоУчета(МетаданныеРегистра, ОписаниеОперации);
	
	// Необязательные поля.
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "РазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорРазделУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Партия",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПартий",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорПартия",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "КорАналитикаУчетаПартий",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "Стоимость",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтоимостьБезНДС",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтоимостьРегл",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "СтоимостьУпр",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ТипЗаписи",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "НастройкаСчетовУчета",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "АналитикаУчетаПоПартнерам",, Истина);
	ДобавитьОписаниеПоляОперации(МетаданныеРегистра, ОписаниеОперации.Поля, "ЗаказКлиента",, Истина);
	
	Возврат ОписаниеОперации;
	
КонецФункции


Функция ПолучитьОписаниеОперации(ПараметрыОтражения, ВидОперации) Экспорт
	
	Если ВидОперации = Перечисления.ОперацииУчетаСебестоимости.ВнешнееПоступление Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиВнешнееПоступление(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.ВнутреннееПоступление Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиВнутреннееПоступление(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.ВыбытиеПоФиксированнойСтоимости Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиВыбытиеПоФиксированнойСтоимости(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.Перемещение Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиПеремещение(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.Реализация Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиРеализация(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиСписаниеНаДругиеПартии(ПараметрыОтражения);
	ИначеЕсли ВидОперации = Перечисления.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы Тогда
		ОписаниеОперации = ОписаниеОперацииСебестоимостиСписаниеНаРасходыАктивы(ПараметрыОтражения);
	Иначе
		ОписаниеОперации = Неопределено;
	КонецЕсли;
	
	Если ОписаниеОперации <> Неопределено Тогда
		ОписаниеОперации.ВидОперации = ВидОперации;
	КонецЕсли;
	
	Возврат ОписаниеОперации;
	
КонецФункции

#КонецОбласти

#Область ТекстыОперацийСебестоимость

#Область Описание_ТекстыОперацийСебестоимость

// Описываются общие правила заполнения полей в движениях по регистру "Себестоимость товаров".
// 
// Правила заполнения поля "РазделУчета":
// - "ТоварыПереданныеПереработчику" - если тип места хранения справочник "ДоговорыКонтрагентов" с типом договора "СПереработчиком2_5"
// 		или "СПереработчиком2_5_ЕАЭС". 
// - "НезавершенноеПроизводство" - если в поле "Партия" указана ссылка на справочник "ПартииПроизводства".
//		Партии производства могут быть отражены только в этом разделе учета.
// - "СобственныеТоварыВПути" - если тип запасов "СобственныйТоварВПути".
// - "НеотфактурованныеПоставки" - если тип запасов "СобственныйТоварПоНеотфактурованнойПоставке"
// 		Для работ и услуг нет явного признака для отражения в разделе "НеотфактурованныеПоставки", поэтому для работ и услуг
// 		раздел учета должен быть определен из документа.
//
// Заполнение раздела учета в зависимости от типа запасов и типа места хранения
// - Тип запасов "ТоварНаХраненииСПравомПродажи"
//	- место хранения "Склад"				- "ТоварыНаХраненииСПравомПродажи"
//	- место хранения "Подразделение"		- "ТоварыНаХраненииСПравомПродажи"
//	- место хранения "Партнер"				- нет, такие товары не передаются на комиссию
//	- место хранения "Организация"			- нет, такие товары не передаются на комиссию
//	- место хранения "ДоговорКонтрагента"	- "ТоварыНаХраненииСПравомПродажиПереданныеПартнерам"
//	- по списку хоз. операций (нет простого условия) - "ТоварыНаХраненииСПравомПродажиКОформлениюСписания"

#КонецОбласти

// Формирует запрос для проведения документа по регистру СебестоимостьТоваров.
//
// Параметры:
//	ОписаниеОпераций - Массив - массив операций
//
Процедура ОтразитьОперацииВУчетеСебестоимости(ПараметрыОтражения)
	
	ИмяРегистра 	   			= ПараметрыОтражения.ИмяРегистра;
	ОписаниеОперацийДокумента   = ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].ОписаниеОперацийДокумента;
	
	НомерОперации = 0;
	
	ВидыОперацийДокумента  = Новый Соответствие;
	СхемыЗапросовДокумента = Новый Массив;
	
	ТаблицаПолей = Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("Имя");
	ТаблицаПолей.Колонки.Добавить("Тип");
	ТаблицаПолей.Колонки.Добавить("ПрисутствуетВОперациях");
	ТаблицаПолей.Колонки.Добавить("Дополнительное");
	
	КолонкиТаблицыДанные = Новый Структура;
	
	Для Каждого ТекущаяОперацияДокумента Из ОписаниеОперацийДокумента Цикл
		
		ТекущаяОперацияДокумента.НомерОперации = НомерОперации;
		НомерОперации = НомерОперации + 1;
		
		// Разберем схему запроса текущей операции.
		РазборСхемыЗапроса = Новый Структура;
		
		Попытка
			
			РазборСхемыЗапроса.Вставить("СхемаЗапроса", Новый СхемаЗапроса);
			
			РазборСхемыЗапроса.СхемаЗапроса.УстановитьТекстЗапроса(ТекущаяОперацияДокумента.ТекстЗапроса);
			
			РазборСхемыЗапроса.Вставить("ОписаниеЗапроса", РазборСхемыЗапроса.СхемаЗапроса.ПакетЗапросов[РазборСхемыЗапроса.СхемаЗапроса.ПакетЗапросов.Количество() - 1]);
			РазборСхемыЗапроса.Вставить("КолонкиЗапроса", Новый Структура);
			
			Для Каждого ТекущаяКолонка Из РазборСхемыЗапроса.ОписаниеЗапроса.Колонки Цикл
				РазборСхемыЗапроса.КолонкиЗапроса.Вставить(ТекущаяКолонка.Псевдоним);
			КонецЦикла;
			
			РазборСхемыЗапроса.Вставить("ВидОперации", ТекущаяОперацияДокумента.ВидОперации);
			
		Исключение

			ТекстОшибки = НСтр("ru='Невозможно выполнить разбор схемы запроса №%1 движений документа %2 по регистру %3'") + ":
				|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибки,
				НомерОперации,
				ПараметрыОтражения.МетаданныеДокумента.Имя,
				ПараметрыОтражения.ИмяРегистра);
				
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
		СхемыЗапросовДокумента.Добавить(РазборСхемыЗапроса);
		
		// Заполним описание полей для всех типов используемых операций
		ОписаниеОперации = ВидыОперацийДокумента.Получить(ТекущаяОперацияДокумента.ВидОперации);
		ЕстьОписаниеОперации = (ОписаниеОперации <> Неопределено);
		
		Если НЕ ЕстьОписаниеОперации Тогда
			ОписаниеОперации = ПолучитьОписаниеОперации(ПараметрыОтражения, ТекущаяОперацияДокумента.ВидОперации);
		КонецЕсли;
		
		ПроверитьПоляЗапросаВыборкиДанных(ПараметрыОтражения, ОписаниеОперации, РазборСхемыЗапроса);
		
		Если ЕстьОписаниеОперации Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеОперации = Неопределено Тогда
			
			ТекстОшибки = НСтр("ru='Некорректная операция учета себестоимости для документа ""%1""'");
			
			Если ЗначениеЗаполнено(ПараметрыОтражения.Документ) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибки,
					СокрЛП(ПараметрыОтражения.Документ));
			Иначе
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ТекстОшибки,
					ПараметрыОтражения.МетаданныеДокумента);
				
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки; // некорректная операция учета себестоимости
			
		КонецЕсли;
		
		Для Каждого ОписаниеПоля Из ОписаниеОперации.Поля Цикл
			
			Если КолонкиТаблицыДанные.Свойство(ОписаниеПоля.Имя) Тогда
				СтрокаПоля = ТаблицаПолей[КолонкиТаблицыДанные[ОписаниеПоля.Имя]];
			Иначе
				СтрокаПоля = Неопределено;
			КонецЕсли;
			
			Если СтрокаПоля = Неопределено Тогда
				
				СтрокаПоля = ТаблицаПолей.Добавить();
				СтрокаПоля.Имя = ОписаниеПоля.Имя;
				СтрокаПоля.Тип = ?(ОписаниеПоля.Тип = Неопределено, Новый ОписаниеТипов, ОписаниеПоля.Тип);
				СтрокаПоля.ПрисутствуетВОперациях = Новый Соответствие;
				СтрокаПоля.Дополнительное = Новый Соответствие;
				
				КолонкиТаблицыДанные.Вставить(ОписаниеПоля.Имя, ТаблицаПолей.Количество() - 1);
				
			Иначе
				
				Если ОписаниеПоля.Тип <> Неопределено Тогда
					СтрокаПоля.Тип = Новый ОписаниеТипов(СтрокаПоля.Тип, ОписаниеПоля.Тип.Типы());
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаПоля.ПрисутствуетВОперациях.Вставить(ТекущаяОперацияДокумента.ВидОперации, Истина);
			
			Если ОписаниеПоля.Дополнительное Тогда
				СтрокаПоля.Дополнительное.Вставить(ТекущаяОперацияДокумента.ВидОперации, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		ВидыОперацийДокумента.Вставить(ТекущаяОперацияДокумента.ВидОперации, ОписаниеОперации);
		
	КонецЦикла;
	
	ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].Вставить("ТаблицаПолей",  			ТаблицаПолей);
	ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].Вставить("КолонкиТаблицыДанные",  	КолонкиТаблицыДанные);
	ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].Вставить("СхемыЗапросовДокумента",	СхемыЗапросовДокумента);
	ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].Вставить("ВидыОперацийДокумента", 	ВидыОперацийДокумента);
	
	ПараметрыОтражения.Вставить("ТекстыШаблоновОтражения",  	 Новый Структура);
	ПараметрыОтражения.Вставить("ТекстыШаблоновВТ", 			 Новый Структура);
	ПараметрыОтражения.Вставить("ТекстыЗапросовДанныхДокумента", Новый Структура);
	
	ДобавитьТекстЗапросаТаблицыДанные(ПараметрыОтражения);
	ДобавитьТекстЗапросаФормированияАналитикНоменклатуры(ПараметрыОтражения);
	ДобавитьТекстЗапросаФормированияАналитикиФинансовогоУчета(ПараметрыОтражения);
	ДобавитьТекстЗапросаУчетныеПолитики(ПараметрыОтражения);
	ДобавитьТекстЗапросаРазделУчета(ПараметрыОтражения);
	
	Для Каждого ТекущаяОперацияДокумента Из ВидыОперацийДокумента Цикл
		
		// Сформируем текст запроса формирвоания временной таблицы отражения операции документа.
		Если ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.ВнешнееПоступление Тогда
			ОтразитьОперациюСебестоимостиВнешнееПоступление(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.ВнутреннееПоступление Тогда
			ОтразитьОперациюСебестоимостиВнутреннееПоступление(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.ВыбытиеПоФиксированнойСтоимости Тогда
			ОтразитьОперациюСебестоимостиВыбытиеПоФиксированнойСтоимости(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.Перемещение Тогда
			ОтразитьОперациюСебестоимостиПеремещение(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.Реализация Тогда
			ОтразитьОперациюСебестоимостиРеализация(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии Тогда
			ОтразитьОперациюСебестоимостиСписаниеНаДругиеПартии(ПараметрыОтражения);
		ИначеЕсли ТекущаяОперацияДокумента.Ключ = Перечисления.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы Тогда
			ОтразитьОперациюСебестоимостиСписаниеНаРасходыАктивы(ПараметрыОтражения);
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавим текст запроса выборки данных документа.
	ДобавитьТекстЗапросаФормированияДвижений(ПараметрыОтражения);
	
	УстановитьКонстантыПараметрыЗапроса(ПараметрыОтражения);
	
	// Дополним тексты запросов для проведения документа.
	ПроведениеДокументов.ДополнитьЗапросОтраженияДокумента(
		ПараметрыОтражения.Запрос,
		ПараметрыОтражения.ТекстыЗапроса,
		ПараметрыОтражения.ТекстыШаблоновОтражения,
		ПараметрыОтражения.ТекстыЗапросовДанныхДокумента,
		ПараметрыОтражения.ТекстыШаблоновВТ);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиВнешнееПоступление(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка))
	|		  И ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|		  И ДанныеДокумента.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику))
	|		  И ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ПриобретениеТоваровУслуг))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 																КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПереданныхНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		 И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПолученныхНаКомиссию) 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхВПроизводство)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//++ Устарело_Переработка24
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	//-- Устарело_Переработка24
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаХранениеСПравомПродажи),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемкаПодПринципала))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная.Назначение.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|		 И ДанныеДокумента.АналитикаУчетаНоменклатуры.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|		ТОГДА ДанныеДокумента.КорРазделУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 						КАК Количество,
	|	ДанныеДокумента.Стоимость						КАК Стоимость,
	|	ДанныеДокумента.СтоимостьБезНДС					КАК СтоимостьБезНДС,
	|	ДанныеДокумента.СтоимостьРегл					КАК СтоимостьРегл,
	|	ДанныеДокумента.НДСРегл							КАК НДСРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьУпр,
	|	ДанныеДокумента.НДСУпр							КАК НДСУпр,
	|	ДанныеДокумента.СтоимостьЗабалансовая			КАК СтоимостьЗабалансовая,
	|	ДанныеДокумента.СтоимостьЗабалансоваяРегл		КАК СтоимостьЗабалансоваяРегл,
	|	ДанныеДокумента.ДопРасходы						КАК ДопРасходы,
	|	ДанныеДокумента.ДопРасходыБезНДС				КАК ДопРасходыБезНДС,
	|	ДанныеДокумента.ДопРасходыРегл					КАК ДопРасходыРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ДопРасходыУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК ДопРасходыУпр,
	|	ДанныеДокумента.ПостояннаяРазница				КАК ПостояннаяРазница,
	|	ДанныеДокумента.ВременнаяРазница				КАК ВременнаяРазница,
	|	ДанныеДокумента.РезервПодОбесценениеРегл		КАК РезервПодОбесценениеРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.РезервПодОбесценениеУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК РезервПодОбесценениеУпр,
	|	ДанныеДокумента.КорСтоимость					КАК КорСтоимость,
	|
	// Поля партионного учета версии 2.2
	// Поля "Партия" и "Аналитика учета партий" заполняются всегда в разделах "Неотфактурованные поставки" и "Собственные товары в пути (от поставщиков)".
	// Для товаров раздел учета определяется по типу запасов, для работ и услуг - по разделу учета, определяемому в документе. 
	|	ВЫБОР
	|		КОГДА &Константа_ПартионныйУчетВерсии22
	|	  	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  	  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|	 	  ИЛИ ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути)
	|	 	  ИЛИ ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|		  ИЛИ ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			И ДанныеДокумента.РазделУчета В (
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути))
	|			ТОГДА ДанныеДокумента.Партия
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК Партия,
	|	ВЫБОР
	|		КОГДА &Константа_ПартионныйУчетВерсии22
	|		  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|	 	  ИЛИ ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути)
	|	 	  ИЛИ ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|		  ИЛИ ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			И ДанныеДокумента.РазделУчета В (
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути))
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И НЕ УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|	  КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыСПартией),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыБезПартии))
	|			ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И НЕ ЕСТЬNULL(ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		КОГДА &Константа_ПартионныйУчетВерсии22 И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковСобственныхТоваров) 
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И НЕ ЕСТЬNULL(ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|	  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|	  КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 																				КАК ВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДСДокумента,
	|	ВЫБОР
	|	  КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыСПартией),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыБезПартии),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|	  КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка))
	|			ТОГДА ВЫБОР КОГДА &Константа_ИспользоватьУчетНДС
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			КОНЕЦ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ТипЗаписи
	|			ТОГДА ДанныеДокумента.ТипЗаписи
	//++ Локализация
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.ЗаявлениеОВвозеТоваров)
	|			ТОГДА ВЫБОР
	|				КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости)
	|				КОНЕЦ
	//-- Локализация
	
	// Заполнение типа записей для неотфактурованной поставки
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСНеотфактурованнаяПоставка),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаНеотфактурованнаяПоставка))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	// При коррективки стоимости тип записи должен быть "Доп расходы (указана партия)", т.к. при такой корректировке заполнение
	// партионных измерений в себестоимости товаров нужно выполнить по движениям документа - источника (документа 
	// приобретения товаров и услуг на фактуровку поставки).
	|		КОГДА (ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|		 ИЛИ ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))) // для работ и услуг
	|		 И ДанныеДокумента.Количество = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
	// При фактуровке поставки тип записи должен быть "Потребление", т.к. для фактуровки подбирается партия, образованная
	// документами "Поступление товаров на склад" и "Поступление услуг в подразделение". 
	|		КОГДА (ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке) 
	|		 ИЛИ ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))) // для работ и услуг
	|		 И ДанныеДокумента.Количество > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	// При уменьшении количества фактуровки поставки тип записи должен быть "Стороно потребления", т.к. для такой корректировки подбираются
	// партии, списанные документом - основанием "Приобретение товаров и услуг".
	|		КОГДА (ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке) 
	|		 ИЛИ ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))) // для работ и услуг
	|		 И ДанныеДокумента.Количество < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноПотребления)
	|
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыБезПартии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыСПартией)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику))
	|		  И ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (
	|				ТИП(Документ.ПриобретениеТоваровУслуг))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|		  И ДанныеДокумента.Количество = 0
	|		  И ДанныеДокумента.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|		  И ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  И &Константа_ПартионныйУчетВерсии22
	|	  	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПриобретенияПрошлогоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретенияПрошлогоПериода)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеПоВозврату),
	//++ Устарело_Переработка24
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтДавальца),
	//-- Устарело_Переработка24
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтДавальца2_5))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		КОГДА &Константа_ПартионныйУчетВерсии22
	|	  	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		  ИЛИ ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (
	|			ТИП(Документ.ВводОстатков),
	|			ТИП(Документ.КорректировкаПриобретения))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПустаяСсылка)
	|	КОНЕЦ																				КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнешнееПоступление) 				КАК ОперацияУчетаСебестоимости,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ДокументИсточник
	|	КОНЕЦ																				КАК ДокументИсточник,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеПоВозврату))
	|			ТОГДА ДанныеДокумента.Ссылка
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 				  						КАК НастройкаХозяйственнойОперации,
	// Необязательные поля
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовСписания) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовСписания
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовСписания) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаРасходов,
	|	ДанныеДокумента.КорНаправлениеДеятельности			    								КАК КорНаправлениеДеятельности
	|
	|ПОМЕСТИТЬ ВТОперация_ВнешнееПоступление
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ГруппаПродукции
	|			ТОГДА ДанныеДокумента.ГруппаПродукции
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		  КОНЕЦ = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнешнееПоступление)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_ВнешнееПоступление", ТекстЗапросаОтражения);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиВнутреннееПоступление(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 																КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПереданныхНаКомиссию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		 И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковТоваровПолученныхНаКомиссию) 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхВПроизводство)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВводОстатковТоваров), ТИП(Документ.ВводОстатков))
	|		  И ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВводОстатковМатериаловПереданныхПереработчикам2_5))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя))
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК КорВидЗапасов,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорПартия
	|		ТОГДА ДанныеДокумента.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорПартия,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                            										КАК ГруппаПродукции,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 						КАК Количество,
	|	(ВЫБОР
	// Плановая стоимость выпущенной продукции отражается отдельным движениям.
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.Стоимость КОНЕЦ)		КАК Стоимость,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.СтоимостьБезНДС КОНЕЦ) КАК СтоимостьБезНДС,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.СтоимостьРегл КОНЕЦ)	КАК СтоимостьРегл,
	|	ДанныеДокумента.НДСРегл							КАК НДСРегл,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0 
	|		КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|		 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|		 И &Константа_ПартионныйУчетВерсии22
	|		 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьУпр,
	|	ДанныеДокумента.НДСУпр							КАК НДСУпр,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.СтоимостьЗабалансовая КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.СтоимостьЗабалансоваяРегл КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	ДанныеДокумента.ДопРасходы						КАК ДопРасходы,
	|	ДанныеДокумента.ДопРасходыБезНДС				КАК ДопРасходыБезНДС,
	|	ДанныеДокумента.ДопРасходыРегл					КАК ДопРасходыРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ДопРасходыУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК ДопРасходыУпр,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ПостояннаяРазница КОНЕЦ) КАК ПостояннаяРазница,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДокумента.ВременнаяРазница КОНЕЦ) КАК ВременнаяРазница,
	|	ДанныеДокумента.РезервПодОбесценениеРегл		КАК РезервПодОбесценениеРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.РезервПодОбесценениеУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК РезервПодОбесценениеУпр,
	|	ДанныеДокумента.КорСтоимость					КАК КорСтоимость,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.Партия
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК Партия,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ) ТОГДА
	|		(ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|			 И ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) <> ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ) ТОГДА
	|		(ВЫБОР
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|			 И ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) <> ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДСДокумента,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорВидДеятельностиНДС
	|			ТОГДА ДанныеДокумента.КорВидДеятельностиНДС
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ТипЗаписи
	|			ТОГДА ДанныеДокумента.ТипЗаписи
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|		  И ДанныеДокумента.Количество = 0
	|		  И ДанныеДокумента.ДокументИсточник <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаСтоимости)		
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	КОНЕЦ																				КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнутреннееПоступление) 			КАК ОперацияУчетаСебестоимости,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ДокументИсточник
	|	КОНЕЦ																				КАК ДокументИсточник,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 				  						КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_ВнутреннееПоступление
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнутреннееПоступление)
	|
	// Плановую стоимость выпуска выделяем отдельным движением, т.к. для этой записи нет корреспондирующего движения и
	// плановая стоимость сторнируется после расчета. 
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 																КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		 ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО																			КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО 																			КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО 																			КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО 																			КАК КорВидЗапасов,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорПартия
	|		ТОГДА ДанныеДокумента.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорПартия,
	|
	// Прочие поля
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеПлановойСтоимостиВыпуска)			КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                            										КАК ГруппаПродукции,
	|
	// Количественные и суммовые показатели
	|	0												КАК Количество,
	|	ДанныеДокумента.Стоимость						КАК Стоимость,
	|	ДанныеДокумента.СтоимостьБезНДС					КАК СтоимостьБезНДС,
	|	ДанныеДокумента.СтоимостьРегл					КАК СтоимостьРегл,
	|	0												КАК НДСРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьУпр,
	|	0												КАК НДСУпр,
	|	ДанныеДокумента.СтоимостьЗабалансовая			КАК СтоимостьЗабалансовая,
	|	ДанныеДокумента.СтоимостьЗабалансоваяРегл		КАК СтоимостьЗабалансоваяРегл,
	|	0												КАК ДопРасходы,
	|	0												КАК ДопРасходыБезНДС,
	|	0												КАК ДопРасходыРегл,
	|	0	 											КАК ДопРасходыУпр,
	|	ДанныеДокумента.ПостояннаяРазница				КАК ПостояннаяРазница,
	|	ДанныеДокумента.ВременнаяРазница				КАК ВременнаяРазница,
	|	0												КАК РезервПодОбесценениеРегл,
	|	0	 											КАК РезервПодОбесценениеУпр,
	|	ДанныеДокумента.КорСтоимость					КАК КорСтоимость,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	 И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		ТОГДА ДанныеДокумента.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК Партия,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ) ТОГДА
	|		(ВЫБОР 
	|			КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|			 И ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) <> ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ) ТОГДА
	|		(ВЫБОР 
	|			КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|			 И ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) <> ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	НЕОПРЕДЕЛЕНО																		КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО																		КАК ВидДеятельностиНДСДокумента,
	|	НЕОПРЕДЕЛЕНО																		КАК КорВидДеятельностиНДС,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)										КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнутреннееПоступление) 			КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО																		КАК ДокументИсточник,
	|	ДанныеДокумента.Ссылка																КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ОтражениеПлановойСтоимостиВыпуска) КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВнутреннееПоступление)
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|	И (ДанныеДокумента.Стоимость <> 0 ИЛИ ДанныеДокумента.СтоимостьРегл <> 0)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_ВнутреннееПоступление", ТекстЗапросаОтражения);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиВыбытиеПоФиксированнойСтоимости(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	  И ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) <> ТИП(Документ.ПересортицаТоваров)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидЗапасов
	|	КОНЕЦ 																				КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|					 (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|					  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя))
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПереданнойВозвратнойТары),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад))
	|		 И ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаАктивовПассивов,
	|	ДанныеДокумента.СтатьяДоходов 															КАК СтатьяДоходов,
	|	ДанныеДокумента.АналитикаДоходов 														КАК АналитикаДоходов,
	|	ДанныеДокумента.ПериодДокументаИсточника												КАК ПериодПродажи,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПоПартнерам
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПоПартнерам
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаУчетаПоПартнерам,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 						КАК Количество,
	|	ДанныеДокумента.Стоимость 						КАК Стоимость,
	|	ДанныеДокумента.СтоимостьБезНДС 				КАК СтоимостьБезНДС,
	|	ДанныеДокумента.СтоимостьРегл 					КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьУпр,
	|	ДанныеДокумента.КорСтоимость 					КАК КорСтоимость,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьЗабалансовая
	|		ТОГДА ДанныеДокумента.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьЗабалансовая,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьЗабалансоваяРегл
	|		ТОГДА ДанныеДокумента.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ 											КАК СтоимостьЗабалансоваяРегл,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	ДанныеДокумента.ВидДеятельностиНДС													КАК КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДСДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ТипЗаписи
	|			ТОГДА ДанныеДокумента.ТипЗаписи
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТарыОтКлиентаПрошлыхПериодов))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно) 
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратНаДругойСклад)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ														  						КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВыбытиеПоФиксированнойСтоимости) 	КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.ДокументИсточник 												  	КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 				  						КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_ВыбытиеПоФиксированнойСтоимости
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ВыбытиеПоФиксированнойСтоимости)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_ВыбытиеПоФиксированнойСтоимости", ТекстЗапросаОтражения);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиПеремещение(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"
	// РАСХОД - списание у отправителя
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 														КАК Организация,
	|	ВЫБОР КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И НЕ ДанныеДокумента.ХозяйственнаяОперация В
	|	  	    (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|		ТОГДА ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыКомитента, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 																				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И НЕ ДанныеДокумента.ХозяйственнаяОперация В
	|	  	    (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидЗапасов
	|	КОНЕЦ 																				КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	//++ Устарело_Переработка24
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//-- Устарело_Переработка24
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСПоступлениеИзТоваровВПути),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаПоступлениеИзТоваровВПути))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5),
	//++ Устарело_Переработка24
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика),
	//-- Устарело_Переработка24
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика2_5),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ПередачаТоваровМеждуОрганизациями), ТИП(Документ.ВозвратТоваровОтКлиента))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																				КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	// Товар на хранении с правом продажи
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|		 И ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//++ Устарело_Переработка24
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	//-- Устарело_Переработка24
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|					КОГДА ДанныеДокумента.КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  			  ИЛИ ДанныеДокумента.КорАналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.КорАналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.КорОрганизация = ДанныеДокумента.Организация
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.КорОрганизация
	|	КОНЕЦ 																					КАК КорОрганизация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		   (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ДанныеДокумента.ВидЗапасов
	|		ИНАЧЕ ДанныеДокумента.КорВидЗапасов КОНЕЦ)											КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.ГруппаПродукции
	|	КОНЕЦ                                            										КАК ГруппаПродукции,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																					КАК ЗаказКлиента,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПоПартнерам
	|	 И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПоПартнерам
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																					КАК АналитикаУчетаПоПартнерам,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 																КАК Количество,
	|	ДанныеДокумента.Стоимость 																КАК Стоимость,
	|	ДанныеДокумента.СтоимостьБезНДС 														КАК СтоимостьБезНДС,
	|	ДанныеДокумента.СтоимостьРегл 															КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 																					КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																			КАК Партия,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой),
	|													   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства))
	|			ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|	  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) = ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|			ТОГДА ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  	 (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство),
	|		   	  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую),
	|		      ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов),
	|		      ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами))
	|				ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|		ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|	КОНЕЦ 																					КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО

	//++ Локализация
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (
	|		  ТИП(Документ.КорректировкаВидаДеятельностиНДС))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	//-- Локализация
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	//++ Локализация
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.КорректировкаВидаДеятельностиНДС)
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	//-- Локализация
	|			ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 																					КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР 
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.КорПартия
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО 																			КАК АналитикаУчетаПартий,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПартий
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК ВидДеятельностиНДСДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|		  И ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратНаДругойСклад)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ 														  							КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение) 							КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО 												  							КАК ДокументИсточник,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|			ТОГДА ДанныеДокумента.Ссылка
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  							КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  							КАК ИдентификаторФинЗаписи,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РеализацияКомиссионногоТовара)
	|		ИНАЧЕ ДанныеДокумента.НастройкаХозяйственнойОперации
	|	КОНЕЦ																					КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_Перемещение
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение)
	|	И НЕ (НЕ (&Константа_ПартионныйУчетВерсии22
	|			И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ))
	|		И ДанныеДокумента.ХозяйственнаяОперация В
	|	  		(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства))
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПРИХОД - оприходование у получателя
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ЕСТЬNULL(КорОрганизации.Ссылка, ДанныеДокумента.Организация) 							КАК Организация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		   (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ДанныеДокумента.ВидЗапасов
	|		ИНАЧЕ ДанныеДокумента.КорВидЗапасов КОНЕЦ)											КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	// Товар на хранении с правом продажи
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|		 И ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваров),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровСПереоценкой),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуПоклажедателя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУХранителя),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУХранителя))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику2_5),
	//++ Устарело_Переработка24
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПереработчику),
	//-- Устарело_Переработка24
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПересортицаТоваровУПереработчика),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПорчаТоваровУПереработчика))
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуПодразделениями),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|					КОГДА ДанныеДокумента.КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  			  ИЛИ ДанныеДокумента.КорАналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.КорАналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеТоваров)
	|		ИНАЧЕ ДанныеДокумента.ХозяйственнаяОперация
	|	КОНЕЦ 							КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|
	|	КОНЕЦ							КАК ГруппаПродукции,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ							КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО					КАК АналитикаУчетаПоПартнерам,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 																КАК Количество,
	|	ДанныеДокумента.Стоимость 																КАК Стоимость,
	|	ДанныеДокумента.СтоимостьБезНДС 														КАК СтоимостьБезНДС,
	|	ДанныеДокумента.СтоимостьРегл 															КАК СтоимостьРегл,
	|	ВЫБОР КОГДА &Константа_ВестиУправленческийУчетОрганизаций
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаНачалаВеденияУправленческогоУчетаОрганизаций, МЕСЯЦ)
	|	  И &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 																					КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|	      И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.Ссылка
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК Партия,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) = ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|			ТОГДА ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  	 (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство),
	|		   	  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую),
	|		      ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатов),
	|		      ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами))
	|				ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|		ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|	КОНЕЦ 															КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 													КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	//++ Локализация
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.КорректировкаВидаДеятельностиНДС)
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	//-- Локализация
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 															КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И НЕ ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		ТОГДА ДанныеДокумента.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК КорПартия,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПартий
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО 													КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК ВидДеятельностиНДСДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемПередачаРаботМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеУпр)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваровМеждуФилиалами),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеОбособленно)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = 
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПеремещениеТоварыВПути)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
	|	КОНЕЦ 															КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение) 	КАК ОперацияУчетаСебестоимости,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В 
	|		  (ТИП(Документ.ПоступлениеТоваровОтХранителя), ТИП(Документ.ПередачаТоваровХранителю))
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК ДокументИсточник,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  	КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  	КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации				  	КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК КорОрганизации
	|		ПО ДанныеДокумента.КорОрганизация = КорОрганизации.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// РАСХОД - списание комиссионного товара
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 														КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 															КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) 	КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО						  КАК ГруппаПродукции,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ								  КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО						  КАК АналитикаУчетаПоПартнерам,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество КАК Количество,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК СтоимостьРегл,
	|	0 КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																	КАК Партия,
	|	НЕОПРЕДЕЛЕНО 																	КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 																	КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 																	КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.КорПартия
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО 																	КАК АналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО 																	КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК ВидДеятельностиНДСДокумента,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) 		  					КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение) 					КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО 												  					КАК ДокументИсточник,
	|	НЕОПРЕДЕЛЕНО 																	КАК ДокументДвижения,
	|	ДанныеДокумента.ИдентификаторСтроки 						  					КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  					КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКомиссионныхТоваров)	КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Перемещение)
	|	И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И НЕ ДанныеДокумента.ХозяйственнаяОперация В
	|	  	(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет))
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_Перемещение", ТекстЗапросаОтражения);
	
КонецПроцедуры

// Описание принципов формирования движений модульной операции "Реализация".
// 
// При продаже типа запасов "Полуфабрикат давальца" если в исходных данных заполнен кор тип запасов "Продукция давальца":
// - балансовая себестоимость номенклатуры списывается на себестоимость продаж, в регистр "Выручка и себестоимость продаж"
// - забалансовая себестоимость переходит в себестоимость продукции давальца (тип запасов "Продукция давальца")   
// 	для этого формируется дополнительное приходное движение по кор виду запасов
//
Процедура ОтразитьОперациюСебестоимостиРеализация(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионераПрошлыхПериодов))
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 																КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионера))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В(
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтгрузкаПринятыхСПравомПродажиТоваровСХранения),
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В(
	//++ Устарело_Переработка24
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаДавальцу),
	//-- Устарело_Переработка24
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровДавальца))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров))
	|			ТОГДА 
	|				ВЫБОР КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровХранителем),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|					КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссиюВПути)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперацияДокумента В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО)
	|						= ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|				КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|				КОНЕЦ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|	ДанныеДокумента.КорОрганизация 															КАК КорОрганизация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК КорВидЗапасов,
	|
	// Прочие поля
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		 И ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияВРозницу))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКомиссионногоТовара)
	|		ИНАЧЕ ДанныеДокумента.ХозяйственнаяОперация КОНЕЦ) КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.АналитикаУчетаПоПартнерам 	КАК АналитикаУчетаПоПартнерам,
	|	ДанныеДокумента.Подразделение 				КАК Подразделение,
	|	ДанныеДокумента.ЗаказКлиента 				КАК ЗаказКлиента,
	|	ДанныеДокумента.ПериодДокументаИсточника	КАК ПериодПродажи,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 					КАК Количество,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьЗабалансовая
	|		ТОГДА ДанныеДокумента.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ 										КАК СтоимостьЗабалансовая,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьЗабалансоваяРегл
	|		ТОГДА ДанныеДокумента.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ 										КАК СтоимостьЗабалансоваяРегл,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|	  	  И УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.Ссылка
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК Партия,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
//	|	  И НЕ УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		И ЕСТЬNULL(КорУчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка, ИСТИНА) = ИСТИНА
	|		ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК КорАналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|		  И ДанныеДокумента.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И (ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
	|		 И ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА НЕ ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 														  КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорВидДеятельностиНДС
	|			ТОГДА ДанныеДокумента.КорВидДеятельностиНДС
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ							 							  КАК КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		И ЕСТЬNULL(КорУчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка, ИСТИНА) = ИСТИНА
	|		ТОГДА ДанныеДокумента.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК КорПартия,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 														  КАК ВидДеятельностиНДСДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ТипЗаписи
	|			ТОГДА ДанныеДокумента.ТипЗаписи
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионераПрошлыхПериодов))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТарыВозвратНаДругойСклад),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализацииВозвратНаДругойСклад))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратНаДругойСклад)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионера))
	|		  И ДанныеДокумента.Количество < 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратБезДокументаИсточника)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноПереданнойТары),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровЧерезКомиссионера),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = 
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПотреблениеТоварыВПути)	
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ														  КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Реализация)  КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.ДокументИсточник 							  КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  КАК ИдентификаторФинЗаписи,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		 И ДанныеДокумента.ХозяйственнаяОперация В (
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияВРозницу))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.РеализацияКомиссионногоТовара)
	|		ИНАЧЕ ДанныеДокумента.НастройкаХозяйственнойОперации КОНЕЦ) КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_Реализация
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК КорУчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.КорОрганизация = КорУчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = КорУчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Реализация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов															КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО																			КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО																			КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО																			КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО																			КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО																			КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация		КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО								КАК АналитикаУчетаПоПартнерам,
	|	ДанныеДокумента.Подразделение 				КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО								КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО								КАК ПериодПродажи,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 					КАК Количество,
	|	0	 										КАК СтоимостьЗабалансовая,
	|	0											КАК СтоимостьЗабалансоваяРегл,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО													КАК Партия,
	|	НЕОПРЕДЕЛЕНО													КАК КорАналитикаУчетаПартий,
	|	НЕОПРЕДЕЛЕНО													КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И (ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
	|		 И ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 															КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО							 						КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО 													КАК КорПартия,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК ВидДеятельностиНДСДокумента,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)			КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Реализация)	КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.Ссылка 											КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 							КАК ИдентификаторСтроки,
	// Для прихода давальческой продукции идентификатор фин записи не заполняем, т.к. у давальческой продукции нет балансовой стоимости.
	|	&ИдентификаторНеиспользуемойФинЗаписи 							КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации					КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.Реализация)
	|	И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|	И ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_Реализация", ТекстЗапросаОтражения);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиСписаниеНаДругиеПартии(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"
	// РАСХОД - списание у отправителя
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 														КАК Организация,
	|	ВЫБОР КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ТОГДА ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыКомитента, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 																				КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		  И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидЗапасов
	|	КОНЕЦ 																				КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	// Товар на хранении с правом продажи
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА (ВЫБОР
	|				КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи) КОНЕЦ)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																				КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровДавальца)
	|		 И ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|		 И ДанныеДокумента.АналитикаУчетаНоменклатуры.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком2_5)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|		КОГДА ДанныеДокумента.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровДавальца)
	|		 И ДанныеДокумента.ВидЗапасов.ТипЗапасов В
	|		  (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|		   ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|		КОГДА ДанныеДокумента.КорАналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.КорАналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.КорОрганизация = ДанныеДокумента.Организация
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.КорОрганизация
	|	КОНЕЦ 																					КАК КорОрганизация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																					КАК ГруппаПродукции,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество 																КАК Количество,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																			КАК Партия,
	|	НЕОПРЕДЕЛЕНО 																			КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  	И (УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		  ИЛИ ЛОЖЬ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК ВидДеятельностиНДС,
	|	ДанныеДокумента.ВидДеятельностиНДС														КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР 
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	  	КОГДА НЕ УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.КорПартия
	|	КОНЕЦ 																					КАК КорПартия,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорАналитикаУчетаПартий
	|	  	И (УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|		  ИЛИ ЛОЖЬ)
	|		ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК ВидДеятельностиНДСДокумента,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СписаниеНаДругиеПартии)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ 														  							КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии)				КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО 												  							КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  							КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  							КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 				  							КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_СписаниеНаДругиеПартии
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПРИХОД - оприходование у получателя
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ЕСТЬNULL(КорОрганизации.Ссылка, ДанныеДокумента.Организация) 							КАК Организация,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО)	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов 															КАК ВидЗапасов,
	|	(ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство) КОНЕЦ) КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение	КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ							КАК ГруппаПродукции,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество КАК Количество,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.КорПартия
	|	КОНЕЦ 															КАК Партия,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|	КОНЕЦ 															КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 													КАК КорАналитикаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 															КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО													КАК КорВидДеятельностиНДС,
	|
	|	НЕОПРЕДЕЛЕНО													КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО													КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 															КАК ВидДеятельностиНДСДокумента,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)				КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии) 	КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО 												  	КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  	КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  	КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации					КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК КорОрганизации
	|		ПО ДанныеДокумента.КорОрганизация = КорОрганизации.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии)
	|	И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// РАСХОД - списание комиссионного товара
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 														КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 															КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) 	КАК РазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО КАК КорВидЗапасов,
	|
	// Прочие поля
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКомиссионныхТоваров) КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение		  КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ								  КАК ГруппаПродукции,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество КАК Количество,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																	КАК Партия,
	|	НЕОПРЕДЕЛЕНО 																	КАК АналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 																	КАК КорАналитикаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО 																	КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК КорВидДеятельностиНДС,
	|
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА УчетныеПолитикиОрганизаций.ФИФОСкользящаяОценка
	|			ТОГДА ДанныеДокумента.КорПартия
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО																	КАК КорАналитикаУчетаПартий,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																			КАК ВидДеятельностиНДСДокумента,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление) 		  					КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии)		КАК ОперацияУчетаСебестоимости,
	|	НЕОПРЕДЕЛЕНО 												  					КАК ДокументИсточник,
	|	НЕОПРЕДЕЛЕНО 						  											КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  					КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКомиссионныхТоваров)	КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиОрганизаций КАК УчетныеПолитикиОрганизаций
	|		ПО ДанныеДокумента.Организация = УчетныеПолитикиОрганизаций.Организация
	|		И ДанныеДокумента.Период = УчетныеПолитикиОрганизаций.Период
	|
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаДругиеПартии)
	|	И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И ЕСТЬNULL(ДанныеДокумента.КорВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_СписаниеНаДругиеПартии", ТекстЗапросаОтражения);
	
КонецПроцедуры

Процедура ОтразитьОперациюСебестоимостиСписаниеНаРасходыАктивы(ПараметрыОтражения)
	
	// Сформируем шаблон текста запроса для отражения операции.
	ТекстЗапросаОтражения =
	"
	// РАСХОД - списание на расходы
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ВЫБОР КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		ТОГДА ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыКомитента, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 																					КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 		КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.ВидЗапасов
	|	КОНЕЦ 																					КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_РазделУчета
	|			ТОГДА ДанныеДокумента.РазделУчета
	|		КОГДА РазделыУчета.Расчетное_РазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_РазделУчета
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|		 И ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПринятыхТоваровЗаСчетПоклажедателя),
	|		   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПринятыхТоваровНаРасходы))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомиссионераОСписании))
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|				КОНЕЦ
	|
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию) 
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СХранителем)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетПоклажедателя))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыПереданныеПартнерам)
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента),
	|		  ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУКомиссионера))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|		КОГДА ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая
	|		  ИЛИ ДанныеДокумента.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	КОНЕЦ 																					КАК РазделУчета,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.КорОрганизация = ДанныеДокумента.Организация
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ДанныеДокумента.КорОрганизация
	|	КОНЕЦ 																					КАК КорОрганизация,
	// Условия для КорАналитикаУчетаНоменклатуры должны синхронизироваться с условием формирования приходных движений по давальческим товарам в этой операции
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаЗаСчетДавальца)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаНаРасходы)
	|	  И ДанныеДокумента.ВидЗапасов.ТипЗапасов В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца))
	|			ТОГДА ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО)
	|			ИНАЧЕ ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ 																					КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК КорАналитикаУчетаНоменклатурыИсходная,
	// Условия для КорВидЗапасов должны синхронизироваться с условием формирования приходных движений по давальческим товарам в этой операции
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаЗаСчетДавальца)
	|	  И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаНаРасходы)
	|	  И ДанныеДокумента.ВидЗапасов.ТипЗапасов В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца),
	|		 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца))
	|			ТОГДА ДанныеДокумента.ВидЗапасов
	|			ИНАЧЕ ДанныеДокумента.КорВидЗапасов
	|	КОНЕЦ 																					КАК КорВидЗапасов,
	|	ДанныеДокумента.КорНаправлениеДеятельности			    								КАК КорНаправлениеДеятельности,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорПартия
	|		ТОГДА ДанныеДокумента.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорПартия,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорАналитикаУчетаПартий
	|		ТОГДА ДанныеДокумента.КорАналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК КорАналитикаУчетаПартий,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 													КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 															КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаАктивовПассивов,
	|	ДанныеДокумента.ПериодДокументаИсточника												КАК ПериодПродажи,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПоПартнерам
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПоПартнерам
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_НастройкаСчетовУчета
	|			ТОГДА ДанныеДокумента.НастройкаСчетовУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК НастройкаСчетовУчета,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																					КАК ЗаказКлиента,
	|
	// Количественные и суммовые показатели
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ДанныеДокумента.Количество
	|					ИНАЧЕ -ДанныеДокумента.Количество
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДокумента.Количество
	|	КОНЕЦ																		КАК Количество,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_Стоимость
	|		ТОГДА ДанныеДокумента.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ 																		КАК Стоимость,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьБезНДС
	|		ТОГДА ДанныеДокумента.СтоимостьБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ 																		КАК СтоимостьБезНДС,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьРегл
	|		ТОГДА ДанныеДокумента.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ 																		КАК СтоимостьРегл,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_СтоимостьУпр
	|		ТОГДА ДанныеДокумента.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ 																		КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	 И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ) ТОГДА
	|		(ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.АналитикаУчетаНоменклатуры.СкладскаяТерритория.ЦеховаяКладовая, ЛОЖЬ)
	|			 И ТИПЗНАЧЕНИЯ(ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета) <> ТИП(Справочник.ГруппыАналитическогоУчетаНоменклатуры)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|	  		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  		(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость))
	|			ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|	  И ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость))
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК ВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК ВидДеятельностиНДСДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (
	|	   	  ТИП(Документ.ВнутреннееПотребление),
	|	   	  ТИП(Документ.СписаниеНедостачТоваров),
	|	   	  ТИП(Документ.ПередачаТоваровМеждуОрганизациями),
	|	   	  ТИП(Документ.ОтчетКомиссионераОСписании),
	|	   	  ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК КорВидДеятельностиНДС,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_Партия
	|		ТОГДА ДанныеДокумента.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК Партия,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПартий
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПартий
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																		КАК АналитикаУчетаПартий,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ТипЗаписи
	|			ТОГДА ДанныеДокумента.ТипЗаписи
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|				КОНЕЦ
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Дополнение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ																		КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы) 	КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.ДокументИсточник							  				КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  				КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  				КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 				  				КАК НастройкаХозяйственнойОперации
	|ПОМЕСТИТЬ ВТОперация_СписаниеНаРасходыАктивы
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы)
	// Для передачи товаров между организациями со списанием на расходы это движение делать не надо, т.к. в отличии от переработки, тут не будет дополнительного приходного движения 
	|	И НЕ (ЕСТЬNULL(ДанныеДокумента.ВидЗапасов.ТипЗапасов, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|		И ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// РАСХОД - списание комиссионного товара
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ									КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 														КАК Организация,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры, НЕОПРЕДЕЛЕНО) 			КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная, НЕОПРЕДЕЛЕНО) 	КАК АналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.ВидЗапасов 															КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) 	КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО 																		КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	ДанныеДокумента.КорВидЗапасов														КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО			    														КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаПартий,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 												КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 														КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаАктивовПассивов,
	|	ДанныеДокумента.ПериодДокументаИсточника											КАК ПериодПродажи,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПоПартнерам
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПоПартнерам
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_НастройкаСчетовУчета
	|			ТОГДА ДанныеДокумента.НастройкаСчетовУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК НастройкаСчетовУчета,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																				КАК ЗаказКлиента,
	|
	// Количественные и суммовые показатели
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ДанныеДокумента.Количество
	|					ИНАЧЕ -ДанныеДокумента.Количество
	|				КОНЕЦ
	|		ИНАЧЕ ДанныеДокумента.Количество
	|	КОНЕЦ																				КАК Количество,
	|	0 																					КАК Стоимость,
	|	0 																					КАК СтоимостьБезНДС,
	|	0 																					КАК СтоимостьРегл,
	|	0 																					КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																		КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	НЕОПРЕДЕЛЕНО																		КАК ВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДСДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (
	|		  ТИП(Документ.ВнутреннееПотребление),
	|	   	  ТИП(Документ.СписаниеНедостачТоваров))
	|			ТОГДА ДанныеДокумента.ВидДеятельностиНДС
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО																		КАК Партия,
	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаУчетаПартий,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация В
	|		  (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы))
	|			ТОГДА ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодДокументаИсточника, МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДанныеДокумента.Период, МЕСЯЦ)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Сторно)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|	КОНЕЦ																				КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы) 			КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.ДокументИсточник							  						КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	|	ДанныеДокумента.ИдентификаторФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.Ссылка) В (ТИП(Документ.ВнутреннееПотребление))
	|		ТОГДА ДанныеДокумента.НастройкаХозяйственнойОперации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.СписаниеКомиссионныхТоваров)
	|	КОНЕЦ 																				КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы)
	|	И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// ПРИХОД - давальческий товар
	|ВЫБРАТЬ
	|	ДанныеДокумента.НомерОперации КАК НомерОперации,
	// Описание документа
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)	КАК ВидДвижения,
	|	ДанныеДокумента.Период 					КАК Период,
	|
	// Поля учета номенклатуры
	|	ДанныеДокумента.Организация 															КАК Организация,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы))
	|		ТОГДА ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатуры
	|	КОНЕЦ																					КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы))
	|		ТОГДА ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		ИНАЧЕ ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|	КОНЕЦ																					КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР КОГДА ДанныеДокумента.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы))
	|		ТОГДА ДанныеДокумента.КорВидЗапасов
	|		ИНАЧЕ ДанныеДокумента.ВидЗапасов
	|	КОНЕЦ																					КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_КорРазделУчета
	|			ТОГДА ДанныеДокумента.КорРазделУчета
	|		КОГДА РазделыУчета.Расчетное_КорРазделУчета <> НЕОПРЕДЕЛЕНО
	|			ТОГДА РазделыУчета.Расчетное_КорРазделУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																					КАК РазделУчета,
	|	НЕОПРЕДЕЛЕНО 																			КАК КорРазделУчета,
	|
	// Корреспондирующие поля
	|	НЕОПРЕДЕЛЕНО 																		КАК КорОрганизация,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаНоменклатурыИсходная,
	|	НЕОПРЕДЕЛЕНО																		КАК КорВидЗапасов,
	|	НЕОПРЕДЕЛЕНО			    														КАК КорНаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорПартия,
	|	НЕОПРЕДЕЛЕНО 																		КАК КорАналитикаУчетаПартий,
	|
	// Прочие поля
	|	ДанныеДокумента.ХозяйственнаяОперация 												КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.Подразделение 														КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.СтатьяРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК СтатьяАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.СтатьяРасходовАктивов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ДанныеДокумента.АналитикаРасходовАктивов
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаАктивовПассивов,
	|	ДанныеДокумента.ПериодДокументаИсточника											КАК ПериодПродажи,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_АналитикаУчетаПоПартнерам
	|		ТОГДА ДанныеДокумента.АналитикаУчетаПоПартнерам
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаУчетаПоПартнерам,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_НастройкаСчетовУчета
	|			ТОГДА ДанныеДокумента.НастройкаСчетовУчета
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК НастройкаСчетовУчета,
	|	ВЫБОР КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ЗаказКлиента
	|		ТОГДА ДанныеДокумента.ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ																				КАК ЗаказКлиента,
	|
	// Количественные и суммовые показатели
	|	ДанныеДокумента.Количество															КАК Количество,
	|	0 																					КАК Стоимость,
	|	0 																					КАК СтоимостьБезНДС,
	|	0 																					КАК СтоимостьРегл,
	|	0 																					КАК СтоимостьУпр,
	|
	// Поля партионного учета версии 2.2
	|	НЕОПРЕДЕЛЕНО 																		КАК АналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ВТАналитикиФинансовогоУчета.АналитикаФинансовогоУчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК АналитикаФинансовогоУчетаДокумента,
	|	ВЫБОР
	|		КОГДА НЕ &Константа_ПартионныйУчетВерсии22
	|		  ИЛИ ДанныеДокумента.Период < НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДанныеДокумента.ВидДеятельностиНДС
	|	КОНЕЦ 																				КАК ВидДеятельностиНДС,
	|	ВЫБОР КОГДА &Константа_ПартионныйУчетВерсии22
	|	  И ДанныеДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаПереходаНаПартионныйУчетВерсии22, МЕСЯЦ)
	|		ТОГДА ДанныеДокумента.ВидДеятельностиНДСДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ 																				КАК ВидДеятельностиНДСДокумента,
	|	НЕОПРЕДЕЛЕНО																		КАК КорВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО																		КАК Партия,
	|	НЕОПРЕДЕЛЕНО																		КАК АналитикаУчетаПартий,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)								КАК ТипЗаписи,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы) 			КАК ОперацияУчетаСебестоимости,
	|	ДанныеДокумента.ДокументИсточник							  						КАК ДокументИсточник,
	|	ДанныеДокумента.ИдентификаторСтроки 						  						КАК ИдентификаторСтроки,
	// Для прихода давальческой продукции идентификатор фин записи не заполняем, т.к. у давальческой продукции нет балансовой стоимости.
	|	&ИдентификаторНеиспользуемойФинЗаписи 						  						КАК ИдентификаторФинЗаписи,
	|	ДанныеДокумента.НастройкаХозяйственнойОперации 										КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТАналитикиНоменклатуры
	|		ПО ДанныеДокумента.АналитикаУчетаНоменклатуры = ВТАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.ВидЗапасов = ВТАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаменаАналитикУчетаНоменклатуры КАК ВТКорАналитикиНоменклатуры
	|		ПО ДанныеДокумента.КорАналитикаУчетаНоменклатуры = ВТКорАналитикиНоменклатуры.АналитикаУчетаНоменклатурыИсходная
	|		И ДанныеДокумента.КорВидЗапасов = ВТКорАналитикиНоменклатуры.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикиФинансовогоУчета КАК ВТАналитикиФинансовогоУчета
	|		ПО ДанныеДокумента.Сделка = ВТАналитикиФинансовогоУчета.Сделка
	|		И ДанныеДокумента.Менеджер = ВТАналитикиФинансовогоУчета.Менеджер
	|		И ДанныеДокумента.Подразделение = ВТАналитикиФинансовогоУчета.Подразделение
	|		И ДанныеДокумента.ГруппаПродукции = ВТАналитикиФинансовогоУчета.ГруппаПродукции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРазделыУчета КАК РазделыУчета
	|		ПО ДанныеДокумента.НомерЗаписи = РазделыУчета.НомерЗаписи
	|ГДЕ
	|	ДанныеДокумента.ОперацияУчетаСебестоимости = ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.СписаниеНаРасходыАктивы)
	// Условие формирования приходных движений по давальческим товарам должны совпадать с условиями для КорАналитикаУчетаНоменклатуры и КорВидЗапасов в расходном движении в этой операции
	|	И ((ДанныеДокумента.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы))
	|		И ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|		ИЛИ 
	|		(ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцу2_5)
	|			И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетДавальцуСписаниеНаРасходы)
	|			И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаЗаСчетДавальца)
	|			И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровДавальцаНаРасходы)
	|			И ДанныеДокумента.ВидЗапасов.ТипЗапасов В
	|				(ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|				 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца),
	|				 ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца))))
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОперация_СписаниеНаРасходыАктивы", ТекстЗапросаОтражения);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыВспомогательныхВременныхТаблиц

Процедура ДобавитьТекстЗапросаТаблицыДанные(ПараметрыОтражения)
	
	ИмяРегистра 	   			= ПараметрыОтражения.ИмяРегистра;
	ТаблицаПолей 				= ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].ТаблицаПолей;
	СхемыЗапросовДокумента		= ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].СхемыЗапросовДокумента;
	
	ПримитивныеТипы = Новый ОписаниеТипов("Булево, Дата, Число, Строка, УникальныйИдентификатор");
	НесуммируемыеПоля = Новый Структура("КодСтроки");
	
	// Соберем схему запроса объединения выборки данных.
	СхемаЗапроса = Новый СхемаЗапроса;
	ТекстЗапроса = "";
	
	ПоляРегистра = ПараметрыОтражения.РегистрыДляОтражения[ПараметрыОтражения.ИмяРегистра].ПоляРегистра;
	
	Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "," + Символы.ПС)
			+ "	" + ?(ПоляРегистра.Свойство(ОписаниеПоля.Имя), "Т." + ОписаниеПоля.Имя, "НЕОПРЕДЕЛЕНО") + " КАК " + ОписаниеПоля.Имя;
		
		ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "	ЛОЖЬ КАК ЕстьПолеЗапроса_" + ОписаниеПоля.Имя;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "	0 КАК НомерОперации";
	ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "	ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости.ПустаяСсылка) КАК ОперацияУчетаСебестоимости";
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	&ПоляЗапроса
	|ИЗ
	|	#ИмяРегистра КАК Т";
	
	ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "#ИмяРегистра", "РегистрНакопления" + "." + ПараметрыОтражения.ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&ПоляЗапроса", ТекстЗапроса);
	
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ТекущийЗапросПакета = СхемаЗапроса.ПакетЗапросов.Получить(0); //ЗапросВыбораСхемыЗапроса
	ОператорыЗапроса  = ТекущийЗапросПакета.Операторы;
	КолонкиЗапроса    = ТекущийЗапросПакета.Колонки;
	КоличествоКолонок = ТекущийЗапросПакета.Колонки.Количество();
	
	НомерЗапроса = 0;
	
	Для Каждого ОписаниеСхемы Из СхемыЗапросовДокумента Цикл
		
		НомерЗапроса = НомерЗапроса + 1;
		
		ПакетЗапросов = ОписаниеСхемы.СхемаЗапроса.ПакетЗапросов; // ПакетЗапросовСхемыЗапроса
		ТекущийЗапросПакета = ПакетЗапросов.Получить(0); //ЗапросВыбораСхемыЗапроса
		ОператорПодзапроса = ТекущийЗапросПакета.Операторы[0];
		КолонкиПодзапроса  = ТекущийЗапросПакета.Колонки;
		
		ТекущийОператор = ОператорыЗапроса.Добавить(ОператорПодзапроса);
		ТекущийОператор.ВыбираемыеПоля.Очистить();
		
		НомерКолонки = 0;
		
		Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл
			
			КолонкаПодзапроса = КолонкиПодзапроса.Найти(ОписаниеПоля.Имя);
			
			// Значение текущего поля
			Если КолонкаПодзапроса <> Неопределено Тогда
				КолонкиЗапроса.Получить(НомерКолонки).Поля.Установить(НомерЗапроса, КолонкаПодзапроса.Поля[0]);
			Иначе
				ТекущийОператор.ВыбираемыеПоля.Добавить("НЕОПРЕДЕЛЕНО", НомерКолонки);
			КонецЕсли;
			
			НомерКолонки = НомерКолонки + 1;
			
			// Значение поля "ЕстьПолеЗапроса_<текущее поле>"
			Если КолонкаПодзапроса = Неопределено Тогда
				ТекущийОператор.ВыбираемыеПоля.Добавить("ЛОЖЬ", НомерКолонки);
			Иначе
				ТекущийОператор.ВыбираемыеПоля.Добавить("ИСТИНА", НомерКолонки);
			КонецЕсли;
			
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
		
		ТекущийОператор.ВыбираемыеПоля.Добавить(СокрЛП(НомерЗапроса), НомерКолонки);
		
		НомерКолонки = НомерКолонки + 1;
		ТекущийОператор.ВыбираемыеПоля.Добавить("ЗНАЧЕНИЕ(Перечисление.ОперацииУчетаСебестоимости." + ОбщегоНазначения.ИмяЗначенияПеречисления(ОписаниеСхемы.ВидОперации) + ")", НомерКолонки);
		
	КонецЦикла;
	
	Пока КолонкиЗапроса.Количество() > КоличествоКолонок Цикл
		КолонкиЗапроса.Удалить(КолонкиЗапроса.Количество() - 1);
	КонецЦикла;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL,", "НЕОПРЕДЕЛЕНО,");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "null,", "НЕОПРЕДЕЛЕНО,");
	
	ТекстПоляВыборки = "";
	ТекстПоляВыборкиГруппировка = "";
	ТекстПоляВыборкиСгруппировать = "";
	ТекстПоляВыборкиСуммирование = "";
	ТекстПоляТипизированные = "";
	
	Для Каждого ОписаниеПоля Из ТаблицаПолей Цикл
		
		ТекстПоляВыборки = ТекстПоляВыборки + ?(ТекстПоляВыборки = "", "", ",") + "
			|	ДанныеДокумента." + ОписаниеПоля.Имя + " КАК " + ОписаниеПоля.Имя;
		
		Если ОписаниеПоля.Тип.Типы().Количество() = 1
		 И ОписаниеПоля.Тип.Типы()[0] = Тип("Число")
		 И НЕ НесуммируемыеПоля.Свойство(ОписаниеПоля.Имя) Тогда
			
			ТекстПоляВыборкиСуммирование = ТекстПоляВыборкиСуммирование + ?(ТекстПоляВыборкиСуммирование = "", "", ",") + "
				|	СУММА(ДанныеДокумента." + ОписаниеПоля.Имя + ") КАК " + ОписаниеПоля.Имя;
			
	 	Иначе
			
			ТекстПоляВыборкиГруппировка = ТекстПоляВыборкиГруппировка + ?(ТекстПоляВыборкиГруппировка = "", "", ",") + "
				|	ДанныеДокумента." + ОписаниеПоля.Имя + " КАК " + ОписаниеПоля.Имя;
			ТекстПоляВыборкиСгруппировать = ТекстПоляВыборкиСгруппировать + ?(ТекстПоляВыборкиСгруппировать = "", "", ",") + "
				|	ДанныеДокумента." + ОписаниеПоля.Имя;
			
	 	КонецЕсли;
	 	
		Если ОписаниеПоля.Тип.Типы().Количество() = 1 Тогда
			
			ТипПоля = ОписаниеПоля.Тип.Типы()[0];
			
			Если НЕ ПримитивныеТипы.СодержитТип(ТипПоля) Тогда
				
				МетаданныеДляТипа = Метаданные.НайтиПоТипу(ТипПоля);
				
				Если МетаданныеДляТипа <> Неопределено Тогда
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т." + ОписаниеПоля.Имя + ") = ТИП(" + МетаданныеДляТипа.ПолноеИмя() + ")
						|		ТОГДА Т." + ОписаниеПоля.Имя + "
						|		ИНАЧЕ ЗНАЧЕНИЕ(" + МетаданныеДляТипа.ПолноеИмя() + ".ПустаяСсылка)
						|	КОНЕЦ КАК " + ОписаниеПоля.Имя;
				Иначе
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	Т." + ОписаниеПоля.Имя + " КАК " + ОписаниеПоля.Имя;
				КонецЕсли;
				
			Иначе
				
				Если ТипПоля = Тип("Дата") Тогда
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	ВЫРАЗИТЬ(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т." + ОписаниеПоля.Имя + ") = ТИП(ДАТА) ТОГДА Т." + ОписаниеПоля.Имя + " ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ КАК ДАТА) КАК " + ОписаниеПоля.Имя;
					
				ИначеЕсли ТипПоля = Тип("Число") Тогда
					
					Если ОписаниеПоля.Тип.КвалификаторыЧисла.Разрядность = 0 Тогда
						ФорматЧисла = "31,3";
					Иначе
						ФорматЧисла = Формат(ОписаниеПоля.Тип.КвалификаторыЧисла.Разрядность, "ЧН=0; ЧГ=") + ","
							+ Формат(ОписаниеПоля.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти, "ЧН=0; ЧГ=");
					КонецЕсли;
					
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	ВЫРАЗИТЬ(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т." + ОписаниеПоля.Имя + ") = ТИП(ЧИСЛО) ТОГДА Т." + ОписаниеПоля.Имя + " ИНАЧЕ 0 КОНЕЦ КАК ЧИСЛО (" + ФорматЧисла + ")) КАК " + ОписаниеПоля.Имя;
					
				ИначеЕсли ТипПоля = Тип("Булево") Тогда
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(Т." + ОписаниеПоля.Имя + ") = ТИП(БУЛЕВО) ТОГДА Т." + ОписаниеПоля.Имя + " ИНАЧЕ ЛОЖЬ КОНЕЦ КАК " + ОписаниеПоля.Имя;
					
				Иначе
					ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
						|	Т." + ОписаниеПоля.Имя + " КАК " + ОписаниеПоля.Имя;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
				|	Т." + ОписаниеПоля.Имя + " КАК " + ОписаниеПоля.Имя;
		КонецЕсли;
		
		ТекстПоляВыборки = ТекстПоляВыборки + ?(ТекстПоляВыборки = "", "", ",") + "
			|	ДанныеДокумента.ЕстьПолеЗапроса_" + ОписаниеПоля.Имя + " КАК ЕстьПолеЗапроса_" + ОписаниеПоля.Имя;
		ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
			|	Т.ЕстьПолеЗапроса_" + ОписаниеПоля.Имя + " КАК ЕстьПолеЗапроса_" + ОписаниеПоля.Имя;
		ТекстПоляВыборкиГруппировка = ТекстПоляВыборкиГруппировка + ?(ТекстПоляВыборкиГруппировка = "", "", ",") + "
			|	ДанныеДокумента.ЕстьПолеЗапроса_" + ОписаниеПоля.Имя + " КАК ЕстьПолеЗапроса_" + ОписаниеПоля.Имя;
		ТекстПоляВыборкиСгруппировать = ТекстПоляВыборкиСгруппировать + ?(ТекстПоляВыборкиСгруппировать = "", "", ",") + "
			|	ДанныеДокумента.ЕстьПолеЗапроса_" + ОписаниеПоля.Имя;
		
	КонецЦикла;
	
	// Дополнительные поля
	Если ПараметрыОтражения.МетаданныеДокумента.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено Тогда
		ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
			|	ВЫРАЗИТЬ(Т.Ссылка КАК Документ." + ПараметрыОтражения.МетаданныеДокумента.Имя + ").ХозяйственнаяОперация КАК ХозяйственнаяОперацияДокумента";
	Иначе
		ТекстПоляТипизированные = ТекстПоляТипизированные + ?(ТекстПоляТипизированные = "", "", ",") + "
			|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперацияДокумента";
	КонецЕсли;
	
	ТекстЗапросаВременнаяТаблица =
		"ВЫБРАТЬ
		|	Т.НомерОперации КАК НомерОперации,
		|	Т.ОперацияУчетаСебестоимости КАК ОперацияУчетаСебестоимости,
		|	&ТекстПоляТипизированные
		|ПОМЕСТИТЬ ВТДанныеДокументаПредварительная
		|ИЗ
		|	#ТекстЗапроса КАК Т
		|";
	
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "&ТекстПоляТипизированные", СокрЛП(ТекстПоляТипизированные));
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "#ТекстЗапроса", "(" + ТекстЗапроса + ")");
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТДанныеДокументаПредварительная", ТекстЗапросаВременнаяТаблица);
	
	ТекстЗапросаВременнаяТаблица =
		"ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	ДанныеДокумента.НомерОперации КАК НомерОперации,
		|	ДанныеДокумента.ОперацияУчетаСебестоимости КАК ОперацияУчетаСебестоимости,
		|	ДанныеДокумента.ХозяйственнаяОперацияДокумента КАК ХозяйственнаяОперацияДокумента,
		|	&ТекстПоляВыборкиГруппировка,
		|	&ТекстПоляВыборкиСуммирование
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	#ДанныеДокумента КАК ДанныеДокумента
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДокумента.НомерОперации,
		|	ДанныеДокумента.ОперацияУчетаСебестоимости,
		|	ДанныеДокумента.ХозяйственнаяОперацияДокумента,
		|	&ТекстПоляВыборкиСгруппировать
		|	";
	
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "&ТекстПоляВыборкиГруппировка", СокрЛП(ТекстПоляВыборкиГруппировка));
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "&ТекстПоляВыборкиСуммирование", СокрЛП(ТекстПоляВыборкиСуммирование));
	ТекстЗапросаВременнаяТаблица = СтрЗаменить(ТекстЗапросаВременнаяТаблица, "&ТекстПоляВыборкиСгруппировать", СокрЛП(ТекстПоляВыборкиСгруппировать));
	
	ТекстЗапросаДанные =
		"ВЫБРАТЬ
		|	Т.НомерОперации КАК НомерОперации,
		|	Т.ОперацияУчетаСебестоимости КАК ОперацияУчетаСебестоимости,
		|	Т.ХозяйственнаяОперацияДокумента КАК ХозяйственнаяОперацияДокумента,
		|	&ТекстПоляВыборки
		|ИЗ
		|	ВТДанныеДокументаПредварительная КАК Т
		|";
	
	ТекстЗапросаДанные = СтрЗаменить(ТекстЗапросаДанные, "&ТекстПоляВыборки", СтрЗаменить(СокрЛП(ТекстПоляВыборки), "ДанныеДокумента.", "Т."));
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТДанныеДокумента", ТекстЗапросаВременнаяТаблица);
	ПараметрыОтражения.ТекстыЗапросовДанныхДокумента.Вставить("ДанныеДокумента", ТекстЗапросаДанные);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаФормированияАналитикНоменклатуры(ПараметрыОтражения)
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(СпрВидыЗапасов.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)) КАК ВидЗапасов,
	|	ДанныеДокумента.ВидЗапасов КАК ВидЗапасовИсходный,
	|	ДанныеДокумента.Период КАК Период
	|ПОМЕСТИТЬ ВТАналитикиУчетаНоменклатурыДокумента
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|	ПО ДанныеДокумента.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|";
	
	Если ЕстьПолеТаблицыДанные(ПараметрыОтражения, "КорАналитикаУчетаНоменклатуры") Тогда
		
		ТекстЗапросаВременнаяТаблица = ТекстЗапросаВременнаяТаблица + "
		|ОБЪЕДИНИТЬ
		|" + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокумента.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ЕСТЬNULL(СпрВидыЗапасов.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)) КАК ВидЗапасов,
		|	ДанныеДокумента.КорВидЗапасов КАК ВидЗапасовИсходный,
		|	ДанныеДокумента.Период КАК Период
		|ИЗ
		|	ВТДанныеДокумента КАК ДанныеДокумента
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
		|	ПО ДанныеДокумента.КорВидЗапасов = СпрВидыЗапасов.Ссылка
		|";
		
	КонецЕсли;
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТАналитикиУчетаНоменклатурыДокумента", ТекстЗапросаВременнаяТаблица);
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АналитикиДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыИсходная,
	|	ВЫБОР КОГДА &Константа_УчитыватьСебестоимостьТоваровПоНазначениям
	|	  И АналитикиДокумента.Период >= НАЧАЛОПЕРИОДА(&Константа_ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям, МЕСЯЦ)
	|		ТОГДА АналитикиДокумента.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(АналитикаКомитента.КлючАналитики, НЕОПРЕДЕЛЕНО) КАК АналитикаУчетаНоменклатурыКомитента,
	|	АналитикиДокумента.ВидЗапасовИсходный КАК ВидЗапасов
	|ПОМЕСТИТЬ ВТЗаменаАналитикУчетаНоменклатуры
	|ИЗ
	|	ВТАналитикиУчетаНоменклатурыДокумента КАК АналитикиДокумента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО АналитикиДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
	|		И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
	|		И Аналитика.Серия = АналитикаБезНазначения.Серия
	|		И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
	|		И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомитента
	|	ПО	АналитикиДокумента.АналитикаУчетаНоменклатуры.Номенклатура = АналитикаКомитента.Номенклатура
	|		И АналитикиДокумента.АналитикаУчетаНоменклатуры.Характеристика = АналитикаКомитента.Характеристика
	|		И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаКомитента.Назначение
	|		И ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) = АналитикаКомитента.Серия
	|		И АналитикиДокумента.ВидЗапасов.ВладелецТовара = АналитикаКомитента.МестоХранения
	|		И АналитикиДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТЗаменаАналитикУчетаНоменклатуры", ТекстЗапросаВременнаяТаблица);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаФормированияАналитикиФинансовогоУчета(ПараметрыОтражения)
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Сделка 			КАК Сделка,
	|	ДанныеДокумента.Менеджер 		КАК Менеджер,
	|	ДанныеДокумента.Подразделение 	КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ГруппаПродукции
	|			ТОГДА ДанныеДокумента.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК ГруппаПродукции,
	|	МАКСИМУМ(ВЫБОР
	
	// Для работ и услуг подразделение, менеджер или сделка не учитываются в аналитике финансового учета.
	// Менеджер, подразделение и сделка учитываются только для товаров. 
	|		КОГДА ДанныеДокумента.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА &Константа_ФормироватьВидыЗапасовПоСделкам
	|			И ЕСТЬNULL(Сделки.Ссылка.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(Сделки.Ссылка, НЕОПРЕДЕЛЕНО)
	|		КОГДА &Константа_ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|		 И ЕСТЬNULL(Подразделения.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|			= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
	|			ТОГДА ЕСТЬNULL(Пользователи.Ссылка, НЕОПРЕДЕЛЕНО)
	|		КОГДА &Константа_ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|		 И ЕСТЬNULL(Подразделения.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|			= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению)
	|			ТОГДА ЕСТЬNULL(Подразделения.Ссылка, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ) КАК АналитикаФинансовогоУчета
	|ПОМЕСТИТЬ ВТАналитикиФинансовогоУчета
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК Подразделения
	|		ПО ДанныеДокумента.Подразделение = Подразделения.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами КАК Сделки
	|		ПО ДанныеДокумента.Сделка = Сделки.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ДанныеДокумента.Менеджер = Пользователи.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Сделка,
	|	ДанныеДокумента.Менеджер,
	|	ДанныеДокумента.Подразделение,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ЕстьПолеЗапроса_ГруппаПродукции
	|			ТОГДА ДанныеДокумента.ГруппаПродукции
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ // ГруппаПродукции
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТАналитикиФинансовогоУчета", ТекстЗапросаВременнаяТаблица);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаУчетныеПолитики(ПараметрыОтражения)
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР КОГДА ДанныеДокумента.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		ТОГДА ДанныеДокумента.Организация
	|		ИНАЧЕ ДанныеДокумента.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ДанныеДокумента.Период КАК Период
	|ПОМЕСТИТЬ ВТОрганизацииДокумента
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|";
	
	Если ЕстьПолеТаблицыДанные(ПараметрыОтражения, "КорОрганизация") Тогда
		
		ТекстЗапросаВременнаяТаблица = ТекстЗапросаВременнаяТаблица + "
		|ОБЪЕДИНИТЬ
		|" + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокумента.КорОрганизация КАК Организация,
		|	ВЫБОР КОГДА ДанныеДокумента.КорОрганизация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ТОГДА ДанныеДокумента.КорОрганизация
		|		ИНАЧЕ ДанныеДокумента.КорОрганизация.ГоловнаяОрганизация
		|	КОНЕЦ КАК ГоловнаяОрганизация,
		|	ДанныеДокумента.Период КАК Период
		|ИЗ
		|	ВТДанныеДокумента КАК ДанныеДокумента
		|";
		
	КонецЕсли;
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТОрганизацииДокумента", ТекстЗапросаВременнаяТаблица);
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ
	|	АналитикиДокумента.Организация КАК Организация,
	|	АналитикиДокумента.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	АналитикиДокумента.Период КАК Период,
	|	МАКСИМУМ(УчетныеПолитики.Период) КАК ПериодПолитики
	|ПОМЕСТИТЬ ВТПериодыУчетныхПолитикОрганизаций
	|ИЗ
	|	ВТОрганизацииДокумента КАК АналитикиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК УчетныеПолитики
	|		ПО АналитикиДокумента.ГоловнаяОрганизация = УчетныеПолитики.Организация
	|ГДЕ
	|	УчетныеПолитики.Период <= КОНЕЦПЕРИОДА(АналитикиДокумента.Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикиДокумента.Организация,
	|	АналитикиДокумента.ГоловнаяОрганизация,
	|	АналитикиДокумента.Период";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТПериодыУчетныхПолитикОрганизаций", ТекстЗапросаВременнаяТаблица);
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Период КАК Период,
	|	ЕСТЬNULL(УчетныеПолитики.МетодОценкиСтоимостиТоваров, НЕОПРЕДЕЛЕНО) КАК МетодОценкиСтоимостиТоваров,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетныеПолитики.МетодОценкиСтоимостиТоваров, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка)
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФИФОСкользящаяОценка
	|ПОМЕСТИТЬ ВТУчетныеПолитикиОрганизаций
	|ИЗ
	|	ВТПериодыУчетныхПолитикОрганизаций КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК УчетныеПолитики
	|		ПО Т.ГоловнаяОрганизация = УчетныеПолитики.Организация
	|			И Т.ПериодПолитики = УчетныеПолитики.Период";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТУчетныеПолитикиОрганизаций", ТекстЗапросаВременнаяТаблица);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаРазделУчета(ПараметрыОтражения)
	
	ТекстЗапросаВременнаяТаблица =
	"ВЫБРАТЬ
	|	ДанныеДокумента.НомерЗаписи КАК НомерЗаписи,
	// Раздел учета
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.ЕстьПолеЗапроса_ВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Расчетное_РазделУчета,
	|
	// Кор. раздел учета
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.ЕстьПолеЗапроса_КорВидЗапасов
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Расчетное_КорРазделУчета
	|ПОМЕСТИТЬ ВТРазделыУчета
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|";
	
	ПараметрыОтражения.ТекстыШаблоновВТ.Вставить("ВТРазделыУчета", ТекстЗапросаВременнаяТаблица);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаФормированияДвижений(ПараметрыОтражения)
	
	ИмяРегистра = ПараметрыОтражения.ИмяРегистра;
	ВидыОперацийДокумента = ПараметрыОтражения.РегистрыДляОтражения[ИмяРегистра].ВидыОперацийДокумента;
	
	КолонкиЗапроса = Новый Структура;
	МассивКолонокЗапроса = Новый Массив;
	КолонкиОпераций = Новый Соответствие;
	
	Для Каждого ТекущаяОперацияДокумента Из ВидыОперацийДокумента Цикл
		
		КолонкиТекущейОперации = Новый Структура;
		
		ИмяВременнойТаблицы = "ВТОперация_" + ОбщегоНазначения.ИмяЗначенияПеречисления(ТекущаяОперацияДокумента.Ключ);
		ТекстЗапроса = ПараметрыОтражения.ТекстыШаблоновВТ[ИмяВременнойТаблицы];
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
		
		Для Каждого ТекущаяКолонка Из ОписаниеЗапроса.Колонки Цикл
			
			КолонкиТекущейОперации.Вставить(ТекущаяКолонка.Псевдоним);
			
			Если НЕ КолонкиЗапроса.Свойство(ТекущаяКолонка.Псевдоним) Тогда
				КолонкиЗапроса.Вставить(ТекущаяКолонка.Псевдоним);
				МассивКолонокЗапроса.Добавить(ТекущаяКолонка.Псевдоним);
			КонецЕсли;
			
		КонецЦикла;
		
		КолонкиОпераций.Вставить(ТекущаяОперацияДокумента.Ключ, КолонкиТекущейОперации);
		
	КонецЦикла;
	
	ТекстЗапроса = "";
	
	Для Каждого ТекущаяОперацияДокумента Из ВидыОперацийДокумента Цикл
		
		ТекстПоля = "";
		КолонкиТекущейОперации = КолонкиОпераций[ТекущаяОперацияДокумента.Ключ];
		
		Для Каждого ТекущаяКолонка Из МассивКолонокЗапроса Цикл
			
			Если КолонкиТекущейОперации.Свойство(ТекущаяКолонка) Тогда
				
				ТекстПоля = ТекстПоля + ?(ТекстПоля = "", "", ",") + "
					|	Т." + ТекущаяКолонка + " КАК " + ТекущаяКолонка;
				
			Иначе
				
				ТекстПоля = ТекстПоля + ?(ТекстПоля = "", "", ",") + "
					|	НЕОПРЕДЕЛЕНО КАК " + ТекущаяКолонка;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИмяВременнойТаблицы = "ВТОперация_" + ОбщегоНазначения.ИмяЗначенияПеречисления(ТекущаяОперацияДокумента.Ключ);
		
		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ
		|	&ПоляЗапроса
		|ИЗ
		|	#ИмяВременнойТаблицы КАК Т";
		
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "#ИмяВременнойТаблицы", ИмяВременнойТаблицы);
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&ПоляЗапроса", СокрЛП(ТекстПоля));
			
		ТекстЗапроса = ТекстЗапроса
			+ ?(ТекстЗапроса = "", "", "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|")
			+ ШаблонТекстаЗапроса;
		
	КонецЦикла;
	
	ПараметрыОтражения.ТекстыШаблоновОтражения.Вставить(ИмяРегистра, ТекстЗапроса);
	
КонецПроцедуры

Процедура УстановитьКонстантыПараметрыЗапроса(ПараметрыОтражения)
	
	ПустаяДата = Дата(1,1,1);
	
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ПартионныйУчетВерсии22", Истина);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ДатаПереходаНаПартионныйУчетВерсии22", ПустаяДата);
	
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ВестиУправленческийУчетОрганизаций", Истина);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ДатаНачалаВеденияУправленческогоУчетаОрганизаций", ПустаяДата);
	
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "УчитыватьСебестоимостьТоваровПоНазначениям", Ложь);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ДатаВключенияОбособленногоУчетаСебестоимостиПоНазначениям", ПустаяДата);
	
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", Ложь);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ФормироватьВидыЗапасовПоСделкам", Ложь);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ФормироватьВидыЗапасовПоПодразделениямМенеджерам", Ложь);
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "АналитическийУчетПоГруппамПродукции", Ложь);
	
	УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, "ИспользоватьУчетНДС", Ложь);
	
КонецПроцедуры

Процедура УстановитьКонстантуПараметраЗапроса(ПараметрыОтражения, ИмяКонстанты, ЗначениеПоУмолчанию)
	
	ИмяПараметра = "Константа_" + ИмяКонстанты;
	
	Если Метаданные.Константы.Найти(ИмяКонстанты) = Неопределено Тогда
		ЗначениеКонстанты = ЗначениеПоУмолчанию;
	Иначе
		ЗначениеКонстанты = Константы[ИмяКонстанты].Получить();
	КонецЕсли;
	
	ПараметрыОтражения.Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеКонстанты);
	
КонецПроцедуры
	
// Формирует текст запроса выбора кодов строк для аналитики учета партий.
// 
// Параметры:
//  ИмяДокумента - Строка - Имя документа
//  ИменаТабличныхЧастей - Строка - Имена табличных частей документа
//  ИмяРеквизитаАналитики - Строка - Имя реквизита аналитики учета номенклатуры
// 
// Возвращаемое значение:
//  Строка - Текст запроса
// 
Функция ТекстЗапросаКодыСтрокДляАналитикиУчетаПартий(ИмяДокумента, ИменаТабличныхЧастей, ИмяРеквизитаАналитики = "АналитикаУчетаНоменклатуры") Экспорт
	
	ШаблонЗапросаВыборки =
	"ВЫБРАТЬ
	|	&ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	Т.ИмяРеквизитаАналитики.Номенклатура КАК Номенклатура,
	|	Т.ИмяРеквизитаАналитики.Характеристика КАК Характеристика,
	|	СУММА(1) КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТНоменклатураДокумента
	|ИЗ
	|	ИмяТаблицыДокумента КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Т.ИмяРеквизитаАналитики.Номенклатура,
	|	Т.ИмяРеквизитаАналитики.Характеристика
	|";
	
	ШаблонЗапросаВыборки = СтрЗаменить(ШаблонЗапросаВыборки, "ИмяРеквизитаАналитики", ИмяРеквизитаАналитики);
	
	ШаблонЗапросаРезультата =
	"ВЫБРАТЬ
	|	&ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР КОГДА Итоги.КоличествоСтрок > 1
	|		ТОГДА Т.НомерСтроки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодСтроки
	|ПОМЕСТИТЬ ВТКодыСтрокДляАналитикиУчетаПартий
	|ИЗ
	|	ИмяТаблицыДокумента КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатураДокумента КАК Итоги
	|		ПО Т.ИмяРеквизитаАналитики.Номенклатура = Итоги.Номенклатура
	|		И Т.ИмяРеквизитаАналитики.Характеристика = Итоги.Характеристика
	|		И Итоги.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|";
	
	ШаблонЗапросаРезультата = СтрЗаменить(ШаблонЗапросаРезультата, "ИмяРеквизитаАналитики", ИмяРеквизитаАналитики);
	
	СтруктураТабличныеЧасти = Новый Структура(ИменаТабличныхЧастей);
	ТекстЗапросаВыборки = "";
	ТекстЗапросаРезультата = "";
	
	Для Каждого КлючИЗначение Из СтруктураТабличныеЧасти Цикл
		
		ИмяТаблицы = КлючИЗначение.Ключ;
		ПолноеИмяТаблицы = Метаданные.Документы[ИмяДокумента].ПолноеИмя() + "." + ИмяТаблицы;
		
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапросаВыборки, "&ИмяТабличнойЧасти", """" + ИмяТаблицы + """");
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ИмяТаблицыДокумента", ПолноеИмяТаблицы);
		
		Если ЗначениеЗаполнено(ТекстЗапросаВыборки) Тогда
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ПОМЕСТИТЬ ВТНоменклатураДокумента", "");
			ТекстЗапросаВыборки = ТекстЗапросаВыборки + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		
		ТекстЗапросаВыборки = ТекстЗапросаВыборки + ТекстПодзапроса;
		
		ТекстПодзапроса = СтрЗаменить(ШаблонЗапросаРезультата, "&ИмяТабличнойЧасти", """" + ИмяТаблицы + """");
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ИмяТаблицыДокумента", ПолноеИмяТаблицы);
		
		Если ЗначениеЗаполнено(ТекстЗапросаРезультата) Тогда
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ПОМЕСТИТЬ ВТКодыСтрокДляАналитикиУчетаПартий", "");
			ТекстЗапросаРезультата = ТекстЗапросаРезультата + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|";
		КонецЕсли;
		
		ТекстЗапросаРезультата = ТекстЗапросаРезультата + ТекстПодзапроса;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапросаВыборки + "
		|;
		|
		|" + ТекстЗапросаРезультата + "
		|;
		|
		|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Прочие

Процедура ПроверитьПоляЗапросаВыборкиДанных(ПараметрыОтражения, ОписаниеОперации, РазборСхемыЗапроса)
	
	Для Каждого Источники Из РазборСхемыЗапроса.ОписаниеЗапроса.Операторы[0].Источники Цикл
		Если НРег(Источники.Источник.Псевдоним) = НРег("ТаблицаДокумента") Тогда
			ИмяДокумента = Источники.Источник.ИмяТаблицы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураПоляОперации = Новый Структура;
	СтруктураПоляЗапроса  = Новый Структура;
	
	Для Каждого Описание Из ОписаниеОперации.Поля Цикл
		СтруктураПоляОперации.Вставить(Описание.Имя, Описание.Дополнительное);
	КонецЦикла;
	
	Для Каждого Описание Из РазборСхемыЗапроса.КолонкиЗапроса Цикл
		СтруктураПоляЗапроса.Вставить(Описание.Ключ);
	КонецЦикла;
	
	ТекстПоляОперации = "";
	ТекстПоляЗапроса = "";
	
	Для Каждого Описание Из СтруктураПоляОперации Цикл
		Если НЕ СтруктураПоляЗапроса.Свойство(Описание.Ключ) И НЕ Описание.Значение Тогда
			ТекстПоляОперации = ТекстПоляОперации + ?(ТекстПоляОперации = "", "", ", ") + Описание.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Описание Из СтруктураПоляЗапроса Цикл
		Если НЕ СтруктураПоляОперации.Свойство(Описание.Ключ) Тогда
			ТекстПоляЗапроса = ТекстПоляЗапроса + ?(ТекстПоляЗапроса = "", "", ", ") + Описание.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстПоляЗапроса)
	 ИЛИ ЗначениеЗаполнено(ТекстПоляОперации)
	 ИЛИ ИмяДокумента = ""
	 ИЛИ НРег(ПараметрыОтражения.МетаданныеДокумента.ПолноеИмя()) <> НРег(ИмяДокумента) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка в подготовке данных для операции'") + ": " + РазборСхемыЗапроса.ВидОперации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПоляЗапроса) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Лишние поля в запросе выборки данных операции ""%1"" для проведения документа: ""%2""'"),
				ОписаниеОперации.ВидОперации,
				ТекстПоляЗапроса));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПоляОперации) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не хватает обязательных полей в запросе выборки данных операции ""%1"" для проведения документа: ""%2""'"),
				ОписаниеОперации.ВидОперации,
				ТекстПоляОперации));
	КонецЕсли;
	
	Если ИмяДокумента = "" Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Для документа ""%1"" не найдена основная таблица запроса ""%2""'"),
			ПараметрыОтражения.МетаданныеДокумента.Имя,
			"ТаблицаДокумента");
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
	ИначеЕсли НРег(ПараметрыОтражения.МетаданныеДокумента.ПолноеИмя()) <> НРег(ИмяДокумента) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не совпадает имя документа ""%1"" с основной таблицей запроса ""%2""'"),
			ПараметрыОтражения.МетаданныеДокумента.Имя,
			ИмяДокумента);
			
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция МенеджерОбъектаПоСсылке(Документ)
	
	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ);
	
	//++ Локализация
	МетаДокумент = Метаданные.НайтиПоТипу(ТипЗнч(Документ));
	
	Если МетаДокумент = Метаданные.Документы.МаркировкаТоваровГИСМ
	 ИЛИ МетаДокумент = Метаданные.Документы.ПеремаркировкаТоваровГИСМ Тогда
	 
		ИмяМодуля = Метаданные.ОбщиеМодули.МаркировкаТоваровГИСМУТ.Имя;
		МенеджерДокумента = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
		
	КонецЕсли;
	//-- Локализация
	
	Возврат МенеджерДокумента;
	
КонецФункции

Функция ВсеПоляРегистра(МетаданныеРегистра)
	
	ПоляРегистра = Новый Структура;
	
	Для Каждого МетаПоле Из МетаданныеРегистра.Измерения Цикл
		ПоляРегистра.Вставить(МетаПоле.Имя);
	КонецЦикла; 
		
	Для Каждого МетаПоле Из МетаданныеРегистра.Ресурсы Цикл
		ПоляРегистра.Вставить(МетаПоле.Имя);
	КонецЦикла; 
	
	Для Каждого МетаПоле Из МетаданныеРегистра.Реквизиты Цикл
		ПоляРегистра.Вставить(МетаПоле.Имя);
	КонецЦикла; 
	
	Для Каждого МетаПоле Из МетаданныеРегистра.СтандартныеРеквизиты Цикл
		ПоляРегистра.Вставить(МетаПоле.Имя);
	КонецЦикла; 
	
	Возврат ПоляРегистра;
	
КонецФункции

#КонецОбласти

#КонецОбласти

// Встраивание в документ:
// Добавить область ПартионныйУчет в конец области Проведение
// Добавить в область процедуры
//	- ОписаниеРегистровУчетаЗатратИСебестоимости
//	- УстановитьДополнительныеПараметрыОперацийУчетаЗатратИСебестоимости
//	- СформироватьДополнительныеТаблицыОперацийУчетаЗатратИСебестоимости
//	- ОписаниеОперацийУчетаСебестоимости
// 	 (примеры заполнения текстов процедур см., например, в документе РеализацияТоваровУслуг)
// Добавить вызов РасчетСебестоимостиПроведениеДокументов. ОтразитьВМеханизмеУчетаЗатратИСебестоимости в процедуру ДанныеДокументаДляПроведения
