
#Область ПрограммныйИнтерфейс

// Проверка корректности банковского счета
//
// Параметры:
//  Номер        - Строка - Номер банковского счета.
//  ВалютныйСчет - Булево - Признак, является ли счет валютным.
//  ТекстОшибки  - Строка - Текст сообщения о найденных ошибках.
//
// Возвращаемое значение:
//  Булево - Истина - контрольный ключ верен, Ложь - контрольный ключ не верен.
//
Функция ПроверитьКорректностьНомераСчета(Знач Номер, ВалютныйСчет = Ложь, ТекстОшибки = "") Экспорт
	
	Результат = Истина;
	
	//++ Локализация
	Номер = СокрЛП(Номер);
	Если ПустаяСтрока(Номер) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	ДлинаНомера = СтрДлина(Номер);
	Если Не ВалютныйСчет И Не (ДлинаНомера = 20 Или ДлинаНомера = 11) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ")
			+ СтрШаблон(НСтр("ru = 'Номер счета должен состоять из 20 или 11 разрядов. Введено %1 разрядов'"), ДлинаНомера);
		Результат = Ложь;
	ИначеЕсли ДлинаНомера = 20 И Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", " ")
			+ НСтр("ru = 'В номере банковского счета присутствуют не только цифры.
				|Возможно, номер указан неверно.'");
		Результат = Ложь;
	КонецЕсли;
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный номер счета является казначейским.
//
// Параметры:
//  НомерСчета - Строка
//  
// Возвращаемое значение:
//  Булево
//
Функция ЭтоКазначейскийСчет(НомерСчета) Экспорт
	
	Результат = Ложь;
	
	//++ Локализация
	НачинаетсяНаНоль = СтрНачинаетсяС(НомерСчета, "0");
	
	КодВалютыРубль = Сред(НомерСчета, 6,3) = "643";
	
	ДлинаНомераСчетаВерна = СтрДлина(НомерСчета) = 20;
	
	Результат = НачинаетсяНаНоль И ДлинаНомераСчетаВерна И КодВалютыРубль;
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный БИК является кодом Территориального органа Федерального казначейства.
//
// Параметры:
//  КодБанка - Строка
//  
// Возвращаемое значение:
//  Булево
//
Функция ЭтоБИКТОФК(КодБанка) Экспорт
	
	Результат = Ложь;
	
	//++ Локализация
	ПервыеЦифрыБИК = Лев(КодБанка, 2);
	
	Результат = СтрДлина(СокрЛП(КодБанка)) = 9
		И (ПервыеЦифрыБИК = "00" Или ПервыеЦифрыБИК = "01" Или ПервыеЦифрыБИК = "02");
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что переданный номер счета является единым казначейским счетом.
//
// Параметры:
//  НомерСчета - Строка
//  
// Возвращаемое значение:
//  Булево
///
Функция ЭтоЕдиныйКазначейскийСчет(НомерСчета) Экспорт
	
	Результат = Ложь;
	
	//++ Локализация
	Результат = Лев(НомерСчета, 5) = "40102";
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//++ Локализация

// Проверяет, может ли номер счета соответствовать Российскому банку
// 
// Параметры:
// 	НомерСчета - Строка - номер счета 
// Возвращаемое значение:
// 	Булево - если Истина, то счет может принадлежать Российскому банку.
Функция СтрокаСоответствуетФорматуБанковскогоСчетаРФ(НомерСчета) Экспорт
	
	Если Не СтрДлина(НомерСчета) = 20 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерСчета) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проверяем особый случай: алфавитный символ в номере счета
	
	ЗаведомоЦифровыеСимволы = Лев(НомерСчета, 5) + Сред(НомерСчета, 7);
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЗаведомоЦифровыеСимволы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АлфавитныйСимвол = Сред(НомерСчета, 6, 1);
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(АлфавитныйСимвол) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЦифраШестогоРазряда = СтрНайти(ДопустимыеАлфавитныеСимволыНомераБанковскогоСчетаРФ(), АлфавитныйСимвол);
	Возврат ЦифраШестогоРазряда <> Неопределено;
	
КонецФункции


// Проверяет соответвие значения номера счета формату банковского счета РФ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПроверитьФорматСчетаРФ(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.НомерСчета)
		И Форма.СтранаБанка = ПредопределенноеЗначение("Справочник.СтраныМира.Россия")
		И НЕ СтрокаСоответствуетФорматуБанковскогоСчетаРФ(Форма.Объект.НомерСчета) Тогда
		
		Форма.Элементы.ОшибкаВНомереСчета.Заголовок = НСтр("ru = 'Номер не соответствует формату банковского счета РФ'");
		Форма.Элементы.ГруппаОшибкаВНомереСчета.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет чтение файла-реестра по зарплатному проекту.
// 
// Параметры:
//  ИмяФайла - Строка, ДвоичныеДанные - имя файла, либо файл, предствиленный в виде двоичных данных.
//  ТекстСообщения - Строка - текст сообщения.
//  ДанныеФайла - Структура, Неопределено - данные основных реквизитов файла.
//
Процедура ПрочитатьФайлРеестраОбменаСБанком(ИмяФайла, ТекстСообщения = "", ДанныеФайла = Неопределено) Экспорт

	#Если ВебКлиент Тогда
		Возврат;
	#Иначе
	
		ЧтениеXML = Новый ЧтениеXML;
		
		Если ТипЗнч(ИмяФайла) = Тип("ДвоичныеДанные") Тогда
			ЧтениеXML.ОткрытьПоток(ИмяФайла.ОткрытьПотокДляЧтения());
		Иначе
			ЧтениеXML.ОткрытьФайл(ИмяФайла);
		КонецЕсли;
		
		ГлобальнаяФабрикаXDTO = ФабрикаXDTO;
		
		Попытка
			ОбъектXDTOФайл = ГлобальнаяФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		Исключение
			
			ТекстСообщения = НСтр("ru = '<Неверный формат файла.>'");
			Возврат;
			
		КонецПопытки;
		
		КоллекцияСвойствXDTOФайл = ОбъектXDTOФайл.Свойства(); // КоллекцияСвойствXDTO
		
		Если КоллекцияСвойствXDTOФайл.Получить("РезультатЗачисленияЗарплаты") = Неопределено Тогда
			
			ТекстСообщения = НСтр("ru = '<Нет сведений о результатах зачисления денежных средств.>'");
			Возврат;
			
		КонецЕсли;
		
		Если КоллекцияСвойствXDTOФайл.Получить("ИдПервичногоДокумента") = Неопределено
			Или Не ЗначениеЗаполнено(ОбъектXDTOФайл.ИдПервичногоДокумента) Тогда
			
			ТекстСообщения = НСтр("ru = '<Не указан ИдПервичногоДокумента в загружаемом файле.>'");
			Возврат;
			
		КонецЕсли;
		
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОбъектXDTOФайл.ИдПервичногоДокумента)
			Или ОбъектXDTOФайл.ИдПервичногоДокумента = "00000000-0000-0000-0000-000000000000" Тогда
			
			ТекстСообщения = НСтр("ru = '<Неверный ИдПервичногоДокумента в загружаемом файле (ожидается не пустой GUID).>'");
			Возврат;
			
		КонецЕсли;
		
		Если ДанныеФайла = Неопределено Тогда
			ДанныеФайла = Новый Структура("Заголовок, СписокСчетов, РасчетныеСчета, ДокументыВыписки, ОшибкиРазбора");
		КонецЕсли;
		
		Заголовок = Новый Структура;
		Заголовок.Вставить("ДатаФормирования", '00010101');
		Заголовок.Вставить("НомерРеестра", "");
		Заголовок.Вставить("ДатаРеестра", '00010101');
		Заголовок.Вставить("НомерДоговора", "");
		Заголовок.Вставить("ДатаДоговора", '00010101');
		
		СписокСчетов = Новый Массив;
		РасчетныеСчета = Новый Массив;
		ДокументыВыписки = Новый Массив;
		
		Для Каждого ЭлементСтруктуры Из Заголовок Цикл
			
			Если КоллекцияСвойствXDTOФайл.Получить(ЭлементСтруктуры.Ключ) <> Неопределено
				И ОбъектXDTOФайл[ЭлементСтруктуры.Ключ] <> Неопределено Тогда
				
				Если ТипЗнч(Заголовок[ЭлементСтруктуры.Ключ]) = Тип("Дата")
					И ТипЗнч(ОбъектXDTOФайл[ЭлементСтруктуры.Ключ]) = Тип("Строка") Тогда
					Заголовок[ЭлементСтруктуры.Ключ] = XMLЗначение(Тип("Дата"), ОбъектXDTOФайл[ЭлементСтруктуры.Ключ]);
				Иначе
					Заголовок[ЭлементСтруктуры.Ключ] = ОбъектXDTOФайл[ЭлементСтруктуры.Ключ];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоллекцияСвойствXDTOФайл.Получить("РасчетныйСчетОрганизации") <> Неопределено
			И ОбъектXDTOФайл.РасчетныйСчетОрганизации <> Неопределено Тогда
			ЗаполнитьСведенияОРасчетномСчете(ОбъектXDTOФайл.РасчетныйСчетОрганизации,
												Заголовок.ДатаФормирования,
												СписокСчетов,
												РасчетныеСчета);
		Иначе
			
			БанковскийСчет = ДенежныеСредстваВызовСервераЛокализация.БанковскийСчетПодтвержденияПоПервичномуДокументу(ОбъектXDTOФайл.ИдПервичногоДокумента);
			
			Если Не ПустаяСтрока(БанковскийСчет) Тогда
				ЗаполнитьСведенияОРасчетномСчете(БанковскийСчет,
												 Заголовок.ДатаФормирования,
												 СписокСчетов,
												 РасчетныеСчета);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеФайла.Вставить("СписокСчетов", СписокСчетов);
		ДанныеФайла.Вставить("РасчетныеСчета", РасчетныеСчета);
		ДанныеФайла.Вставить("Заголовок", Заголовок);
		ДанныеФайла.Вставить("ДокументыВыписки", ДокументыВыписки);
		
		ЧтениеXML.Закрыть();
	
	#КонецЕсли

КонецПроцедуры

//-- Локализация

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

Функция ДопустимыеАлфавитныеСимволыНомераБанковскогоСчетаРФ()
	// Символы приведены в порядке, определенном письмом ЦБР от 8 сентября 1997 г. N 515
	// См. также ПроверитьКонтрольныйКлючВНомереБанковскогоСчета
	Возврат "ABCEHKMPTX";
КонецФункции

Процедура ЗаполнитьСведенияОРасчетномСчете(РасчетныйСчет, ДатаФормирования, СписокСчетов, РасчетныеСчета)
	
	СписокСчетов.Добавить(РасчетныйСчет);
	
	СведенияРасчетногоСчета = ДенежныеСредстваКлиентСервер.ДанныеРасчетногоСчета();
	СведенияРасчетногоСчета.РасчСчет = РасчетныйСчет;
	
	СведенияРасчетногоСчета.ДатаНачала = ДатаФормирования;
	СведенияРасчетногоСчета.ДатаКонца = ДатаФормирования;
	
	РасчетныеСчета.Добавить(СведенияРасчетногоСчета);
	
КонецПроцедуры

//-- Локализация

#КонецОбласти
