#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++ Локализация

// Функция получает список договоров и настроек подключений к СБП для рабочего места клиента.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица с колонками:
//		* Договор					- СправочникСсылка.ДоговорыЭквайринга - Договор эквайринга.
//		* НастройкаПодключения		- СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами - Настройка интеграции.										- Формат даты выработки
//
Функция СписокДоговоровИПодключенийСБП() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиРМКПлатежныеСистемы.ДоговорПодключенияКПлатежнойСистеме КАК ДоговорПодключения,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиРМК.ПлатежныеСистемы КАК НастройкиРМКПлатежныеСистемы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК
	|			НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	|		ПО НастройкиРМКПлатежныеСистемы.ДоговорПодключенияКПлатежнойСистеме = НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор
	|ГДЕ
	|	НастройкиРМКПлатежныеСистемы.Ссылка.РабочееМесто = &РабочееМесто";

	РабочееМестоКлиента = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();	
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМестоКлиента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//-- Локализация

#КонецОбласти

#КонецЕсли