#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.КомандаПолучитьСПорталаОткрытыхДанных.Видимость = ИнтеграцияЗЕРНО.ДоступнаЗагрузкаКлассификаторов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСПорталаОткрытыхДанных(Команда)
	
	ЗапросЭлеваторовЗавершение = Новый ОписаниеОповещения("Подключаемый_ЗапросЭлеваторовЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = ИнтеграцияЗЕРНОСлужебныйКлиент.ПараметрыОткрытияФормыЗапросаСправочника();
	ПараметрыФормы.ТипЗапроса     = "Элеваторы";
	ПараметрыФормы.СсылкаНаОбъект = ПредопределенноеЗначение("Справочник.РеестрЭлеваторовЗЕРНО.ПустаяСсылка");
	
	ИнтеграцияЗЕРНОСлужебныйКлиент.ОткрытьФормуЗапросаСправочника(ПараметрыФормы, ЭтотОбъект, ЗапросЭлеваторовЗавершение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ЗапросЭлеваторовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
	Оповестить("Запись_РеестрЭлеваторовЗЕРНО");
	
КонецПроцедуры

#КонецОбласти