
#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
//
// см. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	//++ Локализация
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭлектронноеВзаимодействие
	
	
	//++ НЕ ГОСИС
	ИнтеграцияЕГАИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияВЕТИС.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияИСМП.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	ИнтеграцияЗЕРНО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	//-- НЕ ГОСИС
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ОтправкаНаМодерациюСвязейТоваровЯндексМаркет.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.ПолучениеСтатусовМодерацииТоваровЯндексМаркет.Имя);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// КонецРаспознаваниеДокументов
	
	//-- Локализация
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
//
// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	//++ Локализация

	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭлектронноеВзаимодействие
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССайтом.ИмяМетода);
	
	

	//++ НЕ ГОСИС
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтправкаПолучениеДанныхВЕТИС.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтправкаПолучениеДанныхЗЕРНО.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СверткаРегистраСоответствиеНоменклатурыВЕТИС.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СверткаРегистраСоответствиеНоменклатурыЕГАИС.ИмяМетода);
	//-- НЕ ГОСИС
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтправкаНаМодерациюСвязейТоваровЯндексМаркет.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеРекомендацийПоСклейкеТовараЯндексМаркет.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеСтатусовМодерацииТоваровЯндексМаркет.ИмяМетода);
	
	// РаспознаваниеДокументов
	РаспознаваниеДокументов.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// КонецРаспознаваниеДокументов
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти