
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелИнформационнойБазы = ПараметрКоманды;
	
	Отбор              = Новый Структура("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ЗначенияЗаполнения = Новый Структура("УзелИнформационнойБазы", УзелИнформационнойБазы);
		
	ОбменДаннымиКлиент.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор,
		ЗначенияЗаполнения, "НастройкиАрхиваСообщенийОбменов", ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры
	
#КонецОбласти
