#Область ПрограммныйИнтерфейс

Процедура ОповеститьОЗавершении() Экспорт
	
	НовыхЗаписей = ОбменМобильныеАвтономныйСервер.ПринятоОтправленоНовыхЗаписей();
	Если НовыхЗаписей.Принято <> 0 ИЛИ НовыхЗаписей.Отправлено <> 0 Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Номенклатура"));
		ОбновитьИнтерфейс();
		ПоказатьОповещениеПользователя("Выполнена синхронизация", , "Принято объектов: " + НовыхЗаписей.Принято + " Отправлено объектов: " + НовыхЗаписей.Отправлено);
	КонецЕсли

КонецПроцедуры

#КонецОбласти