
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПубликацияТоваров(Команда)

	ОчиститьСообщения();

	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени(
		"Обработка.УправлениеПродажамиНаOzon.Форма.ПубликацияТоваров.ОткрытиеФормы");

	ОткрытьФорму("Обработка.УправлениеПродажамиНаOzon.Форма.ПубликацияТоваров");

	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)

	ОчиститьСообщения();

	ВидыЦенУчетныхЗаписейOzon = ВидыЦенУчетныхЗаписейOzon();
	Если ВидыЦенУчетныхЗаписейOzon.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В настройках синхронизации с маркетплейсом Ozon не указаны выгружаемые виды цен, а также не созданы виды цен для загрузки данных с маркетплейса Ozon.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("ВидыЦен", ВидыЦенУчетныхЗаписейOzon);
	ОткрытьФорму("Обработка.ПрайсЛист.Форма.Форма", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВидыЦенУчетныхЗаписейOzon()

	Возврат Справочники.УчетныеЗаписиМаркетплейсов.ВидыЦенУчетныхЗаписейМаркетплейсаOzon();

КонецФункции

#КонецОбласти