
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборДокументОснование") Тогда // Форма открыта в режиме просмотра по документу основания
		ИзменитьЗапросНаОтборПоДокументуОснования(Параметры);
	КонецЕсли;
	
	Если Не Параметры.Свойство("КлючНазначенияФормы")
		Или ПустаяСтрока(Параметры.КлючНазначенияФормы) Тогда
		КлючНазначенияИспользования = КлючНазначенияФормыПоУмолчанию();
		КлючНастроек = "";
	Иначе
		КлючНазначенияИспользования = Параметры.КлючНазначенияФормы;
		КлючНастроек = Параметры.КлючНазначенияФормы;
	КонецЕсли;
	
	ВосстановитьНастройки();
	
	ЗаполнитьРеквизитыФормыПриСоздании();
	НастроитьЭлементыФормыПриСоздании();
	
	ИспользуемыеТипыДокументов = Новый Массив;
	Для каждого ОписаниеОперации Из ХозяйственныеОперацииИДокументы Цикл
		ИспользуемыеТипыДокументов.Добавить(Тип("ДокументСсылка." + СтрРазделить(ОписаниеОперации.ПолноеИмяДокумента, ".")[1]));
	КонецЦикла;
	
	ПоказатьКоличествоВыбранныхТиповДокументов();
	ПоказатьОтборПоПериоду();
	ОбновитьОтборТребующихРеакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыполнитьПериодическиеДействияНаКлиенте", 60);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл"
		Или ИмяСобытия = "Запись_ДокументыЭПД"
		Или ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ДокументыЭПД" Тогда
	
		ОбновитьОтборТребующихРеакцию();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ПриИзмененииОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	ПриИзмененииОтбора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, СтрокиСписка)
	
	Ключи = СтрокиСписка.ПолучитьКлючи();
	СтрокаСписка = СтрокиСписка.Получить(Ключи[0]);
	Если Не СтрокаСписка.Данные.Свойство("ДокументОснование") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка,
		|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Представление КАК ДокументОснованиеПредставление
		|ИЗ
		|	Документ.ЭлектроннаяТранспортнаяНакладная.ДокументыОснования КАК ЭлектроннаяТранспортнаяНакладнаяДокументыОснования
		|ГДЕ
		|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка В (&Документы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйЗаказНарядДокументыОснования.Ссылка,
		|	ЭлектронныйЗаказНарядДокументыОснования.ДокументОснование.Представление КАК ДокументОснованиеПредставление
		|ИЗ
		|	Документ.ЭлектронныйЗаказНаряд.ДокументыОснования КАК ЭлектронныйЗаказНарядДокументыОснования
		|ГДЕ
		|	ЭлектронныйЗаказНарядДокументыОснования.Ссылка В (&Документы)";
		
	Ссылки = Новый Массив;
	Для Каждого Ключ Из Ключи Цикл //РегистрСведенийКлючЗаписи
		Ссылки.Добавить(Ключ.Ссылка);
	КонецЦикла;
		
	Запрос.УстановитьПараметр("Документы", Ссылки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого Строка Из СтрокиСписка Цикл
		Строка = СтрокиСписка[Строка.Ключ];
		Выборка.Сбросить();
		СтрокиДокументОснование = Новый Массив();
		Пока Выборка.НайтиСледующий(Строка.Данные["Ссылка"], "Ссылка") Цикл 
			СтрокиДокументОснование.Добавить(Выборка.ДокументОснованиеПредставление);
		КонецЦикла;
		Если СтрокиДокументОснование.Количество() Тогда
			Строка.Данные["ДокументОснование"] = СтрСоединить(СтрокиДокументОснование, ", " + Символы.ПС);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ПредставлениеСостояния Тогда
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(ДанныеСтроки.Ссылка, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		Возврат;
	КонецЕсли; 
	
	ОбменСГИСЭПДКлиентПереопределяемый.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ОбменСГИСЭПДКлиентПереопределяемый.УстановитьПометкуУдаления(Элемент, Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование = Истина Тогда
		Отказ = Истина;
		СписокСкопировать();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОбменСГИСЭПДКлиентПереопределяемый.ИзменитьЭлемент(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборВсе(Команда)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ТекущийШагВыполнен");
	
	Элементы.КнопкаОтборНеобработанные.Пометка = Ложь;
	Элементы.КнопкаОтборВсе.Пометка = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборНеобработанные(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТекущийШагВыполнен", Ложь);
	
	Элементы.КнопкаОтборВсе.Пометка = Ложь;
	Элементы.КнопкаОтборНеобработанные.Пометка = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалГиперссылка(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	ОбменСГИСЭПДКлиентПереопределяемый.РедактироватьПериод(СписокИнтервал,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументыЭДО(Команда)
	
	Элементы.СписокПолучитьДокументыЭДО.Доступность = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДокументыЭДОЗавершение", ЭтотОбъект);
	ИнтерфейсДокументовЭДОКлиент.НачатьОтправкуПолучениеДокументов(ЭтотОбъект, Оповещение);

КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийСписок(ЭтотОбъект));
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, ТекущийСписок(ЭтотОбъект), Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТекущийСписок(ЭтотОбъект));
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура НастроитьОтбор(Команда)
	
	ВидыДокументов = ПолучитьВидыДокументов();
	
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("ЗакончитьВыборТиповЭПД", ЭтотОбъект);
	
	ВидыДокументов.ПоказатьОтметкуЭлементов(ОповещениеПослеВыбора, НСтр("ru = 'Виды документов'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭЗН(Команда)
	ОткрытьФорму("Документ.ЭлектронныйЗаказНаряд.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭСВ(Команда)
	ОткрытьФорму("Документ.ЭлектроннаяСопроводительнаяВедомость.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭТН(Команда)
	ОткрытьФорму("Документ.ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭЗЗ(Команда)
	ОткрытьФорму("Документ.ЭлектронныйЗаказЗаявка.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭДФ(Команда)
	ОткрытьФорму("Документ.ЭлектронныйДоговорФрахтования.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭПЛ(Команда)
	ОткрытьФорму("Документ.ЭлектронныйПутевойЛист.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СписокУстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	ОбменСГИСЭПДКлиентПереопределяемый.РедактироватьПериод(СписокИнтервал,, Оповещение);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолучитьДокументыЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокПолучитьДокументыЭДО.Доступность = Истина;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция КоличествоСтрокСОтбором(ПараметрыОтбора)

	ИсполняемаяСхема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	ИсполняемыеНастройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		МассивОтбор = Новый Массив;
		МассивОтбор.Добавить(ПараметрыОтбора);
	ИначеЕсли ТипЗнч(ПараметрыОтбора) = Тип("Массив") Тогда
		МассивОтбор = ПараметрыОтбора;
	Иначе
		МассивОтбор = Новый Массив;
	КонецЕсли;
	
	Для Каждого ОписаниеОтбора Из МассивОтбор Цикл
		НовыйОтбор = ИсполняемыеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ОписаниеОтбора.ЛевоеЗначение);
		НовыйОтбор.ПравоеЗначение = ОписаниеОтбора.ПравоеЗначение;
		Если ОписаниеОтбора.Свойство("ВидСравнения") Тогда
			НовыйОтбор.ВидСравнения = ОписаниеОтбора.ВидСравнения;
		КонецЕсли;
		НовыйОтбор.Использование = Истина;
	КонецЦикла;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ИсполняемаяСхема, ИсполняемыеНастройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультат = ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаРезультат.Количество();

КонецФункции


&НаКлиенте
Процедура ВыполнитьПериодическиеДействияНаКлиенте()
	
	ОбновитьОтборТребующихРеакцию();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборТребующихРеакцию()
	
	ПараметрыОтбора = Новый Структура; 
	ПараметрыОтбора.Вставить("ЛевоеЗначение", "ТекущийШагВыполнен");
	ПараметрыОтбора.Вставить("ПравоеЗначение", Ложь);
	КоличествоСтрокТребуютРеакцию = КоличествоСтрокСОтбором(ПараметрыОтбора);
	
	Элементы.КнопкаОтборНеобработанные.Заголовок = Команды.ОтборНеобработанные.Заголовок 
													+ " (" + КоличествоСтрокТребуютРеакцию + ")";
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	Если Параметры.Свойство("ОтборыФормыСписка") Тогда
		
		ОтборТипыДокументов.ЗагрузитьЗначения(Параметры.ОтборыФормыСписка.ОтборТипыДокументов.ВыгрузитьЗначения());
		
	ИначеЕсли Параметры.Свойство("ТипЭПД") Тогда
		 
		ОтборТипыДокументов.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("Имя", Метаданные.НайтиПоТипу(Параметры.ТипЭПД).Имя));
		
	Иначе
	
		Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ЭлектронныеПеревозочныеДокументы.Форма.ФормаСпискаЭПД", КлючНазначенияИспользования);
		
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		
			Настройки.Свойство("ОтборОрганизация", ОтборОрганизация);
			Настройки.Свойство("ОтборКонтрагент", ОтборКонтрагент);
			
			Если Настройки.Свойство("ОтборТипыДокументов") Тогда
				ОтборТипыДокументов.ЗагрузитьЗначения(Настройки.ОтборТипыДокументов.ВыгрузитьЗначения());
			КонецЕсли;
			
			Если Настройки.Свойство("ОтборХозяйственныеОперации") Тогда
				ОтборХозяйственныеОперации.ЗагрузитьЗначения(Настройки.ОтборХозяйственныеОперации.ВыгрузитьЗначения());
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", "Дата");
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗапросНаОтборПоДокументуОснования(Параметры)

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, Список);
	СвойстваСписка.ТекстЗапроса = Обработки.ЭлектронныеПеревозочныеДокументы.ЗапросПоДокументуОснования();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Список.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Параметры.ОтборДокументОснование);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючНазначенияФормыПоУмолчанию()
	
	Возврат "ФормаСпискаЭПД";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормыПриСоздании()
	
	ИнициализироватьХозяйственныеОперацииИДокументы(ХозяйственныеОперацииИДокументы, КлючНазначенияИспользования);
	
	// ОтборТипыДокументов
	Если ОтборТипыДокументов.Количество() = 0 Тогда
		Для Каждого Стр Из ХозяйственныеОперацииИДокументы Цикл
			
			ОтборТипыДокументов.Добавить(Стр.ТипДокумента, , Истина);
			
		КонецЦикла;
	КонецЕсли;
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыборТиповЭПД(ЭлементыВыбора, Параметры) Экспорт
	
	Если ЭлементыВыбора <> Неопределено Тогда
		ОтборТипыДокументов.Очистить();
		
		ОтборПоОперациям = Новый Структура;
		
		КоличествоВыбрано = 0;
		Для Каждого СтрокаТипДокумента Из ЭлементыВыбора Цикл
			Если СтрокаТипДокумента.Пометка Тогда
				КоличествоВыбрано = КоличествоВыбрано + 1;
				
				ОтборТипыДокументов.Добавить(СтрокаТипДокумента.Значение);
				ОтборПоОперациям.Вставить("ТипДокумента", СтрокаТипДокумента.Значение);
				
				РезультатПоиска = ХозяйственныеОперацииИДокументы.НайтиСтроки(ОтборПоОперациям);
				Для Каждого СтрокаХозОперации Из РезультатПоиска Цикл
					
					СтрокаХозОперации.Отбор = Истина;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПриИзмененииОтбора();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнициализироватьХозяйственныеОперацииИДокументы(ХозяйственныеОперацииИДокументы, КлючНазначенияИспользования)
	
	// Электронный заказ-наряд
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектронныйЗаказНаряд.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектронныйЗаказНаряд");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Заказ-наряд'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 1;
	Строка.ГруппаКнопок                   = "ЭПД";
	
	// Электронная транспортная накладная
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектроннаяТранспортнаяНакладная.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Транспортная накладная'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 3;
	Строка.ГруппаКнопок                   = "ЭПД";
	
	// Электронная сопроводительная ведомость
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектроннаяСопроводительнаяВедомость.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектроннаяСопроводительнаяВедомость");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Сопроводительная ведомость'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 2;
	Строка.ГруппаКнопок                   = "ЭПД";
	
	// Электронный заказ (заявка)
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектронныйЗаказЗаявка.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектронныйЗаказЗаявка");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Заказ (заявка)'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 3;
	Строка.ГруппаКнопок                   = "ЭПД";
	
	// Электронный договор фрахтования
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектронныйДоговорФрахтования.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектронныйДоговорФрахтования");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Договор фрахтования'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 3;
	Строка.ГруппаКнопок                   = "ЭПД";
	
	// Электронный путевой лист
	Строка = ХозяйственныеОперацииИДокументы.Добавить();
	Строка.ПолноеИмяДокумента             = Метаданные.Документы.ЭлектронныйПутевойЛист.ПолноеИмя();
	Строка.ТипДокумента					  = Тип("ДокументСсылка.ЭлектронныйПутевойЛист");
	Строка.КлючНазначенияИспользования    = КлючНазначенияИспользования;
	Строка.ЗаголовокРабочегоМеста         = НСтр("ru = 'Путевой лист'");
	Строка.ДобавитьКнопкуСоздать          = Истина;
	Строка.ПравоДоступаДобавление         = Истина;
	Строка.Отбор                          = Истина;
	Строка.ПравоДоступаИзменение          = Истина;
	Строка.Порядок                        = 3;
	Строка.ГруппаКнопок                   = "ЭПД";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидыДокументов()

	ВидыДокументов = Новый СписокЗначений; 
	
	Для Каждого ЭлементОтбора Из ХозяйственныеОперацииИДокументы Цикл
		
		Отбор = ОтборТипыДокументов.НайтиПоЗначению(ЭлементОтбора.ТипДокумента) <> Неопределено;
		ВидыДокументов.Добавить(ЭлементОтбора.ТипДокумента, ЭлементОтбора.ЗаголовокРабочегоМеста, Отбор);
		
	КонецЦикла;
	
	Возврат ВидыДокументов;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании()
	
	Если Параметры.Свойство("СтруктураБыстрогоОтбора") Тогда
		Если Параметры.СтруктураБыстрогоОтбора.Свойство("ПолноеИмяДокумента") Тогда
						
			Отбор = Новый Структура();
			Отбор.Вставить("ПолноеИмяДокумента", Параметры.СтруктураБыстрогоОтбора.ПолноеИмяДокумента);
			
			НайденныеСтроки = ХозяйственныеОперацииИДокументы.НайтиСтроки(Отбор);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.Отбор = Истина;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФормуПоНастройкамХозяйственныхОперацийИДокументов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоНастройкамХозяйственныхОперацийИДокументов()
	
	ДанныеРабочегоМеста = ДанныеРабочегоМеста(
		ХозяйственныеОперацииИДокументы.Выгрузить(), 
		КлючНазначенияФормыПоУмолчанию(), 
		НСтр("ru = 'Электронные перевозочные документы'"));
	
	Заголовок = ДанныеРабочегоМеста.ЗаголовокРабочегоМеста;
	
КонецПроцедуры

&НаСервере
Функция ДанныеРабочегоМеста(ТаблицаХозОперацииИТипыДокументов, КлючНазначенияФормыПоУмолчанию, ЗаголовокФормыПоУмолчанию)
	
	ОтобранныеХозОперацииИТипыДокументов = ТаблицаХозОперацииИТипыДокументов.Скопировать(Новый Структура("Отбор",Истина),
		"КлючНазначенияИспользования,ЗаголовокРабочегоМеста");
	ОтобранныеХозОперацииИТипыДокументов.Свернуть("КлючНазначенияИспользования,ЗаголовокРабочегоМеста");
	
	ДанныеРабочегоМеста = Новый Структура("КлючНазначенияИспользования,ЗаголовокРабочегоМеста",
		КлючНазначенияФормыПоУмолчанию, ЗаголовокФормыПоУмолчанию);
		
	Если ОтобранныеХозОперацииИТипыДокументов.Количество() = 1 Тогда
		Если ЗначениеЗаполнено(ОтобранныеХозОперацииИТипыДокументов[0].КлючНазначенияИспользования) Тогда
			ДанныеРабочегоМеста.КлючНазначенияИспользования = ОтобранныеХозОперацииИТипыДокументов[0].КлючНазначенияИспользования;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтобранныеХозОперацииИТипыДокументов[0].ЗаголовокРабочегоМеста) Тогда
			ДанныеРабочегоМеста.ЗаголовокРабочегоМеста = ОтобранныеХозОперацииИТипыДокументов[0].ЗаголовокРабочегоМеста;	
		КонецЕсли;			
	КонецЕсли;
	
	Возврат ДанныеРабочегоМеста;
	
КонецФункции

&НаСервере
Процедура ПоказатьКоличествоВыбранныхТиповДокументов()
	
	Если ОтборТипыДокументов.Количество() < ХозяйственныеОперацииИДокументы.Количество() Тогда
		Элементы.НастроитьОтбор.Заголовок = Команды.НастроитьОтбор.Заголовок 
												+ " (" + ОтборТипыДокументов.Количество() + " из " + ХозяйственныеОперацииИДокументы.Количество() + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтборПоПериоду()
	
	Если ЗначениеЗаполнено(СписокИнтервал.ДатаНачала)
	Или ЗначениеЗаполнено(СписокИнтервал.ДатаОкончания) Тогда
		Элементы.СписокУстановитьИнтервалГиперссылка.Заголовок = Формат(СписокИнтервал.ДатаНачала, "ДЛФ=D;")
																	+ " - "
																	+ Формат(СписокИнтервал.ДатаОкончания, "ДЛФ=D;");
		Элементы.СписокУстановитьИнтервалГиперссылка.Видимость = Истина;
	Иначе
		Элементы.СписокУстановитьИнтервалГиперссылка.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбора()
	
	СохранитьНастройки();
	УстановитьОтборыДинамическогоСписка();
	
	ПоказатьКоличествоВыбранныхТиповДокументов();
	ПоказатьОтборПоПериоду();
		
	ОбновитьОтборТребующихРеакцию();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если ФормыОткрытаПоГиперссылке Тогда
		Возврат;
	КонецЕсли;
	
	ИменаСохраняемыхРеквизитов =
		"ОтборОрганизация,ОтборКонтрагент,
		|ОтборХозяйственныеОперации,
		|ОтборТипыДокументов";
	
	Настройки = Новый Структура(ИменаСохраняемыхРеквизитов);
	ЗаполнитьЗначенияСвойств(Настройки, ЭтотОбъект);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ЭлектронныеПеревозочныеДокументы.Форма.ФормаСпискаЭПД", КлючНазначенияИспользования, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическогоСписка()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"ТипСсылки",
		ОтборТипыДокументов,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Организация",
		ОтборОрганизация,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ОтборОрганизация));
		
	ОтборСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ГруппаОтборКонтрагент = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
								ОтборСписка,
								"Контрагент",
								ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
								
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтборКонтрагент,
		"Грузоотправитель",
		ОтборКонтрагент,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ОтборКонтрагент));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтборКонтрагент,
		"Перевозчик",
		ОтборКонтрагент,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ОтборКонтрагент));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтборКонтрагент,
		"Грузополучатель",
		ОтборКонтрагент,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ОтборКонтрагент));
		
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", СписокИнтервал.ДатаНачала);
	
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(СписокИнтервал.ДатаОкончания),
			КонецДня(СписокИнтервал.ДатаОкончания),
			СписокИнтервал.ДатаОкончания));
				
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущийСписок(Форма)

	Возврат Форма.Элементы.Список;

КонецФункции

&НаКлиенте
Процедура СписокСкопировать()
	
	ОбменСГИСЭПДКлиентПереопределяемый.СкопироватьЭлемент(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти