////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиСлужебныйКлиентСервер: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстСлужебногоМаркераВЖР() Экспорт
	
	Возврат НСтр("ru = '#ДеталиОшибкиВыведены#'");
	
КонецФункции

// Возвращает дату, с которой Сбербанк отключил возможность подписания документов по sms.
// 
// Возвращаемое значение:
// Дата
//
Функция ДатаОтключенияПодписанияSMSСбербанк() Экспорт

	Возврат '2023-06-01';
	
КонецФункции

#КонецОбласти
