
#Область ПрограммныйИнтерфейс

// Переопределение настроек присоединенных файлов.
//
// см. РаботаСФайламиПереопределяемый.ПриОпределенииНастроек
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииНастроек(Настройки);
	// Конец ЭлектронноеВзаимодействие
	
	ИнтеграцияЕГАИС.ПриОпределенииНастроекРаботыСФайлами(Настройки);
	ИнтеграцияВЕТИС.ПриОпределенииНастроекРаботыСФайлами(Настройки);
	ИнтеграцияИСМП.ПриОпределенииНастроекРаботыСФайлами(Настройки);
	ИнтеграцияЗЕРНО.ПриОпределенииНастроекРаботыСФайлами(Настройки);
	
	//-- Локализация
		
КонецПроцедуры

// Позволяет переопределить справочники хранения файлов по типам владельцев.
// 
// см. РаботаСФайламиПереопределяемый.ПриОпределенииСправочниковХраненияФайлов
//
Процедура ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников) Экспорт
	
	//++ Локализация

	
	//++ НЕ ГОСИС
	ИнтеграцияГИСМ.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
	ИнтеграцияИСМП.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
	ИнтеграцияЕГАИС.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
	ИнтеграцияВЕТИС.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
	ИнтеграцияЗЕРНО.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
	//-- НЕ ГОСИС
	

	//-- Локализация
	
КонецПроцедуры

#КонецОбласти