#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Взаиморасчеты

// Создает и заполняет/удаляет элементы справочника "Объекты расчетов" перед записью связанного объекта.
// Для платежных документов создание происходит раньше, в методе ВзаиморасчетыСервер.ПроверитьЗаполнитьРасшифровкуПлатежа.
//
// Параметры:
// 	Объект - СправочникОбъект, ДокументОбъект - Записываемый объект.
// 	МассивСтруктур - Массив из см. ВзаиморасчетыСервер.ПараметрыМеханизма - Массив структур параметров взаиморасчетов.
// 	РежимЗаписи - РежимЗаписиДокумента - Режим записи, если метод вызывается из события ПередЗаписью.
// 	Отказ - Булево - Флаг Отказ из объекта.
//
Процедура ПроверитьОбъектыРасчетовПередЗаписью(Объект, МассивСтруктур, РежимЗаписи, Отказ) Экспорт
	
	// Очистка объекта от ссылок на объекты расчетов.
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОчиститьОбъектыРасчетов(Объект, МассивСтруктур);
	КонецЕсли;
	
	МассивОбъектовРасшифровки = Новый Массив();
	ТаблицаСторон = ТаблицаСторон(Объект, МассивСтруктур);
	Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка");
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
			Ссылка = СтруктураПараметров.СсылкаНового;
		КонецЕсли;
		
		//Создание элементов справочника
		ОбъектРасчетов = Неопределено;
		Если СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) Тогда
			ОбъектРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров,,РежимЗаписи);
		КонецЕсли;
		
		//Заполнение расшифровки платежа
		Если ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа)
			И СтруктураПараметров.ИзменяетРасчеты Тогда
			
			СуммыДокумента        = ВзаиморасчетыСервер.СуммыДокумента(Объект, СтруктураПараметров);
			
			//Документ мультивалютный, расшифровку не проверяем.
			Если СуммыДокумента.СуммаДокументаБезЗалога = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			РасшифровкаПлатежа = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОбъектовРасшифровки, РасшифровкаПлатежа.Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов"));
			
			Валюта                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
			Дата                  = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата);
			ЗаказОснование        = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
			Договор               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
			ПорядокРасчетов       = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
			Организация           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
			ТипРасчетов           = СтруктураПараметров.ТипРасчетов;
			
			//В документах возврата Порядок расчетов не кэшируется и получается из договора.
			Если ПорядокРасчетов = Неопределено Тогда
				Договор = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
				Если ЗначениеЗаполнено(Договор) Тогда
					ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов")
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент
				И Метаданные.ОпределяемыеТипы.ОбъектРасчетовАванс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
				
				СтрокиСПустымОбъектом = РасшифровкаПлатежа.Выгрузить(Новый Структура("ОбъектРасчетов",Справочники.ОбъектыРасчетов.ПустаяСсылка()));
				МассивВалютВзаиморасчетов = СтрокиСПустымОбъектом.ВыгрузитьКолонку("ВалютаВзаиморасчетов");
				МассивВалютВзаиморасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВалютВзаиморасчетов);
				Если МассивВалютВзаиморасчетов.Количество() > 1 Тогда
					ТекстОшибки = НСтр("ru = 'Запрещено указывать разные валюты взаиморасчетов для неразнесенного платежа.'");
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
					Отказ = Истина;
				КонецЕсли;
				
				ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(
					Валюта,
					Дата,
					РасшифровкаПлатежа,
					Организация);
				
				ЗаполнитьСтавкуНДС = РасшифровкаПлатежа.Количество() > 0 
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РасшифровкаПлатежа[0], "СтавкаНДС");
				СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				
				Если СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(ЗаказОснование) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ЗаказОснование, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
								СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
								ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРасшифровки, СтруктураДействий, Неопределено);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли СтрокиСПустымОбъектом.Количество() > 0 И ЗначениеЗаполнено(Договор) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов);
					Если ЗаполнитьСтавкуНДС Тогда
						СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
					КонецЕсли;
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС И ЗначениеЗаполнено(СтавкаНДС) Тогда
								СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
								СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
								СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
								ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРасшифровки, СтруктураДействий, Неопределено);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				Иначе
					ОбъектыРасчетов = ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров, Истина, РежимЗаписи);
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Организация");
					СтруктураПоиска.Вставить("Контрагент");СтруктураПоиска.Вставить("Партнер");
					
					Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
							
							Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
								Идентификатор = СтрокаРасшифровки.ПолучитьИдентификатор();
							Иначе
								Идентификатор = СтрокаРасшифровки.НомерСтроки;
							КонецЕсли;
							
							Если СтруктураПараметров.ОрганизацияВСтроках Тогда
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация, Идентификатор);
							Иначе
								СтруктураПоиска.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
							КонецЕсли;
							
							Если СтруктураПараметров.КонтрагентВСтроках Тогда
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент, Идентификатор);
							Иначе
								СтруктураПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
							КонецЕсли;
							
							Если СтруктураПараметров.ПартнерВСтроках Тогда
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер, Идентификатор);
							Иначе
								СтруктураПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
							КонецЕсли;
							
							СтрокаРасшифровки.ОбъектРасчетов = ОбъектыРасчетов.НайтиСтроки(СтруктураПоиска)[0].ОбъектРасчетов;
							Если ЗаполнитьСтавкуНДС Тогда
								СтавкаНДС = ДенежныеСредстваСервер.СтавкаНДСОбъектаРасчетов(Организация, СтрокаРасшифровки.ОбъектРасчетов, ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
								Если ЗначениеЗаполнено(СтавкаНДС) Тогда
									СтрокаРасшифровки.СтавкаНДС = СтавкаНДС;
									СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Истина);
									СтруктураДействий = Новый Структура("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
									ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРасшифровки, СтруктураДействий, Неопределено);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли СтруктураПараметров.ЭтоПродажаЗакупка И ЗначениеЗаполнено(ОбъектРасчетов) Тогда
				
				СуммаДокумента        = СуммыДокумента.СуммаЗалогаЗаТару + СуммыДокумента.СуммаДокументаБезЗалога;
				СуммаВзаиморасчетов   = СуммыДокумента.СуммаВзаиморасчетовБезЗалога + СуммыДокумента.СуммаВзаиморасчетовПоТаре;
				ВзаиморасчетыСервер.ЗаполнитьСуммыРасшифровкиНакладной(СуммаДокумента, СуммаВзаиморасчетов, РасшифровкаПлатежа, ОбъектРасчетов);
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураПараметров.Организация = Справочники.Организации.УправленческаяОрганизация Тогда
			МассивОбъектовРасшифровки.Добавить(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ОбъектРасчетов));
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаление лишних элементов справочника.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаСторон.Организация КАК Организация,
	|	ТаблицаСторон.Контрагент  КАК Контрагент,
	|	ТаблицаСторон.Партнер     КАК Партнер,
	|	ТаблицаСторон.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаСторон.ТипРасчетов КАК ТипРасчетов
	|ПОМЕСТИТЬ ТаблицаСторон
	|ИЗ &ТаблицаСторон КАК ТаблицаСторон
	|;
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСторон КАК ТаблицаСторон
	|			ПО ТаблицаСторон.Организация = ОбъектыРасчетов.Организация
	|				И ТаблицаСторон.ТипРасчетов = ОбъектыРасчетов.ТипРасчетов
	|				И ТаблицаСторон.Контрагент = ОбъектыРасчетов.Контрагент
	|				И ТаблицаСторон.Партнер = ОбъектыРасчетов.Партнер
	|				И ТаблицаСторон.ВалютаВзаиморасчетов = ОбъектыРасчетов.ВалютаВзаиморасчетов
	|				И НЕ ОбъектыРасчетов.ТолькоОстатки
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &Ссылка
	|	И ТаблицаСторон.ТипРасчетов ЕСТЬ NULL
	|	И ОбъектыРасчетов.Ссылка НЕ В (&МассивОбъектовРасшифровки)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТаблицаСторон", ТаблицаСторон);
	Запрос.УстановитьПараметр("МассивОбъектовРасшифровки", МассивОбъектовРасшифровки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ОбъектыРасчетов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Блокировка.Заблокировать();
		
		ПроверитьУдалитьОбъектРасчетов(Выборка.Ссылка, Отказ, НЕ Выборка.ТолькоОстатки);
	КонецЦикла;
	
	//Заполнение объектов расчетов в Объект
	Если НЕ Отказ И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЗаполнитьОбъектРасчетов(Объект, МассивСтруктур,, РежимЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Создает, перезаполняет при необходимости и возвращает ссылку на объект расчетов по параметрам механизма взаиморасчетов.
// Если в рамках одной структуры было создано несколько элементов объектов расчетов то возвращает первый.
// 
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект - Объект, по ссылке на который проверяется объект расчетов.
// 	СтруктураПараметров - Структура - Текущий набор параметров. см. ВзаиморасчетыСервер.ПараметрыМеханизма.
// 	ВернутьВсеОбъекты - Булево - Вернуть один объект расчетов или таблицу всех объектов расчетов.
// 	РежимЗаписи - РежимЗаписиДокумента - Режим записи, если метод вызывается из события ПередЗаписью.
// 	
// Возвращаемое значение:
// 	СправочникСсылка.ОбъектыРасчетов - Ссылка на объект расчетов.
//
Функция ПроверитьЗаполнитьОбъектРасчетовПоСтруктуре(Объект, СтруктураПараметров, ВернутьВсеОбъекты = Ложь, РежимЗаписи = Неопределено) Экспорт
	
	Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
		Ссылка = СтруктураПараметров.СсылкаНового;
	Иначе
		Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка);
	КонецЕсли;
	
	ОрганизацияВСтроках = СтруктураПараметров.ОрганизацияВСтроках И ТипЗнч(СтруктураПараметров.Организация) = Тип("Строка");
	КонтрагентВСтроках  = СтруктураПараметров.КонтрагентВСтроках И ТипЗнч(СтруктураПараметров.Контрагент) = Тип("Строка");
	
	ТаблицаСторон = ТаблицаСторон(Объект, СтруктураПараметров);
	ТаблицаСторон.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	
	СуммаВзаиморасчетов = 0;
	Если СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент  И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
		Для Каждого Стр Из ТабличнаяЧасть Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "СуммаВзаиморасчетов") Тогда
				СуммаВзаиморасчетов = СуммаВзаиморасчетов + Стр.СуммаВзаиморасчетов;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из ТаблицаСторон Цикл
		
		ПараметрыОбъектаРасчетов = РеквизитыОбъектаРасчетовПоСтруктуре(Объект, Ссылка, СтруктураПараметров, РежимЗаписи);
		
		//Ключевые реквизиты.
		ПараметрыОбъектаРасчетов.Организация = Стр.Организация;
		ПараметрыОбъектаРасчетов.Контрагент = Стр.Контрагент;
		ПараметрыОбъектаРасчетов.Партнер =  Стр.Партнер;
		
		Если ЗначениеЗаполнено(Стр.ВалютаВзаиморасчетов) ИЛИ ТипЗнч(ПараметрыОбъектаРасчетов.ВалютаВзаиморасчетов) = Тип("Массив") Тогда
			ПараметрыОбъектаРасчетов.ВалютаВзаиморасчетов = Стр.ВалютаВзаиморасчетов;
		КонецЕсли;
		Если СуммаВзаиморасчетов > 0 Тогда
			ПараметрыОбъектаРасчетов.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
		КонецЕсли;
		
		ДополнительныеРеквизиты = ?(Объект.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено,
									Объект.ДополнительныеРеквизиты.Выгрузить(),
									Неопределено);
		
		ОбновлениеИБ = СтруктураПараметров.Свойство("ТолькоОстатки") И СтруктураПараметров.ТолькоОстатки;
		
		ЕстьИзмененияВОбъектеРасчетов = Ложь;
		Если ЗначениеЗаполнено(ПараметрыОбъектаРасчетов.Организация)
			И ЗначениеЗаполнено(ПараметрыОбъектаРасчетов.Контрагент)
			И ЗначениеЗаполнено(ПараметрыОбъектаРасчетов.Партнер)
			И ЗначениеЗаполнено(ПараметрыОбъектаРасчетов.ВалютаВзаиморасчетов) Тогда
			Стр.ОбъектРасчетов = ПроверитьСоздатьОбъектРасчетов(ПараметрыОбъектаРасчетов, ДополнительныеРеквизиты, ОбновлениеИБ, ЕстьИзмененияВОбъектеРасчетов);
		КонецЕсли;
		Если ЕстьИзмененияВОбъектеРасчетов Тогда
			Объект.ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииОбъектаРасчетов", Истина);
			Объект.ДополнительныеСвойства.Вставить("ИзмененныйОбъектРасчетов", Стр.ОбъектРасчетов);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВернутьВсеОбъекты Тогда
		Если ОрганизацияВСтроках И КонтрагентВСтроках Тогда
			ТаблицаСторон.Индексы.Добавить("Организация, Контрагент");
		ИначеЕсли ОрганизацияВСтроках Тогда
			ТаблицаСторон.Индексы.Добавить("Организация");
		Иначе
			ТаблицаСторон.Индексы.Добавить("Контрагент");
		КонецЕсли;
		
		Возврат ТаблицаСторон;
	ИначеЕсли ТаблицаСторон.Количество() > 0 Тогда
		Возврат ТаблицаСторон[0].ОбъектРасчетов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Создает, перезаполняет при необходимости и возвращает ссылку на объект расчетов по параметрам механизма взаиморасчетов.
// Если в рамках одной структуры было создано несколько элементов объектов расчетов то возвращает первый.
// 
// Параметры:
// 	Объект - ДокументОбъект, СправочникОбъект - Объект, по ссылке на который проверяется объект расчетов.
// 	Ссылка - ДокументСсылка, СправочникСсылка - Ссылка на объект.
// 	СтруктураПараметров - Структура - Текущий набор параметров. см. ВзаиморасчетыСервер.ПараметрыМеханизма.
// 	РежимЗаписи - РежимЗаписиДокумента - Режим записи, если метод вызывается из события ПередЗаписью.
// 	
// Возвращаемое значение:
// 	Структура - Структура параметров, где:
// 		* Объект - ОпределяемыйТип.ОбъектРасчетов.
// 		* ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами.
// 		* Организация - СправочникСсылка.Организации.
// 		* Контрагент - СправочникСсылка.Контрагенты.
// 		* Партнер - СправочникСсылка.Партнеры.
// 		* Наименование - Строка.
// 		* ТипСсылки - см. ОбщегоНазначения.ИдентификаторОбъектаМетаданных
// 		* ПометкаУдаления - Булево.
// 		* ГруппаФинансовогоУчета - СправочникСсылка.ГруппыФинансовогоУчетаРасчетов.
// 		* Менеджер - СправочникСсылка.Пользователи.
// 		* Подразделение - СправочникСсылка.СтруктураПредприятия. 
// 		* ИдентификаторПлатежа - Строка. 
// 		* НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС. 
// 		* НомерВходящегоДокумента - Строка.
// 		* ДатаВходящегоДокумента - Дата.
// 		* НаименованиеПервичногоДокумента - Строка
// 		* Сумма - Число.
// 		* Валюта - СправочникСсылка.Валюты. 
// 		* ВалютаВзаиморасчетов - СправочникСсылка.Валюты. 
// 		* СуммаВзаиморасчетов - Число. 
// 		* Договор - СправочникСсылка.ДоговорыКонтрагентов
// 		          - СправочникСсылка.ДоговорыМеждуОрганизациями.
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности. 
// 		* ОплатаВВалюте - Булево.
// 		* Номер - Строка.
// 		* Дата-  Дата.
// 		* Комментарий - Строка. 
// 		* БанковскийСчетОрганизации - СправочникСсылка.БанковскиеСчетаОрганизаций. 
// 		* БанковскийСчетКонтрагента - СправочникСсылка.БанковскиеСчетаКонтрагентов.
// 		* Касса - СправочникСсылка.Кассы. 
// 		* ФормаОплаты - ПеречислениеСсылка.ФормыОплаты.
// 		* ТолькоОстатки - Булево.
// 	
//
Функция РеквизитыОбъектаРасчетовПоСтруктуре(Объект, Ссылка, СтруктураПараметров, РежимЗаписи) Экспорт
	
	ЭтоДокумент = Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка));
	
	ПараметрыОбъектаРасчетов = Новый Структура;
	
	//Ключевые реквизиты.
	Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
		ПараметрыОбъектаРасчетов.Вставить("Объект", СтруктураПараметров.СсылкаНового);
	Иначе
		ПараметрыОбъектаРасчетов.Вставить("Объект", Ссылка);
	КонецЕсли;
	ПараметрыОбъектаРасчетов.Вставить("ТипРасчетов", СтруктураПараметров.ТипРасчетов);
	ПараметрыОбъектаРасчетов.Вставить("Организация", ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация, ,Справочники.Организации.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("Контрагент",  ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент, ,Справочники.Контрагенты.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("Партнер",     ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер, ,Справочники.Партнеры.ПустаяСсылка()));
	
	//Служебные реквизиты.
	ПараметрыОбъектаРасчетов.Вставить("Наименование", ?(Строка(Объект)="",НСтр("ru = '<Пустой>'"),Строка(Объект)));
	
	ПараметрыОбъектаРасчетов.Вставить("ТипСсылки", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка)));
	ПометкаУдаления = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,"Объект.ПометкаУдаления");
	ПараметрыОбъектаРасчетов.Вставить("ПометкаУдаления", ПометкаУдаления);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Состояние = 1;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Состояние = ?(ПараметрыОбъектаРасчетов.ПометкаУдаления,2,0);
	Иначе
		Если ЭтоДокумент Тогда
			Состояние = ?(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,"Объект.Проведен"),1,?(ПараметрыОбъектаРасчетов.ПометкаУдаления,2,0));
		Иначе
			Состояние = ?(ПараметрыОбъектаРасчетов.ПометкаУдаления,2,0);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОбъектаРасчетов.Вставить("Состояние", Состояние);
	
	Если СтруктураПараметров.ЭтоСправочник Тогда
		ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.Договор;
	ИначеЕсли СтруктураПараметров.ЭтоЗаказ Тогда
		ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.Заказ;
	ИначеЕсли СтруктураПараметров.ЭтоПродажаЗакупка Тогда
		ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.Накладная;
	Иначе
		ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.ПлатежВозврат;
	КонецЕсли;
	ПараметрыОбъектаРасчетов.Вставить("ТипОбъектаРасчетов", ТипОбъектаРасчетов);
	
	ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов,,Справочники.Валюты.ПустаяСсылка());
	
	СуммыДокумента = ВзаиморасчетыСервер.СуммыДокумента(Объект, СтруктураПараметров);
	СуммаДокумента = СуммыДокумента.СуммаДокумента;
	СуммаВзаиморасчетов = СуммыДокумента.СуммаВзаиморасчетов;
	
	ПараметрыОбъектаРасчетов.Вставить("ГруппаФинансовогоУчета", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ГруппаФинансовогоУчета,,Справочники.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("Менеджер",
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Менеджер,, Справочники.Пользователи.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("Подразделение", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.Подразделение,,Справочники.СтруктураПредприятия.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("ИдентификаторПлатежа", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.ИдентификаторПлатежа,,""));
	ПараметрыОбъектаРасчетов.Вставить("НалогообложениеНДС", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.НалогообложениеНДС,,Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("НомерВходящегоДокумента",
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.НомерВходящегоДокумента,,""));
	ПараметрыОбъектаРасчетов.Вставить("ДатаВходящегоДокумента",
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.ДатаВходящегоДокумента,,Дата(1,1,1)));
	ПараметрыОбъектаРасчетов.Вставить("НаименованиеПервичногоДокумента",
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,СтруктураПараметров.НаименованиеПервичногоДокумента,,""));
	ПараметрыОбъектаРасчетов.Вставить("Сумма",
		СуммаДокумента);
	ПараметрыОбъектаРасчетов.Вставить("Валюта", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента,,Справочники.Валюты.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("ВалютаВзаиморасчетов", 
		?(ЗначениеЗаполнено(ВалютаВзаиморасчетов),ВалютаВзаиморасчетов,ПараметрыОбъектаРасчетов.Валюта));
	ПараметрыОбъектаРасчетов.Вставить("СуммаВзаиморасчетов", 
		СуммаВзаиморасчетов);
	ПараметрыОбъектаРасчетов.Вставить("Договор", 
		?(СтруктураПараметров.ЭтоСправочник 
			И (ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")), 
			Ссылка, 
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор,, Неопределено)));
	ПараметрыОбъектаРасчетов.Вставить("НаправлениеДеятельности", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НаправлениеДеятельности,, Справочники.НаправленияДеятельности.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("ОплатаВВалюте", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ОплатаВВалюте,, Ложь));
	ПараметрыОбъектаРасчетов.Вставить("Номер", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Номер, ,""));
	ПараметрыОбъектаРасчетов.Вставить("Дата", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Дата, ,Дата(1,1,1)));
	ПараметрыОбъектаРасчетов.Вставить("Комментарий", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Комментарий", ,""));
	ПараметрыОбъектаРасчетов.Вставить("БанковскийСчетОрганизации", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.БанковскийСчетОрганизации,,Справочники.БанковскиеСчетаОрганизаций));
	ПараметрыОбъектаРасчетов.Вставить("БанковскийСчетКонтрагента", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.БанковскийСчетКонтрагента,,Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("Касса", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Касса,,Справочники.Кассы.ПустаяСсылка()));
	ПараметрыОбъектаРасчетов.Вставить("ФормаОплаты", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ФормаОплаты,, Перечисления.ФормыОплаты.ПустаяСсылка()));
		
	ПустоеСоглашение = ?(СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, 
		Справочники.СоглашенияСКлиентами.ПустаяСсылка(),
		Справочники.СоглашенияСПоставщиками.ПустаяСсылка());
	ПараметрыОбъектаРасчетов.Вставить("Соглашение", 
		ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Соглашение,,ПустоеСоглашение));
		
	ПараметрыОбъектаРасчетов.Вставить("ТолькоОстатки", СтруктураПараметров.ТолькоОстатки);
		
	Возврат ПараметрыОбъектаРасчетов;
	
КонецФункции

#КонецОбласти

#Область Общий

// Возвращает ссылку на уже имеющийся объект расчетов.
// Платежи с разными партнерами и контрагентами не поддерживаются.
// 
// Параметры: 
// 	Ссылка - ДокументСсылка, СправочникСсылка - Ссылка на исходный объект.
// 	Организация - СправочникСсылка.Организации - Организация.
// 	ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип расчетов объекта расчетов.
// 	ДополнительныеКритерииПоиска - см. ОбъектыРасчетовСервер.ДополнительныеКритерииПоиска.
// 
// Возвращаемое значение: 
// 	СправочникСсылка.ОбъектыРасчетов - Ссылка на объект расчетов.
//
Функция ПолучитьОбъектРасчетовПоСсылке(Ссылка, Организация = Неопределено, ТипРасчетов = Неопределено, ДополнительныеКритерииПоиска = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Справочники.ОбъектыРасчетов.ПустаяСсылка();
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Ссылка);
	
	Если ДополнительныеКритерииПоиска = Неопределено Тогда
		ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
		ДополнительныеКритерииПоиска.ВернутьПервый = Истина;
	КонецЕсли;
	
	Возврат ПолучитьОбъектыРасчетовПоСсылкам(Массив, Организация, ТипРасчетов, ДополнительныеКритерииПоиска)[Ссылка];
	
КонецФункции

// Возвращает соответствие ссылок имеющимся объектам расчетов.
// 
// Параметры: 
// 	МассивСсылок - Массив из ДокументСсылка, СправочникСсылка - Массив ссылок на исходные объекты.
// 	Организация - СправочникСсылка.Организации - Кем является организация.
// 	ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - Тип расчетов объектов расчетов.
// 	ДополнительныеКритерииПоиска - см. ОбъектыРасчетовСервер.ДополнительныеКритерииПоиска.
// 
// Возвращаемое значение: 
// 	Соответствие из КлючИЗначение:
// 		* Ключ - ДокументСсылка, СправочникСсылка - исходная ссылка.
// 		* Значение - СправочникСсылка.ОбъектыРасчетов - ссылка на объект расчетов.
//
Функция ПолучитьОбъектыРасчетовПоСсылкам(МассивСсылок, Организация = Неопределено, ТипРасчетов = Неопределено, ДополнительныеКритерииПоиска = Неопределено) Экспорт
	
	Если ДополнительныеКритерииПоиска = Неопределено Тогда
		ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО ОбъектыРасчетов.Объект = Договоры.Ссылка
	|ГДЕ
	|	НЕ &ТолькоРеглУчет
	|	И ОбъектыРасчетов.Объект В (&МассивСсылок)
	|	И (ОбъектыРасчетов.Организация = &Организация ИЛИ &ЛюбаяОрганизация)
	|	И (ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов ИЛИ &ЛюбойТип)
	|	И (ВЫБОР КОГДА &ЭтоДочернийПартнер
	|			И ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Справочник.ДоговорыКонтрагентов) И ЕСТЬNULL(Договоры.РазрешенаРаботаСДочернимиПартнерами, ЛОЖЬ)
	|		ТОГДА
	|			Договоры.Партнер
	|		ИНАЧЕ
	|			&Партнер
	|	КОНЕЦ = ОбъектыРасчетов.Партнер ИЛИ &ЛюбойПартнер)
	|	И (ОбъектыРасчетов.Контрагент = &Контрагент ИЛИ &ЛюбойКонтрагент)
	|	И &ВалютаВзаиморасчетов
	|	И &УсловиеТолькоОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО ОбъектыРасчетов.Объект = Договоры.Ссылка
	|ГДЕ
	|	&ТолькоРеглУчет
	|	И (ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.РеализацияТоваровУслуг)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ЗаказКлиента)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ЗаказПоставщику)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Справочник.ДоговорыКонтрагентов))
	|	И ОбъектыРасчетов.Объект В (&МассивСсылок)
	|	И (ОбъектыРасчетов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация))
	|	И (ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов ИЛИ &ЛюбойТип)
	|	И (ВЫБОР КОГДА &ЭтоДочернийПартнер
	|			И ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Справочник.ДоговорыКонтрагентов) И ЕСТЬNULL(Договоры.РазрешенаРаботаСДочернимиПартнерами, ЛОЖЬ)
	|		ТОГДА
	|			Договоры.Партнер
	|		ИНАЧЕ
	|			&Партнер
	|	КОНЕЦ = ОбъектыРасчетов.Партнер ИЛИ &ЛюбойПартнер)
	|	И (ОбъектыРасчетов.Контрагент = &Контрагент ИЛИ &ЛюбойКонтрагент)
	|	
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Объект КАК Объект,
	|	ОбъектыРасчетов.Ссылка КАК Ссылка,
	|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|	ПО ОбъектыРасчетов.Объект = Договоры.Ссылка
	|ГДЕ
	|	&ТолькоРеглУчет
	|	И НЕ (ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.РеализацияТоваровУслуг)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ЗаказКлиента)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Документ.ЗаказПоставщику)
	|		 ИЛИ ТИПЗНАЧЕНИЯ(ОбъектыРасчетов.Объект) = ТИП(Справочник.ДоговорыКонтрагентов))
	|	И ОбъектыРасчетов.Объект В (&МассивСсылок)
	|	И (ОбъектыРасчетов.Организация = &Организация ИЛИ &ЛюбаяОрганизация)
	|	И (ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов ИЛИ &ЛюбойТип)
	|	И (ОбъектыРасчетов.Партнер В (&Партнер) ИЛИ &ЛюбойПартнер)
	|	И (ОбъектыРасчетов.Контрагент = &Контрагент ИЛИ &ЛюбойКонтрагент)
	|УПОРЯДОЧИТЬ ПО
	|	ТолькоОстатки ВОЗР
	|	";
	
	Запрос.УстановитьПараметр("МассивСсылок",     МассивСсылок);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("ТипРасчетов",      ТипРасчетов);
	Запрос.УстановитьПараметр("Партнер",          ДополнительныеКритерииПоиска.Партнер);
	Запрос.УстановитьПараметр("ЭтоДочернийПартнер", Ложь);
	Если ЗначениеЗаполнено(ДополнительныеКритерииПоиска.Партнер) Тогда
		Запрос.УстановитьПараметр("ЭтоДочернийПартнер",  
			ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДополнительныеКритерииПоиска.Партнер, "Родитель")));
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент",       ДополнительныеКритерииПоиска.Контрагент);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("ОбновлениеИБ",     ДополнительныеКритерииПоиска.ОбновлениеИБ);
	Запрос.УстановитьПараметр("ТолькоРеглУчет",   ДополнительныеКритерииПоиска.ТолькоРеглУчет);
	Запрос.УстановитьПараметр("ЛюбаяОрганизация", ?(Организация = Неопределено, Истина, Ложь));
	Запрос.УстановитьПараметр("ЛюбойТип",         ?(ТипРасчетов = Неопределено, Истина, Ложь));
	Запрос.УстановитьПараметр("ЛюбойПартнер",     ?(ДополнительныеКритерииПоиска.Партнер     = Неопределено, Истина, Ложь));
	Запрос.УстановитьПараметр("ЛюбойКонтрагент",  ?(ДополнительныеКритерииПоиска.Контрагент  = Неопределено, Истина, Ложь));
	
	Если ДополнительныеКритерииПоиска.Свойство("ТолькоОстатки") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеТолькоОстатки", "ОбъектыРасчетов.ТолькоОстатки = &ТолькоОстатки");
		Запрос.УстановитьПараметр("ТолькоОстатки", ДополнительныеКритерииПоиска.ТолькоОстатки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеТолькоОстатки", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВалютаВзаиморасчетов", 
		?(ДополнительныеКритерииПоиска.ОбновлениеИБ 
			И ЗначениеЗаполнено(ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов), 
			"ОбъектыРасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов", 
			"ИСТИНА"));
	
	УстановитьПривилегированныйРежим(Истина);
	ОбъектыРасчетов = Запрос.Выполнить().Выгрузить();
	ОбъектыРасчетов.Индексы.Добавить("Объект");
	
	Результат = Новый Соответствие;
	Для Каждого Ссылка Из МассивСсылок Цикл
		СтрокиОбъектов = ОбъектыРасчетов.Скопировать(Новый Структура("Объект", Ссылка));
		Если СтрокиОбъектов.Количество() > 1 Тогда
			Если ДополнительныеКритерииПоиска.ВернутьПервый Тогда
				СтрокиОбъектов.Сортировать("ТолькоОстатки ВОЗР");
				Результат.Вставить(Ссылка, СтрокиОбъектов[0].Ссылка);
			Иначе
				Если ДополнительныеКритерииПоиска.НеГенерироватьИсключение Тогда
					Результат.Вставить(Ссылка, Справочники.ОбъектыРасчетов.ПустаяСсылка());
				Иначе
					ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'По %1 найдено несколько объектов расчетов.'"),
						Ссылка));
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокиОбъектов.Количество() = 1 Тогда
			Результат.Вставить(Ссылка, СтрокиОбъектов[0].Ссылка);
		Иначе
			Результат.Вставить(Ссылка, Справочники.ОбъектыРасчетов.ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает все объекты расчетов по ссылке.
// 
// Параметры:
// 	Ссылка - ДокументСсылка - объект по которому нужно найти Объекты расчетов.
// Возвращаемое значение:
// 	Массив из СправочникСсылка.ОбъектыРасчетов - Массив объектов расчетов.
//
Функция ВсеОбъектыРасчетовПоСсылке(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ 
	|	НЕ ТолькоОстатки
	|	И ОбъектыРасчетов.Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ОбъектыРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат ОбъектыРасчетов;
КонецФункции

// Возвращает структуру дополнительных параметров по для поиска объектов расчета по умолчанию
// 
// Возвращаемое значение:
// 	Структура - Описание:
// 		* ОбновлениеИБ - Булево - Признак, указывающий что следует производить поиск и среди некорректных объектов расчетов
// 		* ВернутьПервый - Булево - Признак, указывающий что следует вернуть первый найденный объект расчетов
// 		* Партнер - Неопределено, СправочникСсылка.Партнеры - Значение поиска по полю Партнер
// 		* ВалютаВзаиморасчетов - Неопределено, СправочникСсылка.Валюты - Значение поиска по полю Партнер
// 		* Контрагент - Неопределено, СправочникСсылка.Контрагенты - Значение поиска по полю Контрагент
// 		* НеГенерироватьИсключение - Булево - Если найден один объект расчетов, то вернуть его, иначе вернуть пустую ссылку 
Функция ДополнительныеКритерииПоиска() Экспорт
	
	КритерииПоискаОбъектаРасчетов = Новый Структура();
	КритерииПоискаОбъектаРасчетов.Вставить("Контрагент", Неопределено);
	КритерииПоискаОбъектаРасчетов.Вставить("Партнер", Неопределено);
	КритерииПоискаОбъектаРасчетов.Вставить("ВалютаВзаиморасчетов", Неопределено);
	КритерииПоискаОбъектаРасчетов.Вставить("ТолькоРеглУчет", Ложь);
	КритерииПоискаОбъектаРасчетов.Вставить("ОбновлениеИБ", Ложь);
	КритерииПоискаОбъектаРасчетов.Вставить("ВернутьПервый", Ложь);
	КритерииПоискаОбъектаРасчетов.Вставить("НеГенерироватьИсключение", Ложь);
	
	Возврат КритерииПоискаОбъектаРасчетов;
	
КонецФункции

// Создает, перезаполняет при необходимости и возвращает ссылку на объект расчетов по переданной структуре реквизитов.
// 
// Параметры:
// 	РеквизитыОбъекта - Структура - Текущий набор реквизитов объекта расчетов.
// 	ДопРеквизитыИсточника - ТаблицаЗначений - Таблица дополнительных свойств и их значений объекта-источника.
// 	ОбновлениеИБ - Булево - Признак выполнения обновления информационной базы.
// 	ЕстьИзменения - Булево - Переменная передаваемая в процедуру для отметки о наличии изменений в объекте расчетов
// 
// Возвращаемое значение:
// 	СправочникСсылка.ОбъектыРасчетов - Ссылка на объект расчетов.
//
Функция ПроверитьСоздатьОбъектРасчетов(РеквизитыОбъекта, ДопРеквизитыИсточника = Неопределено, ОбновлениеИБ = Ложь, ЕстьИзменения = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(РеквизитыОбъекта.Объект) Тогда
		ВызватьИсключение(НСтр("ru='Невозможно создать объект расчетов. Не указаны обязательные параметры.'"))
	КонецЕсли;
	
	Если ТипЗнч(РеквизитыОбъекта.Контрагент) = Тип("СправочникСсылка.Организации")
		И (РеквизитыОбъекта.Договор = Неопределено
			ИЛИ ТипЗнч(РеквизитыОбъекта.Договор) <> Тип("СправочникСсылка.ДоговорыМеждуОрганизациями")) Тогда
		РеквизитыОбъекта.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
	ИначеЕсли ТипЗнч(РеквизитыОбъекта.Контрагент) <> Тип("СправочникСсылка.Организации")
		И (РеквизитыОбъекта.Договор = Неопределено
			ИЛИ ТипЗнч(РеквизитыОбъекта.Договор) <> Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
		РеквизитыОбъекта.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	РеквизитыСправочника = РеквизитыСправочникаОбъектыРасчетов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ *
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Объект = &Объект
	|	И ОбъектыРасчетов.Организация = &Организация
	|	И ОбъектыРасчетов.Контрагент = &Контрагент
	|	И ОбъектыРасчетов.Партнер = &Партнер
	|	И ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов
	|	И &ВалютаВзаиморасчетов";
	Запрос.УстановитьПараметр("Объект", РеквизитыОбъекта.Объект);
	Запрос.УстановитьПараметр("Организация", РеквизитыОбъекта.Организация);
	Запрос.УстановитьПараметр("Контрагент", РеквизитыОбъекта.Контрагент);
	Запрос.УстановитьПараметр("Партнер", РеквизитыОбъекта.Партнер);
	Запрос.УстановитьПараметр("ТипРасчетов", РеквизитыОбъекта.ТипРасчетов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВалютаВзаиморасчетов", 
		?(ЗначениеЗаполнено(РеквизитыОбъекта.ВалютаВзаиморасчетов), "ОбъектыРасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов" , "ИСТИНА"));
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", РеквизитыОбъекта.ВалютаВзаиморасчетов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТребуетсяПерезаполнение = Ложь;
		
		Для Каждого Реквизит Из РеквизитыСправочника Цикл
			Если РеквизитыОбъекта.Свойство(Реквизит) И Выборка[Реквизит] <> РеквизитыОбъекта[Реквизит] Тогда
				ТребуетсяПерезаполнение = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ДопРеквизитыИсточника <> Неопределено Тогда
			ДопРеквизитыОбъектаРасчетов = Выборка.ДополнительныеРеквизиты.Выгрузить(); // ТаблицаЗначений -
			ДопРеквизитыОбъектаРасчетов.Индексы.Добавить("Свойство");
			Для Каждого Реквизит Из ДопРеквизитыИсточника Цикл
				Если УправлениеСвойствами.ПроверитьСвойствоУОбъекта(Выборка.Ссылка,Реквизит.Свойство) Тогда
					СтрокаДопРеквизита = ДопРеквизитыОбъектаРасчетов.Найти(Реквизит.Свойство);
					Если СтрокаДопРеквизита = Неопределено
						ИЛИ СтрокаДопРеквизита.Значение <> Реквизит.Значение Тогда
						ТребуетсяПерезаполнение = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Выборка.ПометкаУдаления <> РеквизитыОбъекта.ПометкаУдаления Тогда
			ТребуетсяПерезаполнение = Истина;
		КонецЕсли;
		
		Если ТребуетсяПерезаполнение Тогда
			УстановитьПривилегированныйРежим(Истина);
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект -
			ЗаполнитьЗначенияСвойств(СправочникОбъект, РеквизитыОбъекта);
			
			Если ДопРеквизитыИсточника <> Неопределено Тогда
				Для Каждого Реквизит Из ДопРеквизитыИсточника Цикл
					Если УправлениеСвойствами.ПроверитьСвойствоУОбъекта(Выборка.Ссылка,Реквизит.Свойство) Тогда
						СтрокаДопРеквизита = ДопРеквизитыОбъектаРасчетов.Найти(Реквизит.Свойство);
						Если СтрокаДопРеквизита = Неопределено Тогда
							СтрокаДопРеквизита = ДопРеквизитыОбъектаРасчетов.Добавить();
						КонецЕсли;
						СтрокаДопРеквизита.Свойство = Реквизит.Свойство;
						СтрокаДопРеквизита.Значение = Реквизит.Значение;
						СтрокаДопРеквизита.ТекстоваяСтрока = Реквизит.ТекстоваяСтрока;
					КонецЕсли;
				КонецЦикла;
				СправочникОбъект.ДополнительныеРеквизиты.Загрузить(ДопРеквизитыОбъектаРасчетов);
			КонецЕсли;
			
			СправочникОбъект.Записать();
			УстановитьПривилегированныйРежим(Ложь);
			ЕстьИзменения = Истина;
			Возврат СправочникОбъект.Ссылка;
		КонецЕсли;
		
		Возврат Выборка.Ссылка;
		
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		СправочникОбъект = Справочники.ОбъектыРасчетов.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СправочникОбъект, РеквизитыОбъекта);
		СправочникОбъект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
		
		Если ДопРеквизитыИсточника <> Неопределено Тогда
			Для Каждого Реквизит Из ДопРеквизитыИсточника Цикл
				Если УправлениеСвойствами.ПроверитьСвойствоУОбъекта(СправочникОбъект.Ссылка,Реквизит.Свойство) Тогда
					СтрокаДопРеквизита = СправочникОбъект.ДополнительныеРеквизиты.Добавить();
					СтрокаДопРеквизита.Свойство = Реквизит.Свойство;
					СтрокаДопРеквизита.Значение = Реквизит.Значение;
					СтрокаДопРеквизита.ТекстоваяСтрока = Реквизит.ТекстоваяСтрока;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СправочникОбъект.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
КонецФункции

// Проверяет наличие ссылок в объектах данных на переданный объект расчетов. Если ссылок нет, то удаляет объект непосредственно.
//
// Параметры:
// 	ОбъектРасчетов - СправочникСсылка.ОбъектыРасчетов - Ссылка на объект расчетов.
// 	Отказ - Булево - Флаг отказа из объекта.
// 	ВызыватьИсключение - Булево - Вызывать ли исключение если не удается удалить объект расчетов.
Процедура ПроверитьУдалитьОбъектРасчетов(ОбъектРасчетов, Отказ, ВызыватьИсключение) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектРасчетов)  Тогда
		ВызватьИсключение(НСтр("ru='Невозможно создать объект расчетов. Не указаны обязательные параметры.'"))
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	ОбъектРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.ОбъектРасчетов(&ОбъектРасчетов) КАК ОбъектРасчетов
	|ГДЕ
	|	ОбъектРасчетов.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.ДокументРегистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|ГДЕ
	|	Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.ДокументРегистратор <> &Ссылка
	|	И НЕ Расчеты.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.ЗаказКлиента = &ОбъектРасчетов
	|	И Расчеты.Регистратор <> &Ссылка
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.Регистратор <> &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.ДокументРегистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|ГДЕ
	|	Расчеты.ОбъектРасчетов = &ОбъектРасчетов
	|	И Расчеты.ДокументРегистратор <> &Ссылка
	|	И НЕ Расчеты.ДокументРегистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.ЗаказПоставщику = &ОбъектРасчетов
	|	И Расчеты.Регистратор <> &Ссылка
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц
	|";
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	Запрос.УстановитьПараметр("Ссылка", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "Объект"));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбъектРасчетовОбъект = ОбъектРасчетов.ПолучитьОбъект();
		Попытка
			ОбъектРасчетовОбъект.Заблокировать();
		Исключение
			ВызватьИсключение(НСтр("ru = 'Изменение запрещено, объект расчетов уже используется в других сеансах.'"));
		КонецПопытки;
		ОбъектРасчетовОбъект.Удалить();
		УстановитьПривилегированныйРежим(Ложь);
	ИначеЕсли ВызыватьИсключение Тогда
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Изменение запрещено, объект расчетов %1 используется в других объектах:'"),
				ОбъектРасчетов);
		Отказ = Истина;
		Сообщить(Сообщение);
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.КлючДанных = Выборка.Ссылка;
			Сообщение.Текст = Символы.Таб + Выборка.Ссылка;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру с обязательными данными для генерации/поиска объекта расчетов
// 
// Возвращаемое значение:
// 	Структура - Описание:
// 		* Объект - ОпределяемыйТип.ОбъектРасчетов - Ссылка на источник объекта расчетов.
// 		* ТипРасчетов - ПеречислениеСсылка.ТипыРасчетовСПартнерами - В каких расчетах отражается, с клиентами или с поставщиками.
// 		* Организация - СправочникСсылка.Организации - Организация объекта расчетов.
// 		* Контрагент - Неопределено - Контрагент объекта расчетов.
// 		* Партнер - СправочникСсылка.Партнеры - Партнер объекта расчетов.
// 		* Договор - Неопределено - Договор объекта расчетов.
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - Направление деятельности, по которому отражается объект расчетов.
Функция ПолучитьПараметрыОбъектаРасчетов() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Объект");
	СтруктураПараметров.Вставить("ТипРасчетов");
	СтруктураПараметров.Вставить("Организация",             Справочники.Организации.ПустаяСсылка());
	СтруктураПараметров.Вставить("Валюта",                  Справочники.Валюты.ПустаяСсылка());
	СтруктураПараметров.Вставить("Партнер",                 Справочники.Партнеры.ПустаяСсылка());
	СтруктураПараметров.Вставить("Контрагент",              Неопределено);
	СтруктураПараметров.Вставить("Договор",                 Неопределено);
	СтруктураПараметров.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Возвращает пустые значения типов, которые могли быть указаны в качестве объекта расчетов
// 
// Возвращаемое значение:
// 	Массив из ОпределяемыйТип.ОбъектРасчетов, Неопределено
Функция ПустыеЗначенияОбъектРасчетов() Экспорт
	
	ТипыОбъектовРасчетов = Метаданные.ОпределяемыеТипы.ОбъектРасчетов.Тип.Типы();
	ПустыеЗначенияОбъектРасчетов = Новый Массив();
	ПустыеЗначенияОбъектРасчетов.Добавить(Неопределено);
	
	Для Каждого ТипОбъектаРасчетов Из ТипыОбъектовРасчетов Цикл
		 ПустыеЗначенияОбъектРасчетов.Добавить(Новый(ТипОбъектаРасчетов));
	КонецЦикла;
	
	Возврат ПустыеЗначенияОбъектРасчетов;
	
КонецФункции

// Дополняет массив ссылок ссылками на связанные объекты расчетов.
// 
// Параметры:
// 	МассивСсылок - Массив из ДокументСсылка, СправочникСсылка - Массив ссылок на документы и справочники.
//
Процедура ДополнитьСсылкамиНаОбъектыРасчетов(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|ГДЕ
	|	ОбъектыРасчетов.Объект В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	МассивОбъектовРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСсылок,МассивОбъектовРасчетов);
	
КонецПроцедуры

// Проверяет, что ссылка указанного объекта может содержаться в объекте расчетов
// 
// Параметры:
// 	Объект - СправочникОбъект, ДокументОбъект - проверяемый объект.
// 	СтруктураПараметров - Структура - Текущий набор параметров. см. ВзаиморасчетыСервер.ПараметрыМеханизма.
// 
// Возвращаемое значение:
// 	Булево - Истина, если является объектом расчетов
//
Функция СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) Экспорт
	
	ИзменяетРасчеты            = СтруктураПараметров.ИзменяетРасчеты;
	ЭтоСправочник              = СтруктураПараметров.ЭтоСправочник;
	ЭтоЗаказ                   = СтруктураПараметров.ЭтоЗаказ;
	ЭтоПродажаЗакупка          = СтруктураПараметров.ЭтоПродажаЗакупка;
	ЭтоПлатежИлиПрочийДокумент = СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент;
	ПорядокРасчетов            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов, , Перечисления.ПорядокРасчетов.ПоНакладным);
	НакладнаяПоЗаказам         = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НакладнаяПоЗаказам, ,Ложь);
	ЗаказОснование             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
	ИспользоватьРасширенные    = СтруктураПараметров.ДокументРасчетовСКлиентами И НЕ СтруктураПараметров.ЗаказКакСчет
								ИЛИ СтруктураПараметров.ДокументРасчетовСПоставщиками;
	
	Возврат ЭтоСправочник И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
							ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным)
			ИЛИ ЭтоЗаказ И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам
														ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным)
			ИЛИ ЭтоПродажаЗакупка И ИзменяетРасчеты 
				И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
					ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным
					ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным
					ИЛИ (НЕ ИспользоватьРасширенные ИЛИ НЕ НакладнаяПоЗаказам) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам) 
					// Корректировки реализаций и приобретений.
					И СтруктураПараметров.Ссылка = "Объект.Ссылка"
			ИЛИ ЭтоПлатежИлиПрочийДокумент И ИзменяетРасчеты
				// Возвраты товаров не по договорам.
				И ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов) И ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
				// Возвраты товаров клиентов не по заявке.
				И НЕ (ЗначениеЗаполнено(ЗаказОснование) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам);
	
КонецФункции

// Находит используемый объект расчетов (или несколько) по указанной ссылке
//
// Параметры:
// 	Ссылка - СправочникСсылка, ДокументСсылка - документ или справочник, использующий учетный механизм Взаиморасчеты
// 
// Возвращаемое значение:
// 	- СправочникСсылка.ОбъектыРасчетов - Найденный объект расчетов
// 	- Массив из СправочникСсылка.ОбъектыРасчетов - Если найдено несколько объектов расчетов
//
Функция ОбъектРасчетовИзСсылки(Ссылка) Экспорт
	
	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	ПараметрыВзаиморасчеты = МодульМенеджера.ПараметрыВзаиморасчеты(Ссылка);
	
	Если ТипЗнч(ПараметрыВзаиморасчеты) = Тип("Массив") Тогда
		МассивПараметров = ПараметрыВзаиморасчеты;
	Иначе
		МассивПараметров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыВзаиморасчеты);
	КонецЕсли;
	
	ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
	Для Каждого СтруктураПараметров Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов) Тогда
			ЧастиПути = СтрРазделить(СтруктураПараметров.ОбъектРасчетов, ".");
			Если ЧастиПути.Количество() = 2 Тогда // ОР в рекизите
				ОбъектРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ЧастиПути[1]);
			ИначеЕсли ЧастиПути.Количество() = 3 Тогда // ОР в табличной части
				МетаданныеПоСсылке = Ссылка.Метаданные();
				Если МетаданныеПоСсылке.ТабличныеЧасти.Найти(ЧастиПути[1]) <> Неопределено Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ТабличнаяЧасть.ИмяРеквизита КАК ОбъектРасчетов
						|ИЗ
						|	&ТабличнаяЧасть КАК ТабличнаяЧасть
						|ГДЕ
						|	ТабличнаяЧасть.Ссылка = &Ссылка";
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабличнаяЧасть", МетаданныеПоСсылке.ПолноеИмя() + "." + ЧастиПути[1]);
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяРеквизита", ЧастиПути[2]);
					Запрос.УстановитьПараметр("Ссылка", Ссылка);
					МассивОбъектовРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектРасчетов");
					Если МассивОбъектовРасчетов.Количество() > 1 Тогда
						ОбъектРасчетов =  МассивОбъектовРасчетов;
					ИначеЕсли МассивОбъектовРасчетов.Количество() = 1 Тогда 
						ОбъектРасчетов = МассивОбъектовРасчетов[0];
					КонецЕсли;
				Иначе
					ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'В модуле менеджера документа указан некоррекный путь к объекту расчетов %1'"),
						СтруктураПараметров.ОбъектРасчетов));
				КонецЕсли;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъектРасчетов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Параметры - Структура - Коллекция Параметров:
//  	* ВалютаВзаиморасчетов - СправочникСсылка.Валюты.
//  
// Возвращаемое значение:
// 	СправочникСсылка.ОбъектыРасчетов - Сгенерированный объект расчетов
//
Функция НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(Параметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыРасчетов.Ссылка
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Организация = &Организация
		|	И ОбъектыРасчетов.Партнер = &Партнер
		|	И ОбъектыРасчетов.Контрагент = &Контрагент
		|	И ОбъектыРасчетов.Договор = &Договор
		|	И ОбъектыРасчетов.НаправлениеДеятельности = &НаправлениеДеятельности
		|	И ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов
		|	и &ВалютаВзаиморасчетов
		|	И ОбъектыРасчетов.Объект = НЕОПРЕДЕЛЕНО";
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Запрос.Параметры, Параметры);
	
	Если Параметры.Свойство("ВалютаВзаиморасчетов") И ЗначениеЗаполнено(Параметры.ВалютаВзаиморасчетов) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВалютаВзаиморасчетов", "ОбъектыРасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов");
	Иначе  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВалютаВзаиморасчетов", "ИСТИНА");
	КонецЕсли;	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает соответствия ссылок элементам справочника объекты расчетов
// 
// Параметры:
// 	ТаблицаПоиска - ТаблицаЗначений - таблица ссылок для поиска:
// 	 * НомерСтроки - Число - номер строки поиска.
// Возвращаемое значение:
// 	Соответствие Из КлючИЗначение:
// 		* Ключ - Число - Номер строки в ТаблицаПоиска
//		* Значение - СправочникСсылка.ОбъектыРасчетов.
//
Функция НайтиОбъектыРасчетовПоАналитикеУчетаПоПартнерам(ТаблицаПоиска) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПоиска.НомерСтроки,
		|	ДанныеПоиска.Организация,
		|	ДанныеПоиска.Партнер,
		|	ДанныеПоиска.Контрагент,
		|	ДанныеПоиска.Договор,
		|	ДанныеПоиска.НаправлениеДеятельности,
		|	ДанныеПоиска.ТипРасчетов,
		|	ДанныеПоиска.ВалютаВзаиморасчетов
		|ПОМЕСТИТЬ ВТДанныеПоиска
		|ИЗ 
		|	&ДанныеПоиска КАК ДанныеПоиска
		|;
		|
		|ВЫБРАТЬ
		|	ДанныеПоиска.НомерСтроки КАК НомерСтроки,
		|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
		|ИЗ
		|	ВТДанныеПоиска КАК ДанныеПоиска
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|		ПО ОбъектыРасчетов.Организация = ДанныеПоиска.Организация
		|		И ОбъектыРасчетов.Партнер = ДанныеПоиска.Партнер
		|		И ОбъектыРасчетов.Контрагент = ДанныеПоиска.Контрагент
		|		И ОбъектыРасчетов.Договор = ДанныеПоиска.Договор
		|		И ОбъектыРасчетов.НаправлениеДеятельности = ДанныеПоиска.НаправлениеДеятельности
		|		И ОбъектыРасчетов.ТипРасчетов = ДанныеПоиска.ТипРасчетов
		|		И ОбъектыРасчетов.ВалютаВзаиморасчетов = ДанныеПоиска.ВалютаВзаиморасчетов
		|		И ОбъектыРасчетов.Объект = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("ДанныеПоиска", ТаблицаПоиска);
	ОбъектыРасчетов = Запрос.Выполнить().Выгрузить();

	Результат = Новый Соответствие;
	Для Каждого СтрокаАналитики Из ТаблицаПоиска Цикл
		СтрокиОбъектов = ОбъектыРасчетов.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаАналитики.НомерСтроки));
		Если СтрокиОбъектов.Количество() > 1 Тогда
			ВызватьИсключение(НСтр("ru='Ошибка заполнения объекта расчетов. Найдено несколько объектов расчетов.'"));
		ИначеЕсли СтрокиОбъектов.Количество() = 1 Тогда
			Результат.Вставить(СтрокаАналитики.НомерСтроки, СтрокиОбъектов[0].ОбъектРасчетов);
		Иначе
			Результат.Вставить(СтрокаАналитики.НомерСтроки, Справочники.ОбъектыРасчетов.ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
// 	ПриемникОбъектаРасчетов - СправочникСсылка.ОбъектыРасчетов.
// 	ИсточникОбъектаРасчетов - СправочникСсылка.ОбъектыРасчетов.
// 	ГотовКЗаполнению - Булево.
// 	
// Возвращаемое значение:
// 	Булево.
//
Функция ОбъектГотовКЗаполнению(ПриемникОбъектаРасчетов, ИсточникОбъектаРасчетов, ГотовКЗаполнению) Экспорт
	
	Если Не ЗначениеЗаполнено(ПриемникОбъектаРасчетов)
		И ЗначениеЗаполнено(ИсточникОбъектаРасчетов)
		И ГотовКЗаполнению Тогда
		Если Не ОбновлениеИнформационнойБазы.ОбъектОбработан(ИсточникОбъектаРасчетов).Обработан Тогда
			ГотовКЗаполнению = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГотовКЗаполнению;
	
КонецФункции

// Возвращаемое значение:
// 	ТаблицаЗначений:
// 		* НомерСтроки             - Число.
// 		* Организация             - СправочникСсылка.Организации.
// 		* Контрагент              - СправочникСсылка.Контрагенты.
// 		                          - СправочникСсылка.Организации.
// 		* Партнер                 - СправочникСсылка.Партнеры.
// 		* Договор                 - СправочникСсылка.ДоговорыКонтрагентов.
// 		                          - СправочникСсылка.ДоговорыМеждуОрганизациями.
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности.
// 		* ТипРасчетов             - ПеречислениеСсылка.ТипыРасчетовСПартнерами. 
// 		* ВалютаВзаиморасчетов    - СправочникСсылка.Валюты.
//
Функция ПараметрыПоискаПустогоОбъектаРасчетов() Экспорт
	
	ПараметрыПоиска = Новый ТаблицаЗначений();
	ПараметрыПоиска.Колонки.Добавить("НомерСтроки",             Новый ОписаниеТипов("Число"));
	ПараметрыПоиска.Колонки.Добавить("Организация",             Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	СписокТиповКонтрагенты = Новый Массив();
	СписокТиповКонтрагенты.Добавить(Тип("СправочникСсылка.Организации"));
	СписокТиповКонтрагенты.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ПараметрыПоиска.Колонки.Добавить("Контрагент",              Новый ОписаниеТипов(СписокТиповКонтрагенты));
	ПараметрыПоиска.Колонки.Добавить("Партнер",                 Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	
	СписокТиповДоговора = Новый Массив();
	СписокТиповДоговора.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	СписокТиповДоговора.Добавить(Тип("СправочникСсылка.ДоговорыМеждуОрганизациями"));
	ПараметрыПоиска.Колонки.Добавить("Договор",                 Новый ОписаниеТипов(СписокТиповДоговора));
	ПараметрыПоиска.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ПараметрыПоиска.Колонки.Добавить("ТипРасчетов",             Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетовСПартнерами"));
	ПараметрыПоиска.Колонки.Добавить("ВалютаВзаиморасчетов",    Новый ОписаниеТипов("СправочникСсылка.Валюты"));

	Возврат ПараметрыПоиска;
	
КонецФункции

Процедура ЗаполнитьОбъектыРасчетов(Объект, ОбъектИзменен = Неопределено, ТабЧастиВидыЗапасов = Неопределено) Экспорт
	
	ПараметрыГенерации = ПараметрыВзаиморасчетовОбъектаРасчетов(Объект);
	
	ТребуетсяЗаполнениеОбъектовРасчетовВШапкеИлиТЧ = Ложь;
	ТребуетсяЗаполнениеОбъектовРасчетовВРасшифровкеПлатежа = Ложь;

	Если Не ТипЗнч(ПараметрыГенерации) = Тип("Массив") Тогда
		ПараметрыГенерации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыГенерации);
	КонецЕсли;

	ДополненныеПараметрыМеханизма = ВзаиморасчетыСервер.ДополненныеПараметрыМеханизма(Объект, ПараметрыГенерации);
	
	Для Каждого СтруктураПараметровГенерации Из ПараметрыГенерации Цикл
		
		ПутьКОбъектамРасчетов = СтрРазделить(СтруктураПараметровГенерации.ОбъектРасчетов, ".", Ложь);
		ОбъектыРасчетовВТЧ = ПутьКОбъектамРасчетов.Количество() = 3;
		
		Если Не ОбъектыРасчетовВТЧ 
			И ЗначениеЗаполнено(СтруктураПараметровГенерации.ОбъектРасчетов)
			И Не ЗначениеЗаполнено(ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
				Объект,
				СтруктураПараметровГенерации.ОбъектРасчетов)) Тогда
			ТребуетсяЗаполнениеОбъектовРасчетовВШапкеИлиТЧ = Истина;
		ИначеЕсли ОбъектыРасчетовВТЧ Тогда
			Для Каждого СтрокаТЧ Из Объект[ПутьКОбъектамРасчетов[1]] Цикл
				Если СтрокаТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка() Тогда
					ТребуетсяЗаполнениеОбъектовРасчетовВШапкеИлиТЧ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураПараметровГенерации.ПутьКДаннымТЧРасшифровкаПлатежа)
			И Не ТребуетсяЗаполнениеОбъектовРасчетовВРасшифровкеПлатежа Тогда
			ДанныеТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметровГенерации.ПутьКДаннымТЧРасшифровкаПлатежа);
			Для Каждого СтрокаТЧ Из ДанныеТЧ Цикл
				Если СтрокаТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка() Тогда
					ТребуетсяЗаполнениеОбъектовРасчетовВРасшифровкеПлатежа = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ТабЧастиВидыЗапасов <> Неопределено Тогда
		Для Каждого ТабЧастьВидыЗапасов Из ТабЧастиВидыЗапасов Цикл
			Для Каждого СтрокаВидовЗапасов Из Объект[ТабЧастьВидыЗапасов.Ключ] Цикл
				Если СтрокаВидовЗапасов.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка() Тогда
					ТребуетсяЗаполнениеОбъектовРасчетовВШапкеИлиТЧ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если ТребуетсяЗаполнениеОбъектовРасчетовВШапкеИлиТЧ Тогда
		ЗаполнитьОбъектРасчетов(Объект, ДополненныеПараметрыМеханизма.МассивПараметров, Истина, РежимЗаписиДокумента.Запись, ТабЧастиВидыЗапасов);
		ОбъектИзменен = Истина;
	КонецЕсли;
	
	Если ТребуетсяЗаполнениеОбъектовРасчетовВРасшифровкеПлатежа Тогда
		Для Каждого СтруктураПараметровГенерации Из ДополненныеПараметрыМеханизма.МассивПараметров Цикл
			Если ЗначениеЗаполнено(СтруктураПараметровГенерации.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
				ЗаполнитьОбъектРасчетовВРасшифровкеПлатежа(Объект, СтруктураПараметровГенерации);
				ОбъектИзменен = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрыГенерацииИсключениями(ПараметрыГенерации, ИспользованиеВРасчетныхРегистрах, Объект) Экспорт
	
	СсылкаНаЭлемент = Объект.Ссылка;
	ПараметрыГенерацииБезИсключений = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыГенерации);
	
	СписокТипов = Новый Массив;
	СписокТипов.Добавить("СправочникСсылка.Организации");
	СписокТипов.Добавить("СправочникСсылка.Контрагенты");
	ОписаниеТипаПоляКонтрагент = Новый ОписаниеТипов(СписокТипов);
	
	ОбъектыРасчетовКорректные = Новый ТаблицаЗначений();
	ОбъектыРасчетовКорректные.Колонки.Добавить("ОбъектРасчетов");
	ОбъектыРасчетовКорректные.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ОбъектыРасчетовКорректные.Колонки.Добавить("Контрагент", Новый ОписаниеТипов(ОписаниеТипаПоляКонтрагент));
	ОбъектыРасчетовКорректные.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ОбъектыРасчетовКорректные.Колонки.Добавить("ТипРасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетовСПартнерами"));
	ОбъектыРасчетовКорректные.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ОбъектыРасчетовКорректные.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ОбъектыРасчетовКорректные.Колонки.Добавить("ТолькоОстатки", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ПараметрГенерации Из ПараметрыГенерацииБезИсключений Цикл
		
		ОрганизацияВСтроках = ПараметрГенерации.ОрганизацияВСтроках;
		КонтрагентВСтроках  = ПараметрГенерации.КонтрагентВСтроках;
		ПартнерВСтроках     = ПараметрГенерации.ПартнерВСтроках;
		ТолькоОстатки       = Не СсылкаЯвляетсяОбъектомРасчетов(Объект, ПараметрГенерации);

		Если ОрганизацияВСтроках Или КонтрагентВСтроках Или ПартнерВСтроках Тогда
			
			Если ОрганизацияВСтроках Тогда
				Имена = СтрРазделить(ПараметрГенерации.Организация, ".");
				Имена.Удалить(Имена.ВГраница());
				ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтрСоединить(Имена, ".")); // ТабличнаяЧасть 
			Иначе
				ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
			КонецЕсли;
		
			Для Каждого Стр Из ТЧ Цикл
				
				Идентификатор = Стр.НомерСтроки;
				
				НовыйКорректныйОбъектРасчетов                 = ОбъектыРасчетовКорректные.Добавить();
				НовыйКорректныйОбъектРасчетов.ОбъектРасчетов  = СсылкаНаЭлемент;
				НовыйКорректныйОбъектРасчетов.ТипРасчетов     = ПараметрГенерации.ТипРасчетов;
				НовыйКорректныйОбъектРасчетов.ТолькоОстатки   = ТолькоОстатки;
				НовыйКорректныйОбъектРасчетов.Валюта = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.ВалютаДокумента);
				НовыйКорректныйОбъектРасчетов.ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,
					?(ЗначениеЗаполнено(ПараметрГенерации.ВалютаВзаиморасчетов),ПараметрГенерации.ВалютаВзаиморасчетов,ПараметрГенерации.ВалютаДокумента));
				
				Если ОрганизацияВСтроках Тогда
					НовыйКорректныйОбъектРасчетов.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Организация, Идентификатор);
				Иначе
					НовыйКорректныйОбъектРасчетов.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Организация);
				КонецЕсли;
				
				Если КонтрагентВСтроках Тогда
					НовыйКорректныйОбъектРасчетов.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Контрагент, Идентификатор);
				Иначе
					НовыйКорректныйОбъектРасчетов.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Контрагент);
				КонецЕсли;
				
				Если ПартнерВСтроках Тогда
					НовыйКорректныйОбъектРасчетов.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Партнер, Идентификатор);
				Иначе
					НовыйКорректныйОбъектРасчетов.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Партнер);
				КонецЕсли;
				
			КонецЦикла;
				
		Иначе
			
			НовыйКорректныйОбъектРасчетов                 = ОбъектыРасчетовКорректные.Добавить();
			НовыйКорректныйОбъектРасчетов.ТипРасчетов     = ПараметрГенерации.ТипРасчетов;
			НовыйКорректныйОбъектРасчетов.ОбъектРасчетов  = СсылкаНаЭлемент;
			НовыйКорректныйОбъектРасчетов.ТолькоОстатки   = ТолькоОстатки;
			НовыйКорректныйОбъектРасчетов.Организация     = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Организация);
			НовыйКорректныйОбъектРасчетов.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Партнер);
			НовыйКорректныйОбъектРасчетов.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.Контрагент);
			НовыйКорректныйОбъектРасчетов.Валюта = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, ПараметрГенерации.ВалютаДокумента);
			НовыйКорректныйОбъектРасчетов.ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,
				?(ЗначениеЗаполнено(ПараметрГенерации.ВалютаВзаиморасчетов),ПараметрГенерации.ВалютаВзаиморасчетов,ПараметрГенерации.ВалютаДокумента));
			
		КонецЕсли;
	КонецЦикла;
	
	ДанныеИзРасчетныхРегистров = ИспользованиеВРасчетныхРегистрах.НайтиСтроки(Новый Структура("ОбъектРасчетов", СсылкаНаЭлемент));
	
	Для Каждого КлючРегистра Из ДанныеИзРасчетныхРегистров Цикл
		
		КлючПоиска = Новый Структура("ОбъектРасчетов, Организация, ТипРасчетов, Контрагент, Партнер, ТолькоОстатки, ВалютаВзаиморасчетов");
		ЗаполнитьЗначенияСвойств(КлючПоиска, КлючРегистра);
		КлючПоиска.ТолькоОстатки = Ложь;
		Если Не ОбъектыРасчетовКорректные.НайтиСтроки(КлючПоиска).Количество() Тогда
			Если ПараметрыГенерацииБезИсключений.Количество() = 1 Тогда
				ПараметрыИсточник = ПараметрыГенерацииБезИсключений[0];
			ИначеЕсли ПараметрыГенерацииБезИсключений.Количество() = 2 Тогда
				ПараметрыИсточник = ?(ПараметрыГенерацииБезИсключений[0].ТипРасчетов = КлючПоиска.ТипРасчетов, 
					ПараметрыГенерацииБезИсключений[0],
					ПараметрыГенерацииБезИсключений[1]);
			Иначе
				НайденныйПараметрИсточник = ОбъектыРасчетовКорректные.НайтиСтроки(Новый Структура("Организация, ТипРасчетов", 
					КлючРегистра.Организация,
					КлючРегистра.ТипРасчетов));
				Если НайденныйПараметрИсточник.Количество() = 1 Тогда
					ПараметрыИсточник = ПараметрыГенерацииБезИсключений[ОбъектыРасчетовКорректные.Индекс(НайденныйПараметрИсточник[0])];
				Иначе
					ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Не удалось сгенерировать объект расчетов для элемента: %1.'"),
									СсылкаНаЭлемент));
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыГенерацииПоТолькоОстатки = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыИсточник);
			ЗаполнитьЗначенияСвойств(ПараметрыГенерацииПоТолькоОстатки, КлючРегистра);
			ПараметрыГенерацииПоТолькоОстатки.ТолькоОстатки = Истина;
			ПараметрыГенерации.Добавить(ПараметрыГенерацииПоТолькоОстатки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает условие для текста запроса, которое отфильструет только те документы, у которых есть
//	движения по регистрам онлайн взаиморасчетов. Таблица документа должна иметь псевдоним Документ.
//	
// Возвращаемое значение:
// 	Строка - Часть запроса для проверки наличия движений.
Функция ТесктПроверкиДвиженийПоРасчетнымРегистрамОнлайн() Экспорт
	
	Возврат " (ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыСКлиентамиПланОплат
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСКлиентамиПланОплат.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК РасчетыСКлиентамиПланОтгрузок
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСКлиентамиПланОтгрузок.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСКлиентамиПоСрокам.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПланОплат КАК РасчетыСПоставщикамиПланОплат
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСПоставщикамиПланОплат.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПланПоставок КАК РасчетыСПоставщикамиПланПоставок
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСПоставщикамиПланПоставок.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСПоставщикамиПоСрокам.Регистратор))" 
	
КонецФункции

// Возвращает условие для текста запроса, которое отфильструет только те документы, у которых есть
//	движения регистрам офлайн взаиморасчетов. Таблица документа должна иметь псевдоним Документ.
//	
// Возвращаемое значение:
// 	Строка - Часть запроса для проверки наличия движений.
Функция ТесктПроверкиДвиженийПоРасчетнымРегистрамОфлайн() Экспорт
	
	Возврат " (ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСКлиентамиПоДокументам.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСКлиентами.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСПоставщикамиПоДокументам.Регистратор)
	|		ИЛИ ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|			ГДЕ
	|				Документ.Ссылка = РасчетыСПоставщиками.Регистратор))" 
	
КонецФункции

// Параметры:
// 	Объект - ДокументОбъект.
// 	
// Возвращаемое значение:
// 	Булево.
//
Функция ЕстьДвиженияПоРасчетнымРегистрам(Объект) Экспорт
	
	ИмяТипДокумента = Объект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	&ТипДокумента КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|
	| И (&ЕстьДвиженияОнлайн ИЛИ &ЕстьДвиженияОфлайн)"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЕстьДвиженияОнлайн", ТесктПроверкиДвиженийПоРасчетнымРегистрамОнлайн());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ЕстьДвиженияОфлайн", ТесктПроверкиДвиженийПоРасчетнымРегистрамОфлайн());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТипДокумента", "Документ." + ИмяТипДокумента);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Удалить в LTS после 2.5.13
// Проверяет наличие в расшифровке платежа объектов расчетов по управленческой организации, которые не являются текущим документом
//
// Параметры:
//  СсылкаНаДокумент	 - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ПриобретениеТоваровУслуг - Текущий документ
//  РасшифровкаПлатежа	 - ТабличнаяЧасть - Расшифровка платежа текущего документа
// 
// Возвращаемое значение:
//  Булево - Истина, если в расшифровке найдены объекты расчетов по управленческой организации, отличные от текущего документа
//
Функция ЕстьОбъектыРасчетовПоУпрОрганизации(СсылкаНаДокумент, РасшифровкаПлатежа) Экспорт
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ОбъектыРасчетов", РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов"));
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьОбъектыРасчетовПоУпрОрганизации
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	ОбъектыРасчетов.Ссылка В(&ОбъектыРасчетов)
		|	И ОбъектыРасчетов.Объект <> &СсылкаНаДокумент
		|	И ОбъектыРасчетов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьОбъектыРасчетов(Объект, МассивСтруктур)
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		РеквизитОбъектРасчетов     = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ОбъектРасчетов);
		ЭтоСправочник                 = СтруктураПараметров.ЭтоСправочник;
		
		Если РеквизитОбъектРасчетов = Неопределено И НЕ ЭтоСправочник Тогда
			Возврат;
		КонецЕсли;
		
		ТЧЭтапыОплаты              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		
		Если РеквизитОбъектРасчетов <> Неопределено Тогда
			Если СтрРазделить(СтруктураПараметров.ОбъектРасчетов,".").Количество() = 3 Тогда
				Для Каждого СтрокаТЧ Из РеквизитОбъектРасчетов.Данные Цикл
					СтрокаТЧ[РеквизитОбъектРасчетов.Имя] = Справочники.ОбъектыРасчетов.ПустаяСсылка();
				КонецЦикла;
			Иначе
				РеквизитОбъектРасчетов.Данные[РеквизитОбъектРасчетов.Имя] = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			КонецЕсли;
			Если ТЧЭтапыОплаты <> Неопределено И ТЧЭтапыОплаты.Количество() > 0 
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТЧЭтапыОплаты[0],"ОбъектРасчетов") Тогда
				Для Каждого СтрокаТЧ Из ТЧЭтапыОплаты Цикл
					СтрокаТЧ.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураПараметров.ЭтоПродажаЗакупка  И ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
			ТЧРасшифровка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа);
			ТЧРасшифровка.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РеквизитыСправочникаОбъектыРасчетов()
	
	СлужебныеРеквизиты = Новый Массив;
	СлужебныеРеквизиты.Добавить("Ссылка");
	СлужебныеРеквизиты.Добавить("ПометкаУдаления");
	СлужебныеРеквизиты.Добавить("Объект");
	СлужебныеРеквизиты.Добавить("Организация");
	СлужебныеРеквизиты.Добавить("ТипРасчетов");
	СлужебныеРеквизиты.Добавить("ТипСсылки");
	СлужебныеРеквизиты.Добавить("УникальныйИдентификатор");
	
	РеквизитыСправочника = Метаданные.Справочники.ОбъектыРасчетов.Реквизиты;
	
	Реквизиты = Новый Массив();
	
	Для Каждого Реквизит Из РеквизитыСправочника Цикл
		Если СлужебныеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
			Реквизиты.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Реквизиты.Добавить("Наименование");
	
	Возврат Реквизиты;
	
КонецФункции

//	Параметры:
//	
// Возвращаемое значение:
// 	ТаблицаЗначений: 
// 		* Ссылка - СправочникСсылка.ОбъектыРасчетов - Ссылка.
//
Функция ПолучитьОбъектыРасчетовПоФилиалу(МассивСсылок, Организация, ТипРасчетов, ДополнительныеКритерииПоиска = Неопределено)
	
	Если ДополнительныеКритерииПоиска = Неопределено Тогда
		ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ОбъектыРасчетов.Объект КАК Объект,
		|	ОбъектыРасчетов.Контрагент КАК Контрагент,
		|	ОбъектыРасчетов.Партнер КАК Партнер,
		|	ОбъектыРасчетов.Ссылка КАК Ссылка,
		|	ОбъектыРасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ОбъектыРасчетов.ТолькоОстатки КАК ТолькоОстатки,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|ГДЕ
		|	(ОбъектыРасчетов.Организация = &Организация 
		|		ИЛИ ОбъектыРасчетов.Организация.ГоловнаяОрганизация = &Организация)
		|	И ОбъектыРасчетов.Объект В(&МассивСсылок)
		|	И (&ЛюбойТип
		|			ИЛИ ОбъектыРасчетов.ТипРасчетов = &ТипРасчетов)
		|	И (&ЛюбойКонтрагент
		|			ИЛИ ОбъектыРасчетов.Контрагент = &Контрагент)
		|	И (&ЛюбойПартнер
		|			ИЛИ ОбъектыРасчетов.Партнер = &Партнер)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыРасчетов.Объект,
		|	ОбъектыРасчетов.Контрагент,
		|	ОбъектыРасчетов.Партнер,
		|	ОбъектыРасчетов.ТолькоОстатки,
		|	ОбъектыРасчетов.Ссылка";
	
	Запрос.УстановитьПараметр("МассивСсылок",     МассивСсылок);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("ТипРасчетов",      ТипРасчетов);
	Запрос.УстановитьПараметр("Партнер",          ДополнительныеКритерииПоиска.Партнер);
	Запрос.УстановитьПараметр("Контрагент",       ДополнительныеКритерииПоиска.Контрагент);
	Запрос.УстановитьПараметр("ЛюбойТип",         ?(ТипРасчетов = Неопределено, Истина, Ложь));
	Запрос.УстановитьПараметр("ЛюбойПартнер",     ?(ДополнительныеКритерииПоиска.Партнер     = Неопределено, Истина, Ложь));
	Запрос.УстановитьПараметр("ЛюбойКонтрагент",  ?(ДополнительныеКритерииПоиска.Контрагент  = Неопределено, Истина, Ложь));
	
	ОбъектыРасчетов = Запрос.Выполнить().Выгрузить();
	ОбъектыРасчетов.Индексы.Добавить("Объект");
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		СтрокиОбъектов = ОбъектыРасчетов.НайтиСтроки(Новый Структура("Объект", Ссылка));
		Если Не СтрокиОбъектов.Количество() Тогда
			НоваяСтрока = ОбъектыРасчетов.Добавить();
			НоваяСтрока.Объект = Ссылка;
		Иначе
			Для Каждого СтрокаОбъектаРасчетов Из СтрокиОбъектов Цикл
				Если СтрокаОбъектаРасчетов.Количество > 1 Тогда
					ВызватьИсключение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='По ключу ""%1, %2, %3, %4"", найдено несколько объектов расчетов.'"),
						СтрокаОбъектаРасчетов.ТипРасчетов, Ссылка, Организация, СтрокаОбъектаРасчетов.Партнер, СтрокаОбъектаРасчетов.Контрагент));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъектыРасчетов;
	
КонецФункции

Процедура ЗаполнитьОбъектРасчетов(Объект, МассивСтруктур, ОбновлениеДанных = Ложь, РежимЗаписи = Неопределено, ТабЧастиВидыЗапасов = Неопределено)
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		РеквизитОбъектРасчетов     = ОбщегоНазначенияУТКлиентСервер.ДанныеДляПрисвоения(Объект, СтруктураПараметров.ОбъектРасчетов);
		ЭтоСправочник              = СтруктураПараметров.ЭтоСправочник;
		
		Если (РеквизитОбъектРасчетов = Неопределено ИЛИ НЕ СтруктураПараметров.ИзменяетРасчеты) И НЕ ЭтоСправочник
			ИЛИ СтруктураПараметров.Организация = Справочники.Организации.УправленческаяОрганизация Тогда 
			// Для управленческой организации Объект расчетов заполняется перед записью в модуле объекта документа
			Продолжить;
		КонецЕсли;
		
		ЭтоЗаказ                   = СтруктураПараметров.ЭтоЗаказ;
		ЭтоПродажаЗакупка          = СтруктураПараметров.ЭтоПродажаЗакупка;
		ЭтоПлатежИлиПрочийДокумент = СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент;
		ТипРасчетов                = СтруктураПараметров.ТипРасчетов;
		ОрганизацияДоговора        = СтруктураПараметров.ОрганизацияДоговора;
		
		ИмяРеквизитаТЧЗаказ        = СтруктураПараметров.ИмяРеквизитаТЧЗаказ;
		Организация                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
		ЗаказОснование             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ЗаказОснование);
		ТЧ                         = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
		ТЧЭтапыОплаты              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧЭтапыОплаты);
		
		Договор               = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
		НакладнаяПоЗаказам    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НакладнаяПоЗаказам, , Ложь);
		Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
			Ссылка = СтруктураПараметров.СсылкаНового;
		Иначе
			Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка);
		КонецЕсли;
		
		ОбъектРасчетовНеНужен      = Ложь;
		
		ПорядокРасчетов            = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПорядокРасчетов);
		Если ПорядокРасчетов = Неопределено И ЗначениеЗаполнено(Договор) Тогда
			ПорядокРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокРасчетов");
		КонецЕсли;
		
		ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
		ДополнительныеКритерииПоиска.Контрагент = ?(Не СтруктураПараметров.КонтрагентВСтроках,
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент),
			Неопределено);
		ДополнительныеКритерииПоиска.Партнер = ?(Не СтруктураПараметров.ПартнерВСтроках,
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер),
			Неопределено);
		
		ОбъектРасчетовНезаполненнойСтроки = Неопределено;
		ЗаполнятьПоПустомуЗаказу = Ложь;

		Если ОбновлениеДанных Тогда
			ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов) 
					И НЕ СтруктураПараметров.ВалютаВзаиморасчетовВСтроках,
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов),
				ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента));
			ДополнительныеКритерииПоиска.ОбновлениеИБ = Истина;
		КонецЕсли;
			
		//Определение.
		ДополнительныеКритерииПоиска.ВернутьПервый = Истина;
		Если СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) Тогда
			Если ОбновлениеДанных Тогда
				
				ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(
					Ссылка,
					ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация),
					ТипРасчетов,
					ДополнительныеКритерииПоиска);
			Иначе
				ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Ссылка, Организация, ТипРасчетов, ДополнительныеКритерииПоиска);
			КонецЕсли;
		ИначеЕсли ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
			И (ЭтоЗаказ ИЛИ ЭтоПродажаЗакупка ИЛИ ЭтоПлатежИлиПрочийДокумент И ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов))
			ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным И ЭтоЗаказ Тогда
				
			Если НЕ ЗначениеЗаполнено(Договор) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Не заполнено поле ""Договор"".'"),
									Договор));
			КонецЕсли;
			
			ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов, ДополнительныеКритерииПоиска);
			Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) И ЗначениеЗаполнено(ОрганизацияДоговора) Тогда
				ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, ОрганизацияДоговора, ТипРасчетов, ДополнительныеКритерииПоиска);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Не удалось найти объект расчетов для договора %1.'"),
									Договор));
			КонецЕсли;
			
		ИначеЕсли ЭтоПродажаЗакупка И НакладнаяПоЗаказам И НЕ ЗначениеЗаполнено(ИмяРеквизитаТЧЗаказ) И ЗначениеЗаполнено(ЗаказОснование) 
			ИЛИ ЭтоПлатежИлиПрочийДокумент И ЗначениеЗаполнено(ЗаказОснование) И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
			
			ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ЗаказОснование, Организация, ТипРасчетов, ДополнительныеКритерииПоиска);
			
			Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Не удалось найти объект расчетов для %1. Проверьте соответствие ключевых реквизитов заказу.'"),
									ЗаказОснование));
			КонецЕсли;
			
		ИначеЕсли ЭтоПродажаЗакупка И НакладнаяПоЗаказам И ЗначениеЗаполнено(ИмяРеквизитаТЧЗаказ) 
			И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам Тогда
			
			Заказы = ТЧ.ВыгрузитьКолонку(ИмяРеквизитаТЧЗаказ);
			
			ОбъектРасчетовНезаполненнойСтроки = Неопределено;
			КолонкаЗаказыПуста = Истина;
			ЕстьСтрокиСПустымЗаказом = Ложь;
			Если Заказы.Количество() > 0 Тогда
				Для Каждого СтрокаТЧ Из Заказы Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ) Тогда
						КолонкаЗаказыПуста = Ложь;
					Иначе
						ЕстьСтрокиСПустымЗаказом = Истина;
						ЗаполнятьПоПустомуЗаказу = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьСтрокиСПустымЗаказом И ОбновлениеДанных И Не СтруктураПараметров.КонтрагентВСтроках 
						И Не СтруктураПараметров.ПартнерВСтроках Тогда 
						ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Заказы, Неопределено);
						
						ПараметрыПоиска = ПолучитьПараметрыОбъектаРасчетов();
						ПараметрыПоиска.Партнер                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
							Объект, СтруктураПараметров.Партнер);
						ПараметрыПоиска.Контрагент              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
							Объект, СтруктураПараметров.Контрагент);
						ПараметрыПоиска.НаправлениеДеятельности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
							Объект, СтруктураПараметров.НаправлениеДеятельности);
						ПараметрыПоиска.Организация             = Организация;
						ПараметрыПоиска.Договор                 = Договор;
						ПараметрыПоиска.ТипРасчетов             = ТипРасчетов;
						
						ОбъектРасчетовНезаполненнойСтроки = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыПоиска);
				КонецЕсли;
				
				Если Не КолонкаЗаказыПуста Тогда
					ОбъектРасчетов = ПолучитьОбъектыРасчетовПоСсылкам(Заказы, Организация, ТипРасчетов, ДополнительныеКритерииПоиска);
				КонецЕсли;
			Иначе
				Возврат;
			КонецЕсли;
			
			Если Не ОбъектРасчетов = Неопределено Тогда 
				Для Каждого Элемент Из ОбъектРасчетов Цикл
					
					Если НЕ ЗначениеЗаполнено(ОбъектРасчетов.Получить(Элемент.Ключ)) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
						ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru='Не удалось найти объект расчетов для %1. Проверьте соответствие ключевых реквизитов заказу.'"),
											Элемент.Ключ));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		// Корректировки реализации и приобретения.
		ИначеЕсли ЭтоПродажаЗакупка И ЗначениеЗаполнено(СтруктураПараметров.Ссылка) И СтруктураПараметров.Ссылка <> "Объект.Ссылка" 
			И (ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
				ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным
				ИЛИ ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным
				ИЛИ НЕ НакладнаяПоЗаказам И ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказам) Тогда
			ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(
					ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка),
					Организация,
					СтруктураПараметров.ТипРасчетов,
					ДополнительныеКритерииПоиска);
			
			Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Не удалось найти объект расчетов для %1.'"),
									Объект));
			КонецЕсли;
		Иначе
			ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			ОбъектРасчетовНеНужен = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбъектРасчетов) И Не ОбъектРасчетовНеНужен 
			И (ЭтоСправочник ИЛИ ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Проведен")) Тогда
			Если ОбновлениеДанных И Не СтруктураПараметров.КонтрагентВСтроках 
				И Не СтруктураПараметров.ПартнерВСтроках Тогда
					
					ПараметрыПоиска = ПолучитьПараметрыОбъектаРасчетов();
					ПараметрыПоиска.Партнер                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
						Объект, СтруктураПараметров.Партнер);
					ПараметрыПоиска.Контрагент              = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
						Объект, СтруктураПараметров.Контрагент);
					ПараметрыПоиска.НаправлениеДеятельности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
						Объект, СтруктураПараметров.НаправлениеДеятельности);
					ПараметрыПоиска.Организация             = Организация;
					ПараметрыПоиска.Договор                 = Договор;
					ПараметрыПоиска.ТипРасчетов             = ТипРасчетов;
					ПараметрыПоиска.Вставить("ВалютаВзаиморасчетов", ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов);
					
					ОбъектРасчетов = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыПоиска);
					
					Если Не ЗначениеЗаполнено(ОбъектРасчетов) И ЕстьДвиженияПоРасчетнымРегистрам(Объект) Тогда

						//Если расчеты по договорам и партнер и контрагент в документе отличается о таковых в договоре
						//подбираем объект расчетов по тем, что в договоре
						Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
							И (ЭтоЗаказ ИЛИ ЭтоПродажаЗакупка ИЛИ ЭтоПлатежИлиПрочийДокумент И ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов)) Тогда
								Если ЗначениеЗаполнено(Договор) И ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
									ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Договор, Организация, ТипРасчетов);
								КонецЕсли;
						КонецЕсли;
							
						//++ Локализация
						//В документе ОперацияПоЯндексКассе реквизит ОбъектРасчетов обрабатывается как одна 
						//строка ТЧ РасшифровкаПлатежа
						Если ТипЗнч(Объект) = Тип("ДокументОбъект.ОперацияПоЯндексКассе")
							И Не ЗначениеЗаполнено(Объект.ОбъектРасчетов) 
							И ЗначениеЗаполнено(Объект.УдалитьОбъектРасчетов) Тогда
								ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(
									Объект.УдалитьОбъектРасчетов,
									ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация),
									ТипРасчетов,
									ДополнительныеКритерииПоиска);
						КонецЕсли;
						//-- Локализация

						//Для возврата по заявке способ компенсации должен совпадать
						Если Не ЗначениеЗаполнено(ОбъектРасчетов) И Не (ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") И ЗначениеЗаполнено(Объект.ЗаявкаНаВозвратТоваровОтКлиента)
							И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЗаявкаНаВозвратТоваровОтКлиента, "СпособКомпенсации") <> Объект.СпособКомпенсации) Тогда
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Не удалось заполнить объект расчетов в документе: %1'"),
									Ссылка);
				
								ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
									УровеньЖурналаРегистрации.Предупреждение,
									Объект.Метаданные(),
									,
									ТекстСообщения);
						КонецЕсли;
					КонецЕсли;
			Иначе
				Если ОбновлениеДанных И МассивСтруктур.Количество() = 1 
					Или Не ОбновлениеДанных Тогда
					ВызватьИсключение (НСтр("ru = 'Не удалось найти объект расчетов.'"))
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЭтоДокумент = Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка));
		
		Если НЕ ЭтоДокумент
			ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Проведение
				ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект,"Объект.Проведен")) Тогда
			//Присвоение.
			Если РеквизитОбъектРасчетов <> Неопределено Тогда
				Если ТипЗнч(ОбъектРасчетов) = Тип("Соответствие") Тогда
					Для Каждого СтрокаТЧ Из ТЧ Цикл
						СтрокаТЧ[РеквизитОбъектРасчетов.Имя] = ОбъектРасчетов[СтрокаТЧ[ИмяРеквизитаТЧЗаказ]];

						Если Не ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизитаТЧЗаказ]) 
							И Не ЗначениеЗаполнено(СтрокаТЧ[РеквизитОбъектРасчетов.Имя])
							И ЗаполнятьПоПустомуЗаказу 
							И ЗначениеЗаполнено(ОбъектРасчетовНезаполненнойСтроки) 
							И ОбновлениеДанных Тогда
								СтрокаТЧ[РеквизитОбъектРасчетов.Имя] = ОбъектРасчетовНезаполненнойСтроки; 
						КонецЕсли;

					КонецЦикла;
					Если ТЧЭтапыОплаты <> Неопределено И ТЧЭтапыОплаты.Количество() > 0
						И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТЧЭтапыОплаты[0], "Заказ") Тогда
						Для Каждого СтрокаТЧ Из ТЧЭтапыОплаты Цикл
							СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов[СтрокаТЧ.Заказ];

							Если Не ЗначениеЗаполнено(СтрокаТЧ.Заказ) 
								И Не ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчетов)
								И ЗаполнятьПоПустомуЗаказу 
								И ЗначениеЗаполнено(ОбъектРасчетовНезаполненнойСтроки)
								И ОбновлениеДанных Тогда
									СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетовНезаполненнойСтроки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если ОбновлениеДанных И ТабЧастиВидыЗапасов <> Неопределено Тогда
						Для Каждого ТЧВидыЗапасов Из ТабЧастиВидыЗапасов Цикл
							Для Каждого СтрокаТЧ Из Объект[ТЧВидыЗапасов.Ключ] Цикл
								Если Не ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчетов) Тогда
									СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов[СтрокаТЧ[ТЧВидыЗапасов.Значение]];

									Если Не ЗначениеЗаполнено(СтрокаТЧ[ТЧВидыЗапасов.Значение]) 
										И Не ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчетов)
										И ЗаполнятьПоПустомуЗаказу 
										И ЗначениеЗаполнено(ОбъектРасчетовНезаполненнойСтроки) Тогда
										СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетовНезаполненнойСтроки;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
				Иначе
					Если СтрРазделить(СтруктураПараметров.ОбъектРасчетов,".").Количество() = 3 Тогда
						Для Каждого СтрокаТЧ Из РеквизитОбъектРасчетов.Данные Цикл
							СтрокаТЧ[РеквизитОбъектРасчетов.Имя] = ОбъектРасчетов;
						КонецЦикла;
					Иначе
						РеквизитОбъектРасчетов.Данные[РеквизитОбъектРасчетов.Имя] = ОбъектРасчетов;
					КонецЕсли;
					Если ТЧЭтапыОплаты <> Неопределено И ТЧЭтапыОплаты.Количество() > 0 
						И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТЧЭтапыОплаты[0],"ОбъектРасчетов") Тогда
						Для Каждого СтрокаТЧ Из ТЧЭтапыОплаты Цикл
							СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов;
						КонецЦикла;
					КонецЕсли;
					Если ОбновлениеДанных И ТабЧастиВидыЗапасов <> Неопределено Тогда
						Для Каждого ТЧВидыЗапасов Из ТабЧастиВидыЗапасов Цикл
							Для Каждого СтрокаТЧ Из Объект[ТЧВидыЗапасов.Ключ] Цикл
								Если Не ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчетов) Тогда
									СтрокаТЧ.ОбъектРасчетов = ОбъектРасчетов;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Объект - ДокументОбъект 
// 	       - СправочникОбъект 
// 	
// Возвращаемое значение:
// 	см. ВзаиморасчетыСервер.ПараметрыМеханизма.
//
Функция ПараметрыВзаиморасчетовОбъектаРасчетов(Объект) Экспорт
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	Возврат Менеджер.ПараметрыВзаиморасчеты(Объект);
	
КонецФункции

Функция ЭтоПлатежныйДокумент(Объект)
	Возврат ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ОперацияПоПлатежнойКарте")
				//++ Локализация
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ОперацияПоЯндексКассе")
				//-- Локализация
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.АвансовыйОтчет");
КонецФункции

Процедура ЗаполнитьОбъектРасчетовВРасшифровкеПлатежа(Объект, СтруктураПараметров) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаПлатежа    = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
	Ссылка                = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.Ссылка");
	Организация           = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
	ТипРасчетов           = СтруктураПараметров.ТипРасчетов;
	
	КонтрагентВСтроках  = СтруктураПараметров.КонтрагентВСтроках;
	ПартнерВСтроках     = СтруктураПараметров.ПартнерВСтроках;
	
	ЗаказыИзРасшифровкиПлатежа = РасшифровкаПлатежа.ВыгрузитьКолонку("УдалитьЗаказ");
	УникальныеЗаказы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЗаказыИзРасшифровкиПлатежа);
	
	ВалютаВзаиморасчетов = Неопределено;
	ВалютаВзаиморасчетовВТЧ = РасшифровкаПлатежа.Выгрузить(Новый Массив()).Колонки.Найти("ВалютаВзаиморасчетов") <> Неопределено;
	ВалютыВТЧОтлчаются = Ложь;
	Если ВалютаВзаиморасчетовВТЧ Тогда
		УникальныеВалютыВзаиморасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РасшифровкаПлатежа.ВыгрузитьКолонку("ВалютаВзаиморасчетов")); 
		Если УникальныеВалютыВзаиморасчетов.Количество() = 1 Тогда
			ВалютаВзаиморасчетов = УникальныеВалютыВзаиморасчетов[0];
			Если Не ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
				ВалютаВзаиморасчетов = ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов) 
						И ТипЗнч(СтруктураПараметров.ВалютаВзаиморасчетов) = Тип("Строка")
						И СтрЧислоВхождений(СтруктураПараметров.ВалютаВзаиморасчетов,".") < 2,
					ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов),
					ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента));
			КонецЕсли;
		ИначеЕсли УникальныеВалютыВзаиморасчетов.Количество() > 1 Тогда
			ВалютыВТЧОтлчаются = Истина;
		КонецЕсли;
	Иначе
		ВалютаВзаиморасчетов = ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов) 
				И ТипЗнч(СтруктураПараметров.ВалютаВзаиморасчетов) = Тип("Строка")
				И СтрЧислоВхождений(СтруктураПараметров.ВалютаВзаиморасчетов,".") < 2,
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаВзаиморасчетов),
			ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента));
	КонецЕсли;
	
	Для Каждого ПустоеЗначение Из ПустыеЗначенияОбъектРасчетов() Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(УникальныеЗаказы, ПустоеЗначение);
	КонецЦикла;
	
	ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
	ДополнительныеКритерииПоиска.ОбновлениеИБ = Истина;
	
	Если ЭтоПлатежныйДокумент(Объект) 
		Или ВалютыВТЧОтлчаются Тогда
		ОбъектыРасчетовПоЗаказамПлатежныйДокумент = ПолучитьОбъектыРасчетовПоФилиалу(УникальныеЗаказы, Организация, ТипРасчетов);
	Иначе
		ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		ДополнительныеКритерииПоиска.ТолькоРеглУчет = (ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
			И Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
			ИЛИ (ТипЗнч(Объект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг")
			И Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет);
			
			Если Не ПартнерВСтроках Тогда
				ДополнительныеКритерииПоиска.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
			КонецЕсли;
			
			Если Не КонтрагентВСтроках Тогда
				ДополнительныеКритерииПоиска.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
			КонецЕсли;
		
		
		Если НЕ ВалютыВТЧОтлчаются Тогда
			ОбъектыРасчетовПоЗаказам = ПолучитьОбъектыРасчетовПоСсылкам(УникальныеЗаказы, Организация, ТипРасчетов, ДополнительныеКритерииПоиска);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
			Объект,
			СтруктураПараметров.Партнер,
			?(ПартнерВСтроках, СтрокаРасшифровки.НомерСтроки, Неопределено));
		
		Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
			Объект,
			СтруктураПараметров.Контрагент,
			?(КонтрагентВСтроках, СтрокаРасшифровки.НомерСтроки, Неопределено));
			
		ДополнительныеКритерииПоиска = ДополнительныеКритерииПоиска();
		ДополнительныеКритерииПоиска.Партнер = Партнер;
		ДополнительныеКритерииПоиска.Контрагент = Контрагент;
		ДополнительныеКритерииПоиска.ВернутьПервый = Ложь;
		ДополнительныеКритерииПоиска.ОбновлениеИБ = Истина;
		
		Если ВалютаВзаиморасчетовВТЧ Тогда
			Если ЗначениеЗаполнено(СтрокаРасшифровки.ВалютаВзаиморасчетов) Тогда
				ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = СтрокаРасшифровки.ВалютаВзаиморасчетов;
			ИначеЕсли ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
				ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
			КонецЕсли;
		КонецЕсли;
		
		ТребуетсяЗаполнение = Истина;
		Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
			И ЗначениеЗаполнено(СтрокаРасшифровки.УдалитьЗаказ) Тогда
			Если ЭтоПлатежныйДокумент(Объект)
				Или ВалютыВТЧОтлчаются Тогда
				
				Ключ = Новый Структура();
				Ключ.Вставить("Объект", СтрокаРасшифровки.УдалитьЗаказ);
				Если ЗначениеЗаполнено(Партнер) Тогда
					Ключ.Вставить("Партнер", Партнер);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Контрагент) Тогда
					Ключ.Вставить("Контрагент", Контрагент);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов) Тогда
					Ключ.Вставить("ВалютаВзаиморасчетов", ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов);
				КонецЕсли;
				
				НайденныеОбъектыРасчетов = ОбъектыРасчетовПоЗаказамПлатежныйДокумент.НайтиСтроки(Ключ);
				
				Если НайденныеОбъектыРасчетов.Количество() Тогда
					Строка = НайденныеОбъектыРасчетов[0]; //
					СтрокаРасшифровки.ОбъектРасчетов = Строка.Ссылка;
				Иначе 
					Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
						
						Ключ = Новый Структура();
						Ключ.Вставить("Объект", СтрокаРасшифровки.УдалитьЗаказ);
				
						НайденныеОбъектыРасчетовБезДопОтборов = ОбъектыРасчетовПоЗаказамПлатежныйДокумент.НайтиСтроки(Ключ);
						
						Если НайденныеОбъектыРасчетовБезДопОтборов.Количество() = 1 Тогда
							СтрокаРасшифровки.ОбъектРасчетов = НайденныеОбъектыРасчетовБезДопОтборов[0].Ссылка;
							Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
								ГоловнаяОрганизация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ГоловнаяОрганизация").ГоловнаяОрганизация;
								ПоискПоГоловнойОрганизации = ПолучитьОбъектРасчетовПоСсылке(СтрокаРасшифровки.УдалитьЗаказ,
									ГоловнаяОрганизация, ТипРасчетов, ДополнительныеКритерииПоиска);
								Если ЗначениеЗаполнено(ПоискПоГоловнойОрганизации) Тогда
									СтрокаРасшифровки.ОбъектРасчетов = ПоискПоГоловнойОрганизации;
								КонецЕсли;
							КонецЕсли;
						Иначе
							Ключ.Вставить("ТолькоОстатки", Ложь);
							НайденныеОбъектыРасчетовБезДопОтборов = ОбъектыРасчетовПоЗаказамПлатежныйДокумент.НайтиСтроки(Ключ);
							Если НайденныеОбъектыРасчетовБезДопОтборов.Количество() = 1 Тогда
								СтрокаРасшифровки.ОбъектРасчетов = НайденныеОбъектыРасчетовБезДопОтборов[0].Ссылка;
							КонецЕсли;
						КонецЕсли;
					
					КонецЕсли;
									 
				КонецЕсли;
			Иначе
				СтрокаРасшифровки.ОбъектРасчетов = ОбъектыРасчетовПоЗаказам[СтрокаРасшифровки.УдалитьЗаказ];
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
			Если СтруктураПараметров.ЭтоПродажаЗакупка
				И Не ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
				И Не ТипЗнч(Объект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") 
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
					И ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.ХозяйственнаяОперация")
						<> Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг")
					И ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, "Объект.ХозяйственнаяОперация")
						<> Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет Тогда
						Если Не ЗначениеЗаполнено(СтрокаРасшифровки.УдалитьЗаказ) Тогда

							СтрокаРасшифровки.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка();  
							ТребуетсяЗаполнение = Ложь;
						КонецЕсли;

			ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
					
					ПараметрыСоздания = ПолучитьПараметрыОбъектаРасчетов();
					ПараметрыСоздания.Партнер                 = Партнер;
					ПараметрыСоздания.Контрагент              = Контрагент;
					ПараметрыСоздания.НаправлениеДеятельности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НаправлениеДеятельности);
					ПараметрыСоздания.Организация             = Справочники.Организации.УправленческаяОрганизация;
					ПараметрыСоздания.Договор                 = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
					ПараметрыСоздания.ТипРасчетов             = ТипРасчетов;

					Если ВалютаВзаиморасчетовВТЧ И ЗначениеЗаполнено(СтрокаРасшифровки.ВалютаВзаиморасчетов) Тогда
						ПараметрыСоздания.Вставить("ВалютаВзаиморасчетов", СтрокаРасшифровки.ВалютаВзаиморасчетов);
					Иначе
						ПараметрыСоздания.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
					КонецЕсли;
					
					СтрокаРасшифровки.ОбъектРасчетов = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыСоздания);
					
					Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
						
						Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ВалютаВзаиморасчетов) Тогда
							ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
						КонецЕсли;
						
						СтрокаРасшифровки.ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Ссылка, 
							Справочники.Организации.УправленческаяОрганизация,
 							ТипРасчетов,
							ДополнительныеКритерииПоиска);
						Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) Тогда
								ДополнительныеКритерииПоиска.ВалютаВзаиморасчетов = Справочники.Валюты.ПустаяСсылка();
								СтрокаРасшифровки.ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(Ссылка, 
									Справочники.Организации.УправленческаяОрганизация,
 									ТипРасчетов,
									ДополнительныеКритерииПоиска);
						КонецЕсли;
					КонецЕсли;
					
			ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровПоставщику") Тогда
				Если Объект.СпособКомпенсации = Перечисления.СпособыКомпенсацииВозвратовТоваров.ОставитьВКачествеАванса Тогда
					ОбъектРасчетов = Ссылка;
				ИначеЕсли Объект.ДокументПоступления.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
					ИЛИ Объект.ДокументПоступления = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка() 
						И Объект.Договор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор, Ссылка);
				Иначе
					ОбъектРасчетов = Ссылка;
				КонецЕсли;
				СтрокаРасшифровки.ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ОбъектРасчетов,
					Организация,
					ТипРасчетов,
					ДополнительныеКритерииПоиска);
			
			ИначеЕсли  ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
				Если Объект.СпособКомпенсации = Перечисления.СпособыКомпенсацииВозвратовТоваров.ОставитьВКачествеАванса Тогда
					ОбъектРасчетов = Ссылка;
				ИначеЕсли Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор, Ссылка);
				ИначеЕсли Объект.ЗаявкаНаВозвратТоваровОтКлиента <> Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка()
					И Объект.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
						ОбъектРасчетов = Объект.ЗаявкаНаВозвратТоваровОтКлиента;
				Иначе
					ОбъектРасчетов = Ссылка;
				КонецЕсли;
				
				СтрокаРасшифровки.ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ОбъектРасчетов,
					Организация,
					ТипРасчетов,
					ДополнительныеКритерииПоиска);
			
			ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ВозвратТоваровМеждуОрганизациями") Тогда
				Если Объект.РасчетыЧерезОтдельногоКонтрагента Тогда
					ОбъектРасчетов = ?(ЗначениеЗаполнено(Объект.ДоговорПродажи),
						Объект.ДоговорПродажи,
						Ссылка);
				ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорПродажи)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорПродажи, "ПорядокРасчетов")
						= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
					ОбъектРасчетов = Объект.ДоговорПродажи;
				Иначе
					ОбъектРасчетов = Ссылка;
				КонецЕсли;
				
				СтрокаРасшифровки.ОбъектРасчетов = ПолучитьОбъектРасчетовПоСсылке(ОбъектРасчетов,
					Организация,
					ТипРасчетов,
					ДополнительныеКритерииПоиска);
			//++ Локализация


			//-- Локализация

			ИначеЕсли СтруктураПараметров.ЭтоПлатежИлиПрочийДокумент Тогда
				
				ПараметрыСоздания = ПолучитьПараметрыОбъектаРасчетов();
				
				ПараметрыСоздания.Партнер = Партнер;
				ПараметрыСоздания.Контрагент = Контрагент;
				ПараметрыСоздания.НаправлениеДеятельности = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.НаправлениеДеятельности,,Справочники.НаправленияДеятельности.ПустаяСсылка());
				ПараметрыСоздания.Организация             = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
				ПараметрыСоздания.Договор                 = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Договор);
				ПараметрыСоздания.ТипРасчетов             = ТипРасчетов;
					
				Если ПараметрыСоздания.Договор = Неопределено Тогда 
					ПараметрыСоздания.Договор = ?(ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты"),
													Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
													Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка())
				КонецЕсли;
									
				Если ВалютаВзаиморасчетовВТЧ И ЗначениеЗаполнено(СтрокаРасшифровки.ВалютаВзаиморасчетов) Тогда
					ПараметрыСоздания.Вставить("ВалютаВзаиморасчетов", СтрокаРасшифровки.ВалютаВзаиморасчетов);
				Иначе
					ПараметрыСоздания.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
				КонецЕсли;
				
				СтрокаРасшифровки.ОбъектРасчетов = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыСоздания);
				
				//Для документов интеркампани пробуем искать по пустому договору
				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
					И ПараметрыСоздания.Договор = Неопределено
					И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
						ПараметрыСоздания.Договор = Справочники.ДоговорыМеждуОрганизациями.ПустаяСсылка();
					СтрокаРасшифровки.ОбъектРасчетов = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыСоздания);
				КонецЕсли;

				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
					И ПараметрыСоздания.Партнер = Справочники.Партнеры.ПустаяСсылка()
					И ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
						ПараметрыСоздания.Партнер = Справочники.Партнеры.НашеПредприятие;
					СтрокаРасшифровки.ОбъектРасчетов = НайтиОбъектРасчетовПоАналитикеУчетаПоПартнерам(ПараметрыСоздания);
				КонецЕсли;

				Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) 
					И ТипЗнч(Объект) =  Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
					И Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена Тогда
						ТребуетсяЗаполнение = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов) 
			И ТребуетсяЗаполнение
			И СтруктураПараметров.ИзменяетРасчеты
			И Объект.Проведен
			И Не (ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
				И (Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена
				ИЛИ Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована))
			И ЕстьДвиженияПоРасчетнымРегистрам(Объект) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заполнить объект расчетов в документе: %1, в табличной части %2, по заказу %3'"),
					Ссылка,
					СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа,
					СтрокаРасшифровки.УдалитьЗаказ);

			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Объект.Метаданные(),
				,
				ТекстСообщения);

		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Параметры:
// 	Источник - ЛюбаяСсылка.
// 	
// Возвращаемое значение:
// 	Булево.
//
Функция ЕстьБитыеСсылкиВИсточникеОбъектаРасчетов(Источник) Экспорт
	
	Если ЗначениеЗаполнено(Источник) Тогда
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК Поле1
				|ИЗ
				|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
				|ГДЕ
				|	КлючиАналитикиУчетаПоПартнерам.Ссылка = &Ссылка
				|	И (НЕ КлючиАналитикиУчетаПоПартнерам.Организация = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				|				И КлючиАналитикиУчетаПоПартнерам.Организация.Ссылка ЕСТЬ NULL
				|			ИЛИ НЕ КлючиАналитикиУчетаПоПартнерам.Контрагент В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
				|				И КлючиАналитикиУчетаПоПартнерам.Контрагент.Ссылка ЕСТЬ NULL
				|			ИЛИ КлючиАналитикиУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
				|				И КлючиАналитикиУчетаПоПартнерам.Партнер.Ссылка ЕСТЬ NULL
				|			ИЛИ НЕ КлючиАналитикиУчетаПоПартнерам.Договор В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ДоговорыМеждуОрганизациями.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
				|				И КлючиАналитикиУчетаПоПартнерам.Договор.Ссылка ЕСТЬ NULL
				|			ИЛИ КлючиАналитикиУчетаПоПартнерам.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
				|				И КлючиАналитикиУчетаПоПартнерам.НаправлениеДеятельности.Ссылка ЕСТЬ NULL)";
			
			Запрос.УстановитьПараметр("Ссылка", Источник);
			УстановитьПривилегированныйРежим(Истина);
			Возврат Не Запрос.Выполнить().Пустой() Или Не ОбщегоНазначения.СсылкаСуществует(Источник);
			УстановитьПривилегированныйРежим(Ложь);
		Иначе
			Возврат Не ОбщегоНазначения.СсылкаСуществует(Источник);
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли
	
КонецФункции

// Параметры:
// 	Объект - ДокументОбъект,СправочникОбъект - .
// 	
// Возвращаемое значение:
// 	ТаблицаЗначений
//
Функция ТаблицаСторон(Объект, Параметры)
	
	СписокТипов = Новый Массив;
	СписокТипов.Добавить(Тип("СправочникСсылка.Организации"));
	СписокТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ОписаниеТипаПоляКонтрагент = Новый ОписаниеТипов(СписокТипов);
	
	ТаблицаСторон = Новый ТаблицаЗначений;
	ТаблицаСторон.Колонки.Добавить("Контрагент", Новый ОписаниеТипов(ОписаниеТипаПоляКонтрагент));
	ТаблицаСторон.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаСторон.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаСторон.Колонки.Добавить("ВалютаВзаиморасчетов",Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаСторон.Колонки.Добавить("ТипРасчетов",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРасчетовСПартнерами"));
	
	Если ТипЗнч(Параметры) <> Тип("Массив") Тогда
		МассивСтруктур = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры);
	Иначе
		МассивСтруктур = Параметры;
	КонецЕсли;
	
	Для Каждого СтруктураПараметров Из МассивСтруктур Цикл
		
		Если СтруктураПараметров.Свойство("СсылкаНового") Тогда
			Ссылка = СтруктураПараметров.СсылкаНового;
		Иначе
			Ссылка = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Ссылка);
		КонецЕсли;
		
		ОрганизацияВСтроках  = СтруктураПараметров.ОрганизацияВСтроках И ТипЗнч(СтруктураПараметров.Организация) = Тип("Строка");
		КонтрагентВСтроках   = СтруктураПараметров.КонтрагентВСтроках И ТипЗнч(СтруктураПараметров.Контрагент) = Тип("Строка");
		ПартнерВСтроках      = СтруктураПараметров.ПартнерВСтроках И ТипЗнч(СтруктураПараметров.Партнер) = Тип("Строка");
		ВалютаВзаиморасчетовВСтроках = СтруктураПараметров.ВалютаВзаиморасчетовВСтроках И ТипЗнч(СтруктураПараметров.ВалютаВзаиморасчетов) = Тип("Строка");
		ВалютаДокумента = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ВалютаДокумента);
		
		Если ОрганизацияВСтроках ИЛИ КонтрагентВСтроках ИЛИ ПартнерВСтроках ИЛИ ВалютаВзаиморасчетовВСтроках Тогда
			
			Если ОрганизацияВСтроках И КонтрагентВСтроках
				И СтрРазделить(СтруктураПараметров.Организация, ".")[1] <> СтрРазделить(СтруктураПараметров.Контрагент, ".")[1] Тогда
				ВызватьИсключение(НСтр("ru = 'Ошибка встраивания. Отличаются табличные части содержащие контрагента и организацию.'"));
			КонецЕсли;
			
			Если ОрганизацияВСтроках Тогда
				Имена = СтрРазделить(СтруктураПараметров.Организация, ".");
				Имена.Удалить(Имена.ВГраница());
				ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтрСоединить(Имена, ".")); // ТабличнаяЧасть 
			ИначеЕсли КонтрагентВСтроках ИЛИ ПартнерВСтроках ИЛИ ВалютаВзаиморасчетовВСтроках Тогда
				ТабличнаяЧасть = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа); // ТабличнаяЧасть
			КонецЕсли;
			
			ОбъектыРасчетовВСтроках = Ложь;
			Если ТабличнаяЧасть.Количество() > 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличнаяЧасть[0], "ОбъектРасчетов") Тогда
				ОбъектыРасчетовВСтроках = Истина;
				Объекты = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
					ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТабличнаяЧасть.Выгрузить(,"ОбъектРасчетов").ВыгрузитьКолонку("ОбъектРасчетов")),"Объект");
			КонецЕсли;
			
			Для Каждого Стр Из ТабличнаяЧасть Цикл
				
				Если НЕ СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров) 
					И НЕ (ОбъектыРасчетовВСтроках
							И (НЕ ЗначениеЗаполнено(Стр.ОбъектРасчетов)
									ИЛИ Объекты[Стр.ОбъектРасчетов].Объект = Ссылка)) Тогда
					Продолжить;
				КонецЕсли;
				
				НовСтр = ТаблицаСторон.Добавить();
				
				Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
					Идентификатор = Стр.ПолучитьИдентификатор();
				Иначе
					Идентификатор = Стр.НомерСтроки;
				КонецЕсли;
				
				Если ОрганизацияВСтроках Тогда
					НовСтр.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация, Идентификатор);
				Иначе
					НовСтр.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
				КонецЕсли;
				
				Если КонтрагентВСтроках Тогда
					НовСтр.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент, Идентификатор);
				Иначе
					НовСтр.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
				КонецЕсли;
				
				Если ПартнерВСтроках Тогда
					НовСтр.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер, Идентификатор);
				Иначе
					НовСтр.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
				КонецЕсли;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "ВалютаВзаиморасчетов") Тогда
					НовСтр.ВалютаВзаиморасчетов = ?(ЗначениеЗаполнено(Стр.ВалютаВзаиморасчетов), Стр.ВалютаВзаиморасчетов, ВалютаДокумента);
				Иначе
					НовСтр.ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
						Объект, ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов), 
									СтруктураПараметров.ВалютаВзаиморасчетов, 
									СтруктураПараметров.ВалютаДокумента));
				КонецЕсли;
				
				НовСтр.ТипРасчетов = СтруктураПараметров.ТипРасчетов;
				
			КонецЦикла;
			
		Иначе
			Если СсылкаЯвляетсяОбъектомРасчетов(Объект, СтруктураПараметров)
				И (ЗначениеЗаполнено(СтруктураПараметров.ОбъектРасчетов) ИЛИ СтруктураПараметров.ЭтоСправочник)
				ИЛИ СтруктураПараметров.ТолькоОстатки Тогда
				НовСтр = ТаблицаСторон.Добавить();
				НовСтр.Организация = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Организация);
				НовСтр.Контрагент = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Контрагент);
				НовСтр.Партнер = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.Партнер);
				НовСтр.ВалютаВзаиморасчетов = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(
						Объект, ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов), 
									СтруктураПараметров.ВалютаВзаиморасчетов, 
									СтруктураПараметров.ВалютаДокумента));
				НовСтр.ТипРасчетов = СтруктураПараметров.ТипРасчетов;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаСторон;
	
КонецФункции

#КонецОбласти

#КонецЕсли
