
#Область ПрограммныйИнтерфейс

#Область Конструкторы

// Параметры электронного документа.
//
// Возвращаемое значение:
//  Структура - содержит набор данных документа для скачивания:
//   * ЭлектронныйДокумент          - ДокументСсылка - ссылка на электронный документ
//   * ОрганизацияНаименование      - Строка - наименование организации из документа.
//   * КонтрагентНаименование       - Строка - наименование контрагента из документа.
//   * Контрагент                   - Неопределено, ОпределяемыйТип.КонтрагентБЭД - контрагент документа.
//   * СуммаДокумента               - Число - сумма документа.
//   * ВалютаДокумента              - Строка - валюта документа.
//   * СсылкаДляСкачиванияДокумента - Строка - короткая ссылка для скачивания документа.
//   * ПредставлениеДокумента       - Строка - представление электронного документа.
//
Функция НовыеПараметрыЭлектронногоДокумента() Экспорт
	
	ПараметрыДокумента = Новый Структура();
	ПараметрыДокумента.Вставить("ЭлектронныйДокумент");
	ПараметрыДокумента.Вставить("ОрганизацияНаименование", "");
	ПараметрыДокумента.Вставить("КонтрагентНаименование", "");
	ПараметрыДокумента.Вставить("Контрагент");
	ПараметрыДокумента.Вставить("СуммаДокумента", 0);
	ПараметрыДокумента.Вставить("ВалютаДокумента", "");
	ПараметрыДокумента.Вставить("СсылкаДляСкачиванияДокумента", "");
	ПараметрыДокумента.Вставить("ПредставлениеДокумента", "");
	
	Возврат ПараметрыДокумента;
	
КонецФункции

// Возвращает структуру контактной информации по владельцу.
//
// Возвращаемое значение:
//  Структура - содержит контактную информацию по владельцу:
//   * ВладелецКонтакта      - ЛюбаяСсылка - владелец контактной информации.
//   * КодСтраны             - Строка - код страны. По умолчанию Российская Федерация: "+7"
//   * НомерТелефонаБезКодов - Строка - номер телефона, без кода страны и только цифры.
//
Функция НовыйКонтактнаяИнформация() Экспорт
	
	КонтактнаяИнформация = Новый Структура();
	КонтактнаяИнформация.Вставить("ВладелецКонтакта");
	КонтактнаяИнформация.Вставить("КодСтраны", "+7");
	КонтактнаяИнформация.Вставить("НомерТелефонаБезКодов", "");
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

#КонецОбласти

// Возвращает адрес сервиса 1С:Share.
// 
// Возвращаемое значение:
//  Строка - адрес сервиса.
//
Функция АдресСервиса() Экспорт
	
	Возврат "sh.1cfresh.com";
	
КонецФункции

// Возвращает имя подсистемы Share.
// 
// Возвращаемое значение:
//  Строка - имя подсистемы.
//
Функция ИмяПодсистемы() Экспорт
	
	Возврат ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().СервисShare;
	
КонецФункции

// Возвращает имя сервиса Share.
// 
// Возвращаемое значение:
//  Строка - имя сервиса.
//
Функция ИмяСервиса() Экспорт
	
	Возврат "Share";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяПроцедурыЗагрузитьЭлектронныйДокумент() Экспорт
	
	Возврат "ИнтеграцияShare.ЗагрузитьЭлектронныйДокумент";
	
КонецФункции

Функция ИмяПроцедурыСоздатьВУчетеЭлектронныйДокумент() Экспорт
	
	Возврат "ИнтеграцияShare.СоздатьВУчетеЭлектронныйДокумент";
	
КонецФункции

#КонецОбласти