
#Область ПрограммныйИнтерфейс

// См. ИнтеграцияShare.ОпубликоватьИПолучитьСсылкуНаСкачиваниеДокумента
//
Процедура ОпубликоватьИПолучитьСсылкуНаСкачиваниеДокумента(ПараметрыДокумента, Отказ) Экспорт
	
	ИнтеграцияShare.ОпубликоватьИПолучитьСсылкуНаСкачиваниеДокумента(ПараметрыДокумента, Отказ);
	
КонецПроцедуры

// См. ИнтеграцияShare.ЗагрузитьДанныеДокументаПоПубличнойСсылке
//
Процедура ЗагрузитьДанныеДокументаПоПубличнойСсылке(СсылкаДляСкачивания, ДанныеДокумента, Отказ) Экспорт
	
	ИнтеграцияShare.ЗагрузитьДанныеДокументаПоПубличнойСсылке(СсылкаДляСкачивания, ДанныеДокумента, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДлительнаяОперацияВФоне(Знач НаименованиеЗадания, Знач ИмяПроцедуры, Знач УникальныйИдентификатор,
	Знач ДополнительныеПараметры) Экспорт
	
	ДоступныеПроцедуры = ДоступныеИменаПроцедур();
	Если ДоступныеПроцедуры.Найти(ИмяПроцедуры) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение           = 0;
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;

	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ДополнительныеПараметры, ПараметрыВыполнения);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеИменаПроцедур()
	
	ИменаПроцедур = Новый Массив;
	ИменаПроцедур.Добавить(ИнтеграцияShareКлиентСервер.ИмяПроцедурыЗагрузитьЭлектронныйДокумент());
	ИменаПроцедур.Добавить(ИнтеграцияShareКлиентСервер.ИмяПроцедурыСоздатьВУчетеЭлектронныйДокумент());
	
	Возврат ИменаПроцедур;

КонецФункции

#КонецОбласти